{
  "Activity": {
    "A": "Athletics - A collection of running, jumping, and throwing disciplines, known as the foundation of Olympic competitions and a measure of physical fitness.",
    "B": "Basketball - Known for its fast-paced team play, spectacular dunks, and global popularity driven by professional leagues like the NBA.",
    "C": "Coding - Known for enabling the creation of software and driving innovation, coding is celebrated for solving problems and automating tasks across industries.",
    "D": "Dancing - Renowned for combining technical skill, expressive movement, and cultural storytelling, making it a leading form of performance and social art worldwide.",
    "E": "Exploration - Known for discovering new territories and expanding scientific and geographic knowledge.",
    "F": "Football - Known worldwide for its massive global following, iconic international tournaments like the FIFA World Cup, and broad cultural impact.",
    "G": "Golf - Renowned for combining precision and strategy with prestigious international tournaments that draw global attention.",
    "H": "Hiking - Well-known for improving cardiovascular fitness and mental well-being while providing access to natural landscapes.",
    "I": "Improv - Known for fostering spontaneous creativity and quick-thinking in comedy and theatre.",
    "J": "Judo - Renowned for its emphasis on throws and groundwork, use of leverage over strength, and prominence as an Olympic martial art.",
    "K": "Karate - Known for its disciplined striking techniques, kata practice, and global popularity as a martial art and competitive sport.",
    "L": "Lacrosse - A fast-paced team sport, originating from Native American traditions, renowned for its skillful stick-handling, speed, and physical play.",
    "M": "Mountaineering - Renowned for testing human endurance and skill through challenging climbs on high mountains, often involving technical rock and ice routes.",
    "N": "Networking - It is well-known for facilitating professional connections and opportunities that drive career and business growth.",
    "O": "Origami - Known for folding paper into complex and aesthetic models that showcase skill and creativity.",
    "P": "Photography - Celebrated for capturing and communicating visual stories through composition, light, and decisive moments.",
    "R": "Running - A popular aerobic activity known worldwide for improving cardiovascular fitness and endurance while being highly accessible both as recreation and competitive sport.",
    "S": "Surfing - Known for riding waves, requiring excellent balance and technique and becoming an iconic sport and lifestyle.",
    "T": "Tennis - Known for its Grand Slam tournaments, historic rivalries, and widespread global popularity as a premier racket sport.",
    "U": "Ultramarathon - Known for pushing human endurance far beyond the marathon distance, testing athletes' physical and mental limits in extreme long-distance running events.",
    "V": "Volleyball - A team sport known for its fast, dynamic gameplay with strong attacks and blocks, where coordination and team strategy are key.",
    "Y": "Yoga - A physical and mental practice combining postures, breath control, and meditation, well-known for improving flexibility, strength, and stress reduction.",
    "Z": "Zumba - A high-energy, Latin-inspired dance-fitness program famous for combining easy-to-follow choreography with upbeat music to make cardio workouts fun and accessible."
  },
  "Actor": {
    "A": "Al - Al Pacino is celebrated for his intense, charismatic performances in iconic films like The Godfather and Scarface.",
    "B": "Bale - Christian Bale is renowned for his intense method acting and dramatic physical transformations in roles such as The Machinist, The Fighter, and Batman Begins.",
    "C": "Chaplin - Charlie Chaplin is famous for his iconic \"Tramp\" character and pioneering contributions to silent film acting, directing, and comedy.",
    "D": "DiCaprio - Renowned for his intense, versatile performances in films like Titanic, The Revenant (which earned him an Academy Award), and several acclaimed collaborations with director Martin Scorsese.",
    "E": "Eastwood - Clint Eastwood is renowned for his stoic performances in Westerns and for his acclaimed career as a director and producer.",
    "F": "Foster - Known primarily for her Oscar-winning performances in psychological dramas and her long career as an actress and director.",
    "G": "Gadot - Israeli actor best known for portraying Wonder Woman in the DC films, which made her an international star.",
    "H": "Hoffman - Known for his intense, character-driven performances and iconic roles in films like The Graduate and Rain Man.",
    "I": "Idris - Known for his commanding lead performance in the TV series Luther and prominent film roles that established him as a versatile, charismatic actor.",
    "J": "Joaquin - Known for his intense, transformative performances, particularly his Academy Award-winning portrayal of the Joker.",
    "K": "Kidman - Nicole Kidman is renowned for her versatile performances and awards-winning roles in films such as Moulin Rouge! and The Hours.",
    "L": "Ledger - Heath Ledger is celebrated for his transformative, immersive performances, most famously his Oscar-winning portrayal of the Joker in The Dark Knight.",
    "M": "Meryl - Celebrated for her extraordinary range and record number of Academy Award nominations, she is widely regarded as one of the greatest actresses of her generation.",
    "N": "Neeson - Known for his commanding screen presence and for starring in high-profile action films like Taken as well as acclaimed dramatic roles such as in Schindler's List.",
    "O": "Orlando - Known for his roles as Legolas in The Lord of the Rings and Will Turner in the Pirates of the Caribbean franchises, establishing him as a major action-fantasy star.",
    "P": "Pitt - He is well-known for his charismatic leading roles across major Hollywood blockbusters and acclaimed independent films, and for his influence as a producer.",
    "R": "Rami Malek - Known for his Academy Award-winning portrayal of Freddie Mercury in Bohemian Rhapsody, which showcased his intense character immersion and dramatic range.",
    "S": "Streep - Exceptional actress known for her wide range of roles and record number of nominations and awards, including several Oscars.",
    "T": "Travolta - An American actor who rose to fame with charismatic leads in Grease and Saturday Night Fever and later reinvented his career with a standout role in Pulp Fiction.",
    "U": "Uma - Best known for her breakthrough in Pulp Fiction and for starring as The Bride in Quentin Tarantino's Kill Bill, which cemented her as an iconic film actress.",
    "V": "Viggo - Best known for his acclaimed portrayal of Aragorn in The Lord of the Rings trilogy and for his versatile work across film, writing, and music.",
    "Y": "Yul - Yul Brynner was a film and stage actor renowned for his Oscar-winning portrayal of the King of Siam in The King and I and his iconic shaved head.",
    "Z": "Zendaya - An Emmy-winning actress and singer best known for her breakthrough role in Euphoria and for starring in the recent Spider-Man films."
  },
  "Animal": {
    "A": "Ant - Known for their complex social colonies, division of labor, and remarkable strength relative to their size.",
    "B": "Bat - Bats are well-known for using echolocation to navigate and catch prey in the dark.",
    "C": "Cheetah - Renowned as the fastest land animal, capable of short bursts of speed to catch prey.",
    "D": "Dolphin - Renowned for their high intelligence, complex social behavior, and use of echolocation for communication and hunting.",
    "E": "Elephant - Renowned for their intelligence, complex social structures, and exceptional memory.",
    "F": "Falcon - Falcons are famous for their extraordinary flight speed and precise hunting dives, making them apex aerial predators.",
    "G": "Giraffe - Known for its exceptionally long neck and legs, making it the tallest land animal and well-adapted to browse leaves high in trees.",
    "H": "Horse - Renowned for early domestication and long-standing roles in transportation, agriculture, and sport.",
    "I": "Iguana - Known in the pet trade and herpetology for their large size, vivid appearance, and distinctive dewlap and dorsal crest.",
    "J": "Jaguar - A powerful American predator known for its strength and ability to hunt in water.",
    "K": "Kangaroo - Known for powerful hind legs and distinctive hopping, it is an iconic Australian marsupial that carries its young in a pouch.",
    "L": "Lion - Known as the \"king of the savannah\" due to its strength, imposing mane, and social life in packs.",
    "M": "Meerkat - Known for its cooperative social structure and sentinel behavior, where individuals take turns watching for predators to protect the group.",
    "N": "Narwhal - Famous for its long spiral tusk, which is actually an elongated tooth used for sensing and has earned it the nickname \"unicorn of the sea\".",
    "O": "Owl - Known for its exceptional vision and hunting skills, often appearing as a symbol of strength and freedom.",
    "P": "Penguin - Famous for their black-and-white plumage and expert swimming and diving skills.",
    "R": "Raccoon - Known for their dexterous front paws and problem-solving intelligence, raccoons are famous for raiding garbage and adapting to urban environments.",
    "S": "Shark - Known as apex marine predators, famous for powerful jaws, sharp teeth, and a key role in maintaining ocean ecosystem balance.",
    "T": "Tiger - A well-known apex predator and cultural icon, famous for its distinctive striped coat, strength, and hunting prowess.",
    "U": "Uakari - Known for their bright red faces and unusually short tails, which make them distinctive among Amazonian monkeys.",
    "V": "Vulture - Known for feeding on carrion and playing a crucial ecological role by recycling nutrients and reducing disease.",
    "Y": "Yak - Known for their exceptional high-altitude adaptations and long history of domestication as pack, milk, and wool animals in Himalayan regions.",
    "Z": "Zebra - Known for their bold black-and-white stripes, which aid in camouflage, social recognition within herds, and deterring biting flies."
  },
  "Athlete": {
    "A": "Ali - Legendary American boxer Muhammad Ali, three-time world heavyweight champion and cultural icon.",
    "B": "Bolt - Jamaican sprinter, world record holder in the 100m and 200m, widely regarded as the fastest man ever.",
    "C": "Curry - American basketball player known for revolutionizing the sport with his exceptional three-point shooting and ball-handling.",
    "D": "Djokovic - Serbian tennis player and multiple Grand Slam champion.",
    "E": "Eusebio - Portuguese football legend, prolific striker in the 1960s and Ballon d'Or winner.",
    "F": "Federer - Swiss tennis legend, former world No. 1 and 20-time Grand Slam champion.",
    "G": "Gretzky - Canadian hockey player, considered one of the best NHL players of all time.",
    "H": "Harden - James Harden, American NBA guard known for elite scoring, playmaking and his signature step-back three.",
    "I": "Iverson - American basketball guard and Hall of Famer known for prolific scoring and a signature crossover dribble.",
    "J": "Jordan - Michael Jordan, American basketball legend who led the Chicago Bulls to six NBA championships.",
    "K": "Kareem - Legendary NBA center who won six championships and is the league's all-time leading scorer.",
    "L": "LeBron - American basketball player and NBA superstar, widely regarded as one of the greatest.",
    "M": "Messi - Argentine footballer widely regarded as one of the greatest players ever.",
    "N": "Nadal - Spanish tennis player, multiple Grand Slam winner known for his clay-court dominance.",
    "O": "Ovechkin - Russian professional ice hockey player, one of the NHL's all-time leading goal scorers.",
    "P": "Phelps - American swimmer, the most decorated Olympian with 28 medals.",
    "R": "Ronaldo - Portuguese footballer, one of the game's all-time greats and multiple Ballon d'Or winner.",
    "S": "Serena - American tennis player, 23-time Grand Slam singles champion.",
    "T": "Tsitsipas - Greek professional tennis player Stefanos Tsitsipas, known for his powerful one-handed backhand and high ATP rankings.",
    "U": "Uchimura - Japanese gymnast, multiple Olympic and World All-Around champion.",
    "V": "Vonn - American skier, Olympic medalist and World Cup winner.",
    "Y": "Yao - Chinese basketball center Yao Ming, NBA All‑Star and Hall of Famer.",
    "Z": "Zlatan - Swedish footballer known for prolific goalscoring, technical skill, physical presence, and charismatic personality."
  },
  "Beverages": {
    "A": "Aperol - An Italian bitter apéritif famous worldwide for its bright orange color and as the key ingredient in the popular Aperol Spritz.",
    "B": "Budweiser - A globally recognized American lager known for its mass-market presence, iconic advertising, and sponsorship of major sporting events.",
    "C": "Coke - A globally recognized cola brand known for its iconic taste, extensive marketing, and cultural impact.",
    "D": "Daiquiri - A classic rum cocktail renowned for its perfectly balanced combination of rum, lime, and sugar and its historical association with Cuba.",
    "E": "Espresso - A concentrated coffee brewed by forcing hot water through finely-ground beans, celebrated for its intense flavor and as the essential base for many popular coffee drinks.",
    "F": "Fanta - A fruit-flavored carbonated soft drink from Coca-Cola, known globally for its vibrant citrus tastes and wide range of flavors.",
    "G": "Guinness - A famous Irish stout known for its creamy head, distinctive roasted flavor, and iconic status built from centuries of brewing tradition.",
    "H": "---",
    "I": "Irn-Bru - A bright orange Scottish soft drink renowned for its distinctive, slightly citrusy flavor and enduring popularity as Scotland’s iconic alternative to cola.",
    "J": "Jägermeister - A German herbal liqueur known for its unique recipe of 56 herbs and strong international brand, often consumed as a shot.",
    "K": "Kombucha - A fizzy fermented tea known for its tangy flavor and popularity as a probiotic-rich health drink.",
    "L": "Latte - A popular espresso-based coffee drink known for its smooth blend of espresso and steamed milk, widely served in cafés around the world.",
    "M": "Matcha - Finely ground Japanese green tea powder renowned for its vibrant flavor, high antioxidant content, and central role in traditional tea ceremonies and contemporary beverages.",
    "N": "Nescafé - A globally popular instant coffee brand known for popularizing convenient, ready-to-mix coffee and widespread availability.",
    "O": "Oolong - A traditional partially oxidized Chinese tea celebrated for its complex, aromatic flavors and its prominence in tea culture.",
    "P": "Pepsi - A globally recognized cola brand known for its iconic advertising, pop-culture endorsements, and long-running rivalry with Coca-Cola.",
    "R": "Riesling - A renowned white wine grape and wine style prized for its aromatic complexity, vibrant acidity, and exceptional aging potential.",
    "S": "Sprite - A lemon-lime soft drink by Coca-Cola, famous worldwide for its crisp, refreshing taste and strong, long-standing marketing.",
    "T": "Tea - Known for its diverse flavors and deep cultural tradition, as one of the most widely consumed beverages in the world.",
    "U": "Umeshu - A sweet Japanese plum liqueur prized for its fruity aroma and versatility as a sipping drink and cocktail ingredient.",
    "V": "Vodka - A clear distilled spirit renowned worldwide for its neutral flavor, versatility in cocktails, and cultural importance in Eastern Europe.",
    "Y": "Yakult - A Japanese probiotic drink famous worldwide for containing the Lactobacillus casei Shirota strain and promoting digestive health.",
    "Z": "Zubrowka - A famous Polish vodka flavored with bison grass, known for its distinctive herbal aroma and traditional pairing with apple juice."
  },
  "Bird": {
    "A": "Albatross - Renowned for its enormous wingspan and extraordinary ability to glide thousands of miles across the open ocean.",
    "B": "Bluebird - Famous for its bright blue plumage and cheerful song, and widely celebrated as a symbol of happiness in folklore and among birdwatchers.",
    "C": "Condor - A large predatory bird known for its impressive wingspan and ability to long glide flight.",
    "D": "Dodo - An extinct flightless bird from Mauritius, famous as an enduring symbol of human-caused extinction.",
    "E": "Emu - A large non-flying bird from Australia, known for its impressive size and speed.",
    "F": "Falcon - Renowned for exceptional aerial hunting and, in species like the peregrine, astonishing high-speed dives.",
    "G": "Gyrfalcon - The largest falcon species, renowned for its power and long-standing importance in falconry.",
    "H": "Hummingbird - Famous for their ability to hover and their extremely rapid wingbeats that allow them to feed on nectar.",
    "I": "Ibis - Known for its long, curved beak and specialization in hunting insects in wetlands.",
    "J": "Jay - Famous for its striking blue plumage and loud calls, especially the North American Blue Jay known for its intelligence and bold, noisy behavior.",
    "K": "Kiwi - A non-flying bird and national symbol of New Zealand, known for its nocturnal lifestyle and highly developed sense of smell.",
    "L": "Lyrebird - Famous for its extraordinary ability to mimic a wide range of natural and artificial sounds.",
    "M": "Macaw - A large, colorful parrot famous for its striking plumage, high intelligence, and ability to mimic human speech.",
    "N": "Nandu - A large non-flying South American bird known for its fast running and resemblance to a puma.",
    "O": "Ostrich - Known as the largest non-flying bird in the world, known for its high running speed and powerful legs.",
    "P": "Penguin - Known for being flightless birds highly adapted to swimming and diving, making them iconic in wildlife studies and popular culture.",
    "R": "Raven - Known for remarkable intelligence, problem-solving and tool use, as well as a prominent role in myths and literature.",
    "S": "Swan - A large waterbird celebrated for its graceful white plumage and symbolic role in myths, art, and ballet.",
    "T": "Toucan - Known for its large, colorful bill and distinctive appearance, making it an iconic symbol of tropical birds.",
    "U": "Umbrellabird - Known for its prominent \"umbrella-like\" tuft on its head and loud vocalizations used during courtship.",
    "V": "Vulture - A scavenging bird well-known for feeding on carrion and providing an essential ecological service by rapidly removing carcasses and limiting disease spread.",
    "Y": "Yellowhammer - A common European bunting famed for its bright yellow head and catchy, melodic song that appears in folk culture.",
    "Z": "Zebrafinch - A widely used model organism for studying vocal learning and neurobiology because males learn and produce complex, culturally transmitted songs."
  },
  "Body Part": {
    "A": "Aorta - The aorta is the largest artery in the body, famous for carrying oxygenated blood from the heart to the rest of the body.",
    "B": "Brain - Renowned as the central organ for thought, memory, and control of bodily functions, making it the primary focus of neuroscience and cognitive science.",
    "C": "Cortex - The cerebral cortex is famous for governing higher cognitive functions such as perception, language, and decision-making.",
    "D": "Diaphragm - The diaphragm is the primary muscle of respiration, famous for its essential role in breathing and voice control.",
    "E": "Eye - The organ of sight, renowned for enabling vision and central to studies in optics, neuroscience, and artistic expression.",
    "F": "Face - Famous for enabling personal identity recognition and rich nonverbal communication through facial expressions.",
    "G": "Gluteus - Known as the main muscle of the buttocks, valued for its strength, shape, and key role in walking, running, and strengthening.",
    "H": "Heart - The heart is famous for pumping blood and sustaining the circulation that keeps the body alive.",
    "I": "Iris - The colored part of the eye that controls pupil size and is well-known both in ophthalmology and for biometric identification.",
    "J": "Jaw - Essential for chewing, speaking, and shaping the lower face, making it central to dentistry and maxillofacial surgery.",
    "K": "Knee - The knee is well-known for bearing the body's weight and enabling walking, running, and jumping, making it a central focus in orthopedics and sports medicine.",
    "L": "Liver - The liver is well-known for its vital roles in detoxification, metabolism, and production of essential proteins and bile, making it central to overall health.",
    "M": "Muscle - Renowned in fitness and physiology for producing movement and generating force through contraction.",
    "N": "Nose - Renowned for detecting odors and facilitating respiration, making it central to both smell and breathing.",
    "O": "Ovary - Produces eggs and hormones and is central to studies of reproduction and fertility.",
    "P": "Pancreas - The pancreas is well-known for producing insulin and digestive enzymes, and its dysfunction is central to diabetes and pancreatitis.",
    "R": "Retina - The retina is the light-sensitive tissue at the back of the eye essential for vision and widely studied due to diseases like macular degeneration and diabetic retinopathy.",
    "S": "Skin - The largest organ of the body, known for protecting internal tissues, regulating temperature, and providing sensory perception.",
    "T": "Tongue - Vital for taste perception, speech articulation, and manipulating food during chewing and swallowing.",
    "U": "Uvula - A small hanging muscle appendage on the soft palate, known for its role in speech, swallowing, and triggering the gag reflex.",
    "V": "Ventricle - The heart's main pumping chamber, widely studied in cardiology because its function determines cardiac output and is central to many heart diseases.",
    "Y": "Y-chromosome - A sex chromosome that determines maleness in most mammals and is well-known for carrying genes crucial to male development and for tracing paternal lineage.",
    "Z": "Zub - Known in dentistry and everyday life for its key role in chewing, swallowing, and as an indicator of oral health."
  },
  "Book": {
    "A": "Atonement - Renowned for its inventive narrative structure and powerful exploration of guilt, memory, and the moral consequences of storytelling in contemporary literature.",
    "B": "Bible - The most influential religious text, known as the foundation of Christian and Jewish traditions and a source of widespread cultural, historical, and moral influence.",
    "C": "Cosmos - Carl Sagan’s vivid, accessible exploration of the universe popularized astronomy and scientific thinking for a broad audience.",
    "D": "Dune - A landmark science-fiction novel renowned for its intricate world-building, deep ecological and political themes, and lasting influence on the genre.",
    "E": "Educated - Tara Westover's memoir is celebrated for its raw, deeply personal account of escaping a restrictive, survivalist upbringing through self-education and resilience.",
    "F": "Frankenstein - Mary Shelley's novel is considered a foundational work of science fiction and Gothic literature for its exploration of creation, responsibility, and the ethical consequences of unchecked scientific ambition.",
    "G": "Germinal - Emil Zola's novel is known for its naturalistic and realistic portrayal of the harsh living conditions of miners and social critique of the industrial society.",
    "H": "Hiroshima - John Hersey's reportage, which vividly describes the fates of survivors and became the pioneering work of the literary reportage genre on atomic bombing.",
    "I": "Iliad - A foundational epic of ancient Greek literature celebrated for its profound exploration of heroism, mortality, and the human cost of war, which shaped Western narrative and poetic traditions.",
    "J": "Jaws - Famous for its tense sea-based suspense and for spawning the modern summer blockbuster through Steven Spielberg’s influential film adaptation.",
    "K": "Kallocain - An influential dystopian novel by Karin Boye, noted for its prescient exploration of surveillance, state control, and the erosion of individual identity under totalitarian regimes.",
    "L": "Leviathan - Thomas Hobbes' Leviathan is renowned in political philosophy for articulating social contract theory and arguing that a strong sovereign is necessary to prevent the chaos of the state of nature.",
    "M": "Meditations - A foundational Stoic work by Marcus Aurelius, renowned for its concise, practical reflections on virtue and inner resilience that have deeply influenced ethical and self-help thought.",
    "N": "Neuromancer - A seminal cyberpunk novel that helped define the genre through its depiction of cyberspace, AI, and hacker culture.",
    "O": "Outliers - Malcolm Gladwell's bestseller is well-known for explaining how extraordinary success arises from a mix of opportunity, cultural background, and prolonged practice, popularizing the \"10,000-hour\" rule.",
    "P": "Persuasion - Celebrated in English literature for its mature, restrained portrayal of love, regret, and social class, exemplifying Jane Austen's subtle irony and deep characterisation.",
    "R": "Roots - Alex Haley's Roots is renowned for tracing African-American ancestry through a multi-generational narrative that brought national attention to slavery's legacy and popularized genealogical storytelling.",
    "S": "Sapiens - Widely known in popular history and anthropology for its engaging, big-picture synthesis of human evolution, cultural development, and the forces shaping modern society.",
    "T": "Tractatus - Wittgenstein’s Tractatus Logico-Philosophicus is famous in philosophy for proposing a concise picture theory of language and profoundly shaping analytic philosophy and logical positivism.",
    "U": "Ulysses - Famous for pioneering stream-of-consciousness narrative and radical experimentation with form, profoundly influencing modernist literature.",
    "V": "V. - A landmark postmodern novel by Thomas Pynchon, known for its complex, fragmented narrative and influential experimental style.",
    "Y": "Youth - Joseph Conrad's novella is celebrated for its lyrical prose and vivid portrayal of youthful idealism and memory, making it a classic in modernist literature.",
    "Z": "Zámek - Kafka's unfinished novel is famous for the feeling of alienation, absurd bureaucracy, and existential atmosphere, which makes it one of the masterpieces of modernist literature."
  },
  "Capital City": {
    "A": "Athens - The capital of Greece, famous for its ancient history and the Acropolis.",
    "B": "Beijing - The capital of the People’s Republic of China, a major political, cultural and historical center.",
    "C": "Cairo - Capital of Egypt, located on the Nile River.",
    "D": "Dhaka - Capital of Bangladesh.",
    "E": "Edinburgh - Capital of Scotland, famed for its historic Old Town and annual festivals.",
    "F": "Freetown - Main city of Sierra Leone on the west coast of Africa.",
    "G": "Georgetown - Capital of Guyana.",
    "H": "Helsinki - The capital city of Finland, located on the shores of the Gulf of Finland.",
    "I": "Islamabad - Capital of Pakistan and its political-administrative center.",
    "J": "Jakarta - Capital of Indonesia, located on the northwest coast of Java.",
    "K": "Kyiv - Capital of Ukraine",
    "L": "Lisbon - Capital of Portugal on the Tagus River, known for its historic neighborhoods and maritime heritage.",
    "M": "Madrid - Capital of Spain, known for the Royal Palace and the Prado Museum.",
    "N": "Nairobi - Capital and largest city of Kenya, notable for Nairobi National Park and its role as an East African economic hub.",
    "O": "Oslo - Main city of Norway.",
    "P": "Praha - Main city of the Czech Republic.",
    "R": "Riga - Capital of Latvia on the Baltic Sea.",
    "S": "Seoul - Capital of South Korea, a major technology and cultural center.",
    "T": "Tokyo - Capital of Japan, a major global city known for its mix of modernity and tradition.",
    "U": "Ulaanbaatar - Capital of Mongolia.",
    "V": "Vienna - Capital of Austria, renowned for classical music, imperial architecture and historic coffeehouse culture.",
    "Y": "Yerevan - Capital of Armenia.",
    "Z": "Zagreb - The capital of Croatia."
  },
  "Chemical Element": {
    "A": "Argon - A noble gas well-known for providing an inert atmosphere in welding and lighting and for its use in gas discharge tubes.",
    "B": "Boron - Widely known for its use in borosilicate glass and as a semiconductor dopant, providing heat resistance and valuable electronic properties.",
    "C": "Carbon - Known as the foundation of organic chemistry and life due to its ability to form stable covalent chains and various allotropic forms (diamond, graphite, graphene).",
    "D": "Dysprosium - Widely used in high-performance permanent magnets and as a neutron absorber in reactors because of its strong magnetic properties and high neutron cross-section.",
    "E": "Europium - A rare-earth metal widely known for its use in red phosphors for fluorescent lighting and in luminescent anti-counterfeiting features on banknotes.",
    "F": "Fluorine - The most reactive and electronegative element, well-known for forming fluorides used in toothpaste and for producing fluoropolymers like Teflon.",
    "G": "Gold - Renowned for its historical and economic value and widely used in jewelry, coinage, and electronics due to its malleability, resistance to corrosion, and excellent electrical conductivity.",
    "H": "Hydrogen - The lightest and most abundant element, famous for powering stars via nuclear fusion and for its potential as a clean energy carrier.",
    "I": "Indium - Known primarily for its use in transparent conductive layers (indium‑tin‑oxide) for touchscreens and photovoltaics.",
    "J": "None - There is no chemical element whose standard English name begins with the letter \"J.\"",
    "K": "Krypton - A noble gas best known for its use in lighting (krypton-filled bulbs) and specialized lasers due to its distinct spectral lines and chemical inertness.",
    "L": "Lithium - A soft, light alkali metal best known for its central role in rechargeable lithium-ion batteries that power most portable electronics and electric vehicles.",
    "M": "Mercury - Known for being the only common metal that is liquid at room temperature and for its historical use in thermometers and industrial processes despite its toxicity.",
    "N": "Nitrogen - Major constituent of Earth's atmosphere and essential for life, widely known for its role in fertilizers and the nitrogen cycle.",
    "O": "Oxygen - Vital for combustion and aerobic respiration, making it central to life, medicine, and many industrial processes.",
    "P": "Phosphorus - Essential for life and agriculture as a key component of DNA, ATP, and widely used in fertilizers.",
    "R": "Radon - A radioactive noble gas best known for accumulating in indoor air and being a leading cause of lung cancer among non-smokers.",
    "S": "Sulfur - Known for its key role in producing sulfuric acid and its widespread industrial use in fertilizers, chemicals, and vulcanization of rubber.",
    "T": "Titanium - Renowned in aerospace and biomedical engineering for its exceptional strength-to-weight ratio, corrosion resistance, and biocompatibility.",
    "U": "Uranium - A heavy radioactive element best known for its fissile isotope U-235, which makes it the primary fuel for nuclear reactors and a key material in nuclear weapons.",
    "V": "Vanadium - Widely used to strengthen steel alloys and as an active component in catalysts and vanadium redox-flow batteries.",
    "Y": "Yttrium - A transition metal widely used in LEDs, phosphors, and superconductors because its electronic and crystal properties make it valuable for optoelectronic and high-temperature materials.",
    "Z": "Zinc - Known for its role in galvanizing steel and its essential role as an essential trace element in organisms."
  },
  "Clothing": {
    "A": "Anorak - A waterproof jacket with a hood, known for its functionality in cold and wet weather and popularity in outdoor and fashion.",
    "B": "Blazer - A classic tailored jacket originally linked to rowing clubs and naval uniforms, now famous for its versatile role in smart-casual and formal dressing.",
    "C": "Cardigan - A sweater with a front opening named after the Duke of Cardigan, known for comfort and universal style.",
    "D": "Dirndl - A traditional Alpine dress known for its fitted bodice and full skirt, celebrated as an iconic symbol of Bavarian and Austrian folk culture.",
    "E": "Escada - A luxury fashion brand known for glamorous, feminine designs and high-end ready-to-wear.",
    "F": "Fedora - A classic felt hat with an indented crown and brim, famous for its association with vintage menswear and iconic film-noir style.",
    "G": "Gucci - Italian luxury fashion house known for its iconic logo, exclusive leather products, and significant influence on global fashion.",
    "H": "Hoodie - A comfortable hooded sweatshirt known for its influence in streetwear fashion and as a symbol of casualness.",
    "I": "Ikat - A traditional resist-dyed textile technique famed for its distinctive blurred patterns widely used in garments across Asia and Latin America.",
    "J": "Jeans - Durable denim trousers that became globally iconic for their versatility, cultural significance, and widespread adoption across fashion and everyday wear.",
    "K": "Kimono - A traditional Japanese garment celebrated worldwide for its elegant silhouette, intricate fabrics, and deep cultural significance.",
    "L": "Levi's - They are famous for popularizing blue jeans and shaping global denim culture.",
    "M": "Macintosh - A waterproof coat named after the inventor Charles Macintosh, known for its effectiveness in protecting against rain.",
    "N": "Necktie - A necktie is a narrow piece of fabric worn around the neck and tied in front, well-known as a classic symbol of formal and business attire.",
    "O": "Overcoat - A long outer garment designed for warmth and style, traditionally associated with formal and winter attire.",
    "P": "Parka - A hooded, insulated coat known for exceptional warmth and weather resistance, widely used in cold climates and military outerwear.",
    "R": "Reebok - A well-known sports footwear and clothing brand due to its iconic sneakers, innovations for fitness, and long-term collaborations with athletes.",
    "S": "Sari - A traditional South Asian garment known for its graceful drape and deep cultural significance across India and neighboring countries.",
    "T": "T-shirt - A universal and comfortable short-sleeved shirt known worldwide for its simplicity and as a medium for branding and identity.",
    "U": "Ushanka - A traditional Russian fur hat with ear flaps, famous for its exceptional warmth and iconic association with Russian and Soviet winter wear.",
    "V": "Versace - Italian luxury fashion house famous for bold prints, glamorous designs, and a strong celebrity and pop-culture presence.",
    "Y": "Yeezy - Known for its high-demand, fashion-forward sneakers and apparel designed by Kanye West that reshaped sneaker hype culture.",
    "Z": "Zootsuit - A flamboyant men's suit from the 1930s–40s, famous for its exaggerated silhouette and its role as a symbol of jazz-era style and cultural resistance."
  },
  "Color": {
    "A": "Aqua - A cyan-like named color widely known in web design and digital graphics for being a standard CSS color and a vivid blue-green choice.",
    "B": "Blue - Famous as a primary color prized in art, design, and branding for its calming versatility and strong cultural symbolism.",
    "C": "Cyan - A bright greenish-blue, one of the four CMYK printing inks and a staple in design and digital color palettes.",
    "D": "DodgerBlue - Known as the named web color and is widely associated with the Los Angeles Dodgers baseball team.",
    "E": "Emerald - Known as the vibrant green color named after the emerald gemstone, often used in fashion and jewelry.",
    "F": "Fuchsia - A vivid purplish-pink color named after the fuchsia flower, widely known and used in fashion, design, and branding for its bold, eye-catching hue.",
    "G": "Green - Universally recognized for symbolizing nature, growth and environmentalism, and famously used in traffic signals as the \"go\" indication.",
    "H": "Heliotrope - A vivid purplish-pink color named after the heliotrope flower, known for its striking use in art and fashion.",
    "I": "Indigo - A deep blue‑purple color famous for its historical use as a natural dye and its cultural importance in textiles and art.",
    "J": "Jade - The green color named after the jade gemstone, renowned for its cultural significance and frequent use in jewelry and decorative arts.",
    "K": "Khaki - The light brown-green color known as a camouflage color used in military uniforms.",
    "L": "Lavender - A pale purple color named after the lavender flower, famous for its calming, romantic aesthetic and frequent use in fashion and interior design.",
    "M": "Magenta - A vivid purplish-red color famous for its role as one of the four CMYK printing inks and its strong visual impact in design.",
    "N": "Navy - A deep blue color famous for its association with naval uniforms and its enduring use in fashion and design.",
    "O": "Orange - Widely recognized for its high visibility and vibrant energy, making it popular in safety gear, branding, and design.",
    "P": "Purple - Known as the symbol of royal power and wealth due to the rare and precious Tyrian purple.",
    "R": "Red - Known for its strong associations with passion, danger, and visibility, making it a dominant color in design, branding, and signaling.",
    "S": "Scarlet - A vivid red hue widely used in art, fashion, and national flags to symbolize passion, courage, and prominence.",
    "T": "Turquoise - A vivid blue-green named after the gemstone, celebrated in jewelry, art, and design for its striking, calming hue.",
    "U": "Ultramarine - A vivid deep blue pigment originally made from lapis lazuli, historically prized by painters for its brilliance and rarity.",
    "V": "Violet - A well-known spectral color at the short-wavelength end of visible light, famous for its prominent use in art and fashion and its historical association with royalty and creativity.",
    "Y": "Yellow - Famous for its high visibility and strong associations with warmth, caution, and optimism, making it widely used in signage, branding, and art.",
    "Z": "Zaffre - A deep blue pigment historically used in glassmaking and ceramics, prized for its rich indigo color."
  },
  "Comic Book": {
    "A": "Akira - A groundbreaking cyberpunk manga by Katsuhiro Otomo, celebrated for its detailed artwork, complex themes, and lasting influence on comics and animation.",
    "B": "Batman - One of the most iconic comic-book characters, renowned for his dark, detective-driven stories, influential adaptations across media, and an unforgettable rogues' gallery.",
    "C": "Criminal - Celebrated for Ed Brubaker and Sean Phillips's modern noir writing and cinematic art that helped revive the crime-comic genre.",
    "D": "Daredevil - Renowned for pioneering gritty, street-level storytelling and psychologically complex portrayals, especially in landmark runs by Frank Miller and Brian Michael Bendis.",
    "E": "Elektra - A Marvel comic starring the ninja assassin Elektra Natchios, known for its dark, psychologically complex storytelling and influential role as an antihero connected to Daredevil.",
    "F": "Fables - Comic series by Bill Willingham, known for transforming童话 characters into a dark, adult world.",
    "G": "Grendel - A cult comic by Matt Wagner, known for its dark antihero and significant influence on modern independent comics.",
    "H": "Hellboy - Known for combining folklore, horror, and Mike Mignola's distinctive visual style.",
    "I": "Invincible - Known for its mature, character-driven deconstruction of superhero tropes, intense action, and a long, critically acclaimed run by Robert Kirkman.",
    "J": "Joker - The iconic Batman's arch-enemy, known for his chaotic, psychologically complex personality, which brings dark themes to comics and influenced many notable stories.",
    "K": "Kick-Ass - A violent, darkly comic deconstruction of superhero fiction by Mark Millar and John Romita Jr., best known for its controversial realism and successful film adaptation.",
    "L": "Lucifer - Spin‑off of Sandman, known for its dark, philosophical portrayal of a fallen angel and subsequent television adaptation.",
    "M": "Maus - Art Spiegelman's Maus is renowned for its Pulitzer Prize–winning, powerful depiction of the Holocaust using anthropomorphic animals, which helped establish graphic novels as serious literature.",
    "N": "Nexus - A long-running independent sci-fi comic by Mike Baron and Steve Rude, celebrated for its striking painted art and blend of space-opera adventure with noir sensibilities.",
    "O": "Outcast - A horror comic series by Robert Kirkman and Paul Azaceta, known for its intense focus on demonic possession and the creator’s fame from The Walking Dead.",
    "P": "Preacher - A cult-classic comic series by Garth Ennis known for its irreverent, genre-blending storytelling that mixes dark humor, violence, and provocative explorations of religion and morality.",
    "R": "Runaways - Known for its youthful, adult superhero concepts, diverse group of characters, and influential authorship contribution by Brian K. Vaughan.",
    "S": "Sandman - Neil Gaiman's Sandman is celebrated for elevating comics to literary, mythic storytelling through rich, genre-spanning narratives and critical acclaim.",
    "T": "Transmetropolitan - Renowned for Warren Ellis's blistering political satire and the iconic antihero Spider Jerusalem, which helped define cyberpunk social commentary in modern comics.",
    "U": "Uncanny X-Men - A landmark Marvel series renowned for popularizing mutant allegory and ensemble superhero storytelling, launching iconic characters and major crossover events.",
    "V": "Venom - A Marvel comic character and series famous for the alien symbiote bonding with Eddie Brock to create a violent, morally ambiguous antihero who serves as a dark foil to Spider-Man.",
    "Y": "Youngblood - A flagship Image Comics title from the 1990s, known for its flashy, art-driven superhero team and for exemplifying the rise of creator-owned comics.",
    "Z": "Zorro - Iconic masked vigilante whose early pulp and comic adaptations popularized the swashbuckling hero archetype and influenced the development of modern superheroes."
  },
  "Composer": {
    "A": "Adams - John Adams is an American composer famous for his post-minimalist orchestral works and operas like Nixon in China that combine driving rhythms with rich orchestration.",
    "B": "Beethoven - He is celebrated for his groundbreaking symphonies and piano sonatas that expanded the emotional and structural range of Western classical music.",
    "C": "Chopin - Renowned for his poetic piano compositions and innovations in Romantic piano technique, especially his nocturnes, mazurkas, and études.",
    "D": "Debussy - Claude Debussy is celebrated for pioneering musical Impressionism and composing evocative works such as Clair de Lune and Prélude à l'après-midi d'un faune.",
    "E": "Elgar - English composer best known for his \"Pomp and Circumstance\" marches and the Enigma Variations.",
    "F": "Fauré - A French composer renowned for his refined, lyrical melodies and influential art songs, especially remembered for his Requiem.",
    "G": "Gershwin - Renowned for blending classical music with jazz and popular styles, creating enduring works like Rhapsody in Blue and Porgy and Bess.",
    "H": "Haydn - Austrian classical composer, often referred to as the \"father of symphony\" and a key figure in the development of the string quartet.",
    "I": "Ives - Charles Ives is renowned for pioneering American modernism through experimental uses of polytonality, polyrhythms and quotations of vernacular music.",
    "J": "Janáček - A Czech composer known for his operas and innovative musical language inspired by folk speech.",
    "K": "Khachaturian - He is renowned for his rousing, rhythmically vivid orchestral and ballet scores, notably the \"Sabre Dance.\"",
    "L": "Liszt - A Hungarian Romantic composer and virtuoso pianist renowned for his dazzling technique, groundbreaking piano repertoire, and pioneering of the symphonic poem.",
    "M": "Mozart - A towering Classical-era composer celebrated for his prolific output, unforgettable melodies, and lasting influence on opera, symphony, concerto, and chamber music.",
    "N": "Nielsen - Danish composer celebrated for his six symphonies and distinctive contribution to early 20th-century orchestral music.",
    "O": "Orff - A German composer known for his cantata Carmina Burana and the innovative music-educational system Orff-Schulwerk.",
    "P": "Prokofiev - Celebrated for his bold, modern orchestral and ballet works, including Romeo and Juliet and Peter and the Wolf.",
    "R": "Ravel - Maurice Ravel was a French composer famed for his exquisite orchestration and iconic works such as Boléro.",
    "S": "Stravinsky - A pioneering 20th-century composer famous for his groundbreaking rhythms, innovative orchestration and works like The Rite of Spring.",
    "T": "Tchaikovsky - Renowned Russian composer known for his emotionally powerful symphonies and iconic ballets such as Swan Lake, The Nutcracker, and Sleeping Beauty.",
    "U": "Uematsu - Nobuo Uematsu is famous for composing the iconic, emotionally memorable scores for the Final Fantasy video game series.",
    "V": "Vivaldi - Renowned for composing The Four Seasons, a set of violin concertos that vividly depict seasonal scenes and remain central to the Baroque repertoire.",
    "Y": "Yiruma - A Korean pianist and composer known for his emotionally expressive solo piano compositions like \"River Flows in You\".",
    "Z": "Zoltán Kodály - A Hungarian composer and ethnomusicologist famous for integrating Hungarian folk music into his works and for developing the Kodály Method of music education."
  },
  "Country": {
    "A": "Albania - A country in Southeast Europe on the Adriatic Sea, known for its rugged mountains and rich history.",
    "B": "Brazil - A large South American country known for the Amazon and Carnival.",
    "C": "Canada - A North American country known for vast wilderness, multicultural cities, and bilingual (English/French) heritage.",
    "D": "Denmark - A Nordic kingdom on the Jutland Peninsula and islands, known for its high living standards and design.",
    "E": "Egypt - A North African state at the Nile and Suez Canal, known for its ancient monuments.",
    "F": "France - A country in western Europe, known for Paris, gastronomy, and cultural heritage.",
    "G": "Ghana - A West African country known for its gold, cocoa and vibrant cultural heritage.",
    "H": "Haiti - A Caribbean country on the island of Hispaniola.",
    "I": "India - A South Asian country with the world's second-largest population and diverse cultures.",
    "J": "Japan - An island nation in East Asia known for its technology, culture and cuisine.",
    "K": "Kenya - A country in eastern Africa known for safari and national parks.",
    "L": "Latvia - A Baltic country in Northern Europe between Estonia and Lithuania.",
    "M": "Malta - An island country in the Mediterranean Sea.",
    "N": "Nepal - A country in southern Asia in the Himalayas, home of Mount Everest.",
    "O": "Oman - A country on the southeastern coast of the Arabian Peninsula in Western Asia.",
    "P": "Portugal - A southwestern European country on the Iberian Peninsula, known for its maritime history and port wine.",
    "R": "Romania - A country in Southeastern Europe, a member of the European Union.",
    "S": "Spain - A country in Western Europe on the Pyrenees Peninsula.",
    "T": "Turkey - A country in the Middle East on the border of Europe and Asia, known for Istanbul and rich history.",
    "U": "Ukraine - A country in Eastern Europe, known for its fertile plains and Black Sea coastline.",
    "V": "Venezuela - A country in northern South America known for large oil reserves, diverse landscapes, and Angel Falls.",
    "Y": "Yemen - A country on the southern end of the Arabian Peninsula in Western Asia.",
    "Z": "Zimbabwe - A landlocked country in southern Africa, famed for Victoria Falls and the ancient Great Zimbabwe ruins."
  },
  "Currency": {
    "A": "Ariary - The Malagasy ariary is notable for being one of the few non-decimal currencies, with one ariary equal to five iraimbilanja.",
    "B": "Bitcoin - A decentralized cryptocurrency widely known for pioneering blockchain technology and popularizing peer-to-peer digital money.",
    "C": "Cardano - A blockchain currency and platform known for its research-driven development and energy-efficient proof-of-stake consensus.",
    "D": "Dollar - The US dollar is the world's primary reserve currency and is widely used in international trade, finance, and commodities pricing.",
    "E": "Euro - It is well-known as the common currency of many European Union countries, facilitating trade, price transparency, and economic integration.",
    "F": "Franc - A widely used currency name, most notably the Swiss franc (CHF), known as a global safe-haven and store of value.",
    "G": "Guarani - Paraguay's currency, well-known for being named after the indigenous Guaraní people and for its very low unit value compared to major world currencies.",
    "H": "Hryvnia - The national currency of Ukraine, widely known for its volatility and international attention following the 2022 Russian invasion.",
    "I": "INR - The Indian rupee is well-known as the currency of a large, fast-growing economy with extensive domestic use and significant remittance and forex activity.",
    "J": "JPY - The Japanese yen is one of the world’s most traded and liquid currencies, widely used as a safe-haven and major reserve currency in global forex markets.",
    "K": "Koruna - The Czech currency known for its historical continuity and relatively macroeconomic stability in the region.",
    "L": "Lira - A historic currency name used by several countries, now best known for the Turkish lira's modern history of high inflation and redenominations.",
    "M": "Manat - The manat is known as the official currency of Azerbaijan and Turkmenistan, notable for its fluctuations and policy decisions being closely tied to oil and gas export revenues.",
    "N": "Naira - Known as the currency of Nigeria, the largest economy in Africa, often discussed due to its volatility and currency restrictions.",
    "O": "Ouguiya - Historically notable as one of the few non-decimal currencies, being divided into five khoums rather than 100 subunits.",
    "P": "Pound - The pound sterling is one of the world's oldest currencies and is well-known as a major global reserve currency central to British economic and financial history.",
    "R": "Rubl - The Russian currency known for its significant currency fluctuations and strong influence on its value due to political events, sanctions, and energy prices.",
    "S": "Sterling - The British pound sterling (GBP) is one of the world's oldest and most widely traded reserve currencies, serving as a major international financial benchmark.",
    "T": "Tether - A widely used USD-pegged stablecoin known for providing liquidity and serving as a common trading pair across cryptocurrency exchanges.",
    "U": "United States dollar - The world's primary reserve currency, widely used in international trade, finance, and as a benchmark for commodity pricing.",
    "V": "Vatu - The official currency of Vanuatu (VUV), notable for having no decimal subdivision and being primarily used within a small island economy with limited international circulation.",
    "Y": "Yen - The Japanese yen is well-known as a major global reserve and safe-haven currency, widely used in international finance.",
    "Z": "Zloty - The Polish złoty is well-known as Poland's national currency, notable for its stability through economic reforms and its central role in the country's market transition."
  },
  "Dinosaur": {
    "A": "Archaeopteryx - Renowned as a transitional fossil linking non-avian dinosaurs to birds, because it displays both feathers and reptilian skeletal features.",
    "B": "Brachiosaurus - Known for its extremely long neck and giraffe-like upright forelimbs, making it one of the most recognizable giant sauropods.",
    "C": "Carnotaurus - Known for its distinctive bull-like horns and extremely reduced forelimbs, making it one of the most unusual and recognizable abelisaurid theropods.",
    "D": "Diplodocus - A famous sauropod known for its extremely long neck and tail, often exhibited in museums.",
    "E": "Eoraptor - One of the earliest known dinosaurs, prized for its primitive features that illuminate early dinosaur evolution.",
    "F": "Falcarius - Raný terizinosaur známý tím, že představuje přechodnou formu mezi masožravými předky a býložravými adaptacemi.",
    "G": "Giganotosaurus - Velký jihoamerický teropod známý svou enormní velikostí a postavením mezi největšími suchozemskými predátory.",
    "H": "Hadrosaurus - Known as the first nearly complete dinosaur skeleton discovered in North America, which helped establish dinosaurs in scientific and public awareness.",
    "I": "Iguanodon - One of the first dinosaurs scientifically described, famous for its distinctive thumb spike and its important role in early paleontology.",
    "J": "Jinfengopteryx - Known for its well-preserved fossil showing feathers, providing key evidence that some non-avian dinosaurs bore feathers and informing ideas about the origin of birds.",
    "K": "Kentrosaurus - A stegosaurid notable for its distinctive rows of plates and tail spikes, which highlight its defensive adaptations.",
    "L": "Lambeosaurus - Famous for its large hollow cranial crest, likely used for vocalization and visual display among hadrosaurs.",
    "M": "Maiasaura - Known for fossil nesting colonies and direct evidence of parental care, which changed views on dinosaur behavior.",
    "N": "Nigersaurus - Known for its unusually broad, straight-edged snout packed with hundreds of tiny teeth, showing extreme specialization for ground-level browsing.",
    "O": "Oviraptor - Known for being labeled an “egg thief” after its fossils were found with eggs, but later recognized as a brooding parent, reshaping views of dinosaur behavior.",
    "P": "Parasaurolophus - Known for its long, tubular cranial crest, which likely acted as a resonating chamber for low-frequency calls and as a visual display.",
    "R": "Raptor - Popularized by films like Jurassic Park as intelligent, agile predators known for their sickle-shaped toe claws.",
    "S": "Spinosaurus - Known for its distinctive sail-like neural spines and adaptations for a semi-aquatic lifestyle, making it one of the largest and most unusual carnivorous dinosaurs.",
    "T": "Tyrannosaurus - Famous as one of the largest and most iconic carnivorous dinosaurs, known for its massive skull, powerful bite, and prominent role in paleontology and popular culture.",
    "U": "Utahraptor - The largest known dromaeosaurid, renowned for demonstrating that raptor-like dinosaurs could be much bigger and more powerful than previously thought.",
    "V": "Velociraptor - Malý agilní teropod proslulý díky populární kultuře (např. Jurský park) jako inteligentní a rychlý lovecký dinosaurus.",
    "Y": "Yutyrannus - Known as the largest confirmed feathered dinosaur, its discovery provided strong evidence that feathers occurred on large-bodied theropods.",
    "Z": "Zhenyuanlong - A feathered dromaeosaurid from China famous for its large, well-preserved wing-like feathers that revealed complex plumage in non-avian dinosaurs."
  },
  "Disease": {
    "A": "AIDS - Known for causing a global pandemic that transformed public health, accelerated HIV research, and led to the development of life‑saving antiretroviral therapies.",
    "B": "Brucellosis - A zoonotic bacterial infection notable for causing prolonged, undulating fevers and significant occupational risk among farmers and veterinarians.",
    "C": "Cancer - Known for its high global impact and for being the central focus of oncology due to uncontrolled cell growth, high mortality, and complex treatment challenges.",
    "D": "Diabetes - A common chronic metabolic disease widely known for its rapidly rising global prevalence and its major contribution to cardiovascular, renal, and neuropathic complications.",
    "E": "Ebola - Known for its highly lethal hemorrhagic fever and ability to cause widespread epidemics.",
    "F": "Fibromyalgia - Well-known in rheumatology and pain medicine for causing widespread chronic pain and fatigue and for prompting extensive research into central sensitization and multidisciplinary management.",
    "G": "Gout - A form of inflammatory arthritis famed for sudden, severe joint pain and swelling caused by deposition of monosodium urate crystals due to hyperuricemia.",
    "H": "HIV - A virus that attacks the immune system and is best known for causing the global AIDS pandemic, driving major advances in antiviral therapy and public health.",
    "I": "Influenza - A highly contagious respiratory infection best known for causing seasonal epidemics and occasional global pandemics.",
    "J": "Jaundice - A well-known clinical sign in hepatology and neonatology indicating elevated bilirubin from liver dysfunction or hemolysis.",
    "K": "Kuru - A prion disease notorious for causing fatal neurodegeneration among the Fore people through ritual cannibalism, which provided key evidence for transmissible spongiform encephalopathies.",
    "L": "Leukémie - Known in oncology and hematology as a malignant disease of blood-forming cells, significant for its frequency, severity, and intensive research into treatment.",
    "M": "Malaria - A mosquito-transmitted parasitic disease notorious for causing high global morbidity and mortality and for driving major advances in infectious disease control and research.",
    "N": "Norovirus - Known for causing highly contagious, explosive outbreaks of acute gastroenteritis, especially in closed settings like cruise ships and nursing homes.",
    "O": "Onchocerciasis - Known for causing river blindness and being a major focus of mass ivermectin treatment programs that greatly reduced blindness in endemic regions.",
    "P": "Polio - A viral disease famous for causing paralytic outbreaks and for prompting one of the largest global vaccination campaigns aimed at eradication.",
    "R": "Rabies - A viral disease known for causing almost invariably fatal encephalitis in mammals unless treated promptly with post-exposure vaccination.",
    "S": "Smallpox - A historically devastating viral disease best known for being the first human disease eradicated worldwide through a global vaccination campaign.",
    "T": "Tuberculosis - Well-known as a leading infectious killer worldwide and for driving major advances in public health, diagnosis, and antibiotic therapy.",
    "U": "Uveitida - An inflammation of the uveal layer of the eye known in ophthalmology for the risk of permanent vision damage and its frequent association with autoimmune diseases.",
    "V": "Varicella - Known for causing chickenpox and for its vaccine, which dramatically reduced the disease's incidence and complications.",
    "Y": "Yaws - A chronic tropical infection caused by Treponema pertenue, well-known as a neglected tropical disease targeted for eradication because it causes disfiguring skin and bone lesions in children.",
    "Z": "Zika - A mosquito-borne virus best known for causing congenital microcephaly and other neurological complications during outbreaks."
  },
  "Emotion": {
    "A": "Anxiety - A commonly studied emotion in clinical psychology because it underlies many disorders and significantly impairs daily functioning.",
    "B": "Bliss - An intense state of joyful satisfaction widely studied in positive psychology for its strong contribution to overall well-being.",
    "C": "Curiosity - Known for driving exploration and learning, it’s a central emotion studied in psychology and education for its role in motivation and cognitive development.",
    "D": "Disgust - Known in psychology and evolutionary biology for motivating avoidance of contaminants and influencing moral judgments.",
    "E": "Empathy - A core concept in psychology and neuroscience, studied for its role in recognizing others' feelings and motivating prosocial behavior.",
    "F": "Fear - A primary survival emotion widely studied for triggering rapid physiological, cognitive, and behavioral (fight-or-flight) responses to perceived threats.",
    "G": "Gratitude - Gratitude is well-known in psychology for its role in improving well-being and strengthening social bonds.",
    "H": "Happiness - Widely studied in psychology and positive psychology for its central role in well-being, life satisfaction, and health outcomes.",
    "I": "Interest - An emotion of curiosity and focused attention, well-known for motivating exploration, learning, and information-seeking.",
    "J": "Joy - A basic positive emotion widely studied for promoting social bonding, motivating approach behavior, and contributing to psychological well-being.",
    "K": "Kindness - Recognized for strengthening social bonds and improving mental and physical wellbeing through compassionate behavior.",
    "L": "Love - Widely recognized and studied because it underlies attachment, motivates social bonding, and profoundly shapes human behavior and well-being.",
    "M": "Melancholy - Known in psychology and the arts for its association with reflective sadness and creativity.",
    "N": "Nostalgia - A bittersweet longing for the past, well-known in psychology for its role in improving mood, strengthening social bonds, and providing existential meaning.",
    "O": "Optimism - Well-known in positive psychology for its strong associations with resilience, better physical and mental health, and improved life outcomes.",
    "P": "Pride - A well-known self-conscious emotion linked to achievements and social status, studied for its effects on motivation and social signaling.",
    "R": "Rode - Known in psychology for its key role in strengthening social bonds, motivating behavior, and improving mental and physical health.",
    "S": "Surprise - Known in psychology for its universal, brief facial expression and its role in rapidly redirecting attention to unexpected events.",
    "T": "Trust - Widely studied in psychology and economics because it underpins cooperation, social bonding, and decision-making in uncertain situations.",
    "U": "Unease - Recognized in psychology for signaling discomfort in ambiguous or risky situations and prompting vigilance or avoidance.",
    "V": "Vulnerability - Renowned in psychology and popular discourse for being essential to authentic connection, empathy, and emotional resilience, especially popularized by Brené Brown's research.",
    "Y": "Yearning - A deep, persistent longing that is widely studied in psychology and depicted in literature for its role in motivation, attachment, and creative expression.",
    "Z": "Zeal - A passionate, energetic enthusiasm, well-known for motivating sustained effort and driving people to pursue causes or goals."
  },
  "Fairy Tale Character": {
    "A": "Aladdin - Famous for discovering a magical lamp whose genie grants wishes, enabling him to rise from poverty and win a princess's love.",
    "B": "Belle - The kind, bookish heroine of \"Beauty and the Beast,\" known for seeing beyond appearances and breaking the Beast's curse.",
    "C": "Cinderella - A mistreated young woman whose magical transformation and glass slipper leading to her royal marriage make her an enduring symbol of kindness rewarded and rags-to-riches fairy-tale romance.",
    "D": "Dorothy - The young heroine of The Wizard of Oz, famous for her journey to the Land of Oz and her determination to return home.",
    "E": "Emperor - The vain ruler in Hans Christian Andersen's fairy tale \"The Emperor's New Clothes,\" famous for being tricked into parading naked and exposing human vanity and gullibility.",
    "F": "Fiona - The princess from the Shrek films who becomes an ogre and is famous for subverting traditional fairy-tale tropes.",
    "G": "Goldilocks - Known for entering the Three Bears' home and testing their porridge, chairs, and beds, illustrating curiosity and consequences.",
    "H": "Hansel - A boy from the fairy tale \"Hansel and Gretel\", known for leaving a trail of stones or small objects to find his way back.",
    "I": "Ivan - A central hero in many Russian fairy tales, known for his bravery, simple cleverness, and for overcoming magical challenges to win princesses and kingdoms.",
    "J": "Jack - A clever young hero from \"Jack and the Beanstalk,\" famous for climbing a giant beanstalk and outwitting the giant to steal his treasures.",
    "K": "Koschei - A fearsome immortal villain of Slavic fairy tales, famed for hiding his soul (often in a needle inside an egg) to avoid death and for abducting princesses.",
    "L": "Leprechaun - A small Irish fairy from folk tales, known for his golden pot and cunning tricks.",
    "M": "Maleficent - A powerful fairy and antagonist in Sleeping Beauty, best known for cursing Princess Aurora.",
    "N": "Nils - The main character of Selma Lagerlöf's book \"The Wonderful Journey of Nils Holgersson\", known for his adventures on the backs of wild geese and the transformation that teaches about nature and responsibility.",
    "O": "Ogre - A classic fairy-tale monster known for its brutish strength and appetite, often appearing as the villain in stories like \"Puss in Boots\" and \"Jack and the Beanstalk.\"",
    "P": "Pinocchio - He is famous as a wooden puppet whose nose grows when he lies, symbolizing the moral lesson about honesty.",
    "R": "Rumpelstiltskin - A famous fairy-tale troll who transforms straw into gold in exchange for a secret promise or child.",
    "S": "Sinbad - A legendary sailor known for his seven adventurous voyages encountering monsters and magical wonders in the Arabian Nights.",
    "T": "Thumbelina - A tiny girl born from a flower, famed for her delicate size and adventurous quest for love and belonging in Hans Christian Andersen's fairy tale.",
    "U": "Ursula - A memorable sea‑witch villain from Disney's The Little Mermaid, famous for making bargains and using powerful magic to steal Ariel's voice.",
    "V": "Vasilisa - A famous heroine of Russian fairy tales, celebrated for her beauty, cleverness, and brave encounters with the witch Baba Yaga.",
    "Y": "Yuki-onna - A legendary Snow Woman from Japanese folktales, famous for her ethereal beauty and for freezing or luring travelers to their doom.",
    "Z": "Zmey Gorynych - A three-headed dragon from Slavic folklore, famous for breathing fire and serving as a fearsome antagonist in many fairy tales."
  },
  "Female Name": {
    "A": "Ada - Considered the first computer programmer for writing an algorithm intended for Charles Babbage's Analytical Engine in the 19th century.",
    "B": "Beyoncé - An internationally acclaimed singer, songwriter and performer known for her powerful vocals, dynamic stage presence, and influential contributions to pop and R&B.",
    "C": "Cleopatra - Renowned ancient Egyptian queen remembered for her political skill, alliances with Julius Caesar and Mark Antony, and enduring cultural influence.",
    "D": "Diana - The Princess of Wales, globally known for her humanitarian work and her high-profile role in the British royal family.",
    "E": "Eleanor - A prominent First Lady of the United States and pioneering human rights advocate who helped draft the Universal Declaration of Human Rights.",
    "F": "Frida - Frida Kahlo was a Mexican painter renowned for her vivid self-portraits and exploration of identity, pain, and Mexican culture.",
    "G": "Greta - Swedish environmental activist who rose to prominence for organizing global youth climate strikes and demanding urgent action on climate change.",
    "H": "Hillary - Known as the former American Secretary of State and presidential candidate.",
    "I": "Indira - Indira Gandhi byla indická premiérka známá svým silným vlivem na politiku Indie a vyhlášením výjimečného stavu.",
    "J": "Jane - Britská primatoložka proslulá dlouhodobým studiem divokých šimpanzů a aktivitou v ochraně přírody.",
    "K": "Katherine - Katherine Johnson was an American mathematician whose orbital calculations were critical to NASA's early human spaceflights.",
    "L": "Lupita - Lupita Nyong'o is an Oscar-winning actress known for her breakthrough performance in 12 Years a Slave and acclaimed roles on film and stage.",
    "M": "Madonna - International pop icon known for reinventing her music and image and profoundly influencing popular culture.",
    "N": "Nefertiti - Ancient Egyptian queen celebrated for her iconic bust and influential role alongside Pharaoh Akhenaten in the Amarna religious and artistic revolution.",
    "O": "Oprah - She is famous as the long-running host of The Oprah Winfrey Show and for building a powerful media and philanthropic empire.",
    "P": "Penelope - Spanish actress Penélope Cruz is known for her Academy Award-winning performances and frequent collaborations with director Pedro Almodóvar.",
    "R": "Rihanna - Barbadská zpěvačka a podnikatelka, proslulá svými mezinárodními hudebními hity a úspěšnou kosmetickou značkou Fenty.",
    "S": "Shakira - A Colombian singer-songwriter and performer renowned worldwide for her distinctive voice, energetic dancing and chart-topping pop hits.",
    "T": "Taylor Swift - American singer-songwriter known for her narrative songwriting, genre-spanning hits, and record-breaking commercial success.",
    "U": "Ursula - Ursula K. Le Guin was a celebrated author of science fiction and fantasy, renowned for her imaginative world-building and deep explorations of society, gender, and anthropology.",
    "V": "Venus - Venus Williams is an American tennis champion known for winning multiple Grand Slam titles and transforming the power and visibility of women's tennis.",
    "Y": "Yoko - Avant-garde artist and peace activist widely known for her experimental art and music and her association with John Lennon.",
    "Z": "Zendaya - Acclaimed actress and producer known for her Emmy-winning lead performance in HBO’s Euphoria and prominent roles in the Spider-Man films."
  },
  "Food": {
    "A": "Avocado - A creamy, nutrient-dense fruit renowned for its healthy monounsaturated fats and starring role in dishes like guacamole and avocado toast.",
    "B": "Bagel - A dense, chewy ring-shaped bread boiled then baked, celebrated for its versatility and iconic role in Jewish and New York breakfast culture.",
    "C": "Croissant - An iconic French pastry known for its flaky, buttery layers and central place in French bakery tradition.",
    "D": "Dumpling - A globally beloved dish known for its versatile fillings and cooking methods that reflect many regional cuisines.",
    "E": "Eclair - A classic French pastry known for its light choux dough filled with pastry cream and topped with chocolate glaze, celebrated worldwide for its delicate texture and rich flavor.",
    "F": "Falafel - Deep-fried spiced chickpea patties widely known across the Middle East as a flavorful, portable and popular vegetarian street food.",
    "G": "Guacamole - A creamy avocado-based dip from Mexico, famous worldwide for its fresh flavor and popularity as a party staple.",
    "H": "Hamburger - An iconic sandwich with grilled, ground beef in a bun, known as a symbol of quick food and globalized cuisine.",
    "I": "Injera - A spongy, sour Ethiopian flatbread that serves as both staple food and edible utensil, celebrated for its distinctive tangy flavor and texture.",
    "J": "Jambalaya - A Creole rice dish from Louisiana famous for its bold, spicy flavors and hearty blend of meats, seafood, vegetables, and seasonings.",
    "K": "Kimchi - A traditional Korean fermented vegetable dish celebrated worldwide for its bold, spicy-sour flavor and healthful probiotics.",
    "L": "Lasagna - A classic Italian baked pasta dish famous for its layered sheets of pasta with meat, cheese, and rich tomato or béchamel sauce.",
    "M": "Mango - A tropical fruit prized for its sweet, aromatic flesh and versatile use in desserts, drinks, and savory dishes worldwide.",
    "N": "Nachos - A popular Tex-Mex snack of tortilla chips topped with melted cheese and various toppings, known for being shareable and highly customizable.",
    "O": "Oreo - A globally popular sandwich cookie known for its chocolate wafers and sweet cream filling, often dunked in milk.",
    "P": "Pizza - Renowned worldwide for its Italian origins, versatile toppings, and widespread popularity as a comforting, shareable meal.",
    "R": "Ramen - A well-known Japanese noodle dish celebrated for its rich, simmered broths, diverse regional styles, and global popularity.",
    "S": "Sushi - A renowned Japanese dish known for its artful presentation of vinegared rice paired with fresh seafood, highlighting delicate flavors and precise craftsmanship.",
    "T": "Tiramisu - A famous Italian dessert known for its layers of coffee-soaked ladyfingers and mascarpone cream that popularized coffee-flavored sweets worldwide.",
    "U": "Ube - A purple yam widely used in Filipino desserts, prized for its vibrant color and sweet, nutty flavor.",
    "V": "Vindaloo - A spicy Goan curry originally from Portuguese marinade with wine and garlic, known for its intense spiciness and aromatic flavor.",
    "Y": "Yogurt - A fermented dairy product known for its probiotic benefits and wide culinary versatility.",
    "Z": "Zucchini - A versatile summer squash prized for its mild flavor and wide use in savory and baked dishes."
  },
  "Fruit": {
    "A": "Avocado - Known for its high content of healthy fats and widespread use in cooking and popularity in modern nutrition.",
    "B": "Banana - Bananas are one of the world’s most popular fruits because they are sweet, portable, nutrient-rich (notably in potassium), and a major global export crop.",
    "C": "Coconut - Renowned globally for its versatility: its water, milk, oil, and flesh are widely used in cooking, beverages, cosmetics, and health products.",
    "D": "Durian - Known for its strong, pungent smell and creamy flavor, which makes it both very popular and controversial.",
    "E": "Elderberry - Widely known for its dark, nutrient-rich berries used in syrups and supplements to help relieve cold and flu symptoms.",
    "F": "Fig - Sweet fruit known from ancient times for its widespread culinary use and cultural significance in the Mediterranean.",
    "G": "Grapefruit - Known for its strong, tangy flavor and high vitamin C content, often used in diets and refreshing drinks.",
    "H": "Honeydew - Known for its fresh, juicy flesh and frequent use in summer salads and drinks.",
    "I": "Ilama - A tropical fruit from Central America, known for its sweet, creamy flesh resembling a combination of cherimoya and graviola.",
    "J": "Jackfruit - A very large tropical fruit famous for its sweet, bulbous flesh and for being used as a versatile plant-based meat substitute when unripe.",
    "K": "Kiwi - A small brown fruit with bright green flesh, known for its tangy-sweet flavor and very high vitamin C content.",
    "L": "Limeta - A popular citrus known for its fresh, sour juice and widespread use in drinks and cooking.",
    "M": "Mango - Often called the \"king of fruits\" for its sweet, juicy flavor and widespread culinary and cultural popularity.",
    "N": "Nectarine - Nectarines are well-known for their smooth, fuzz-free skin and sweet, juicy flesh, making them a popular summer stone fruit.",
    "O": "Orange - A popular citrus fruit known for its sweet-sour flavor and high vitamin C content.",
    "P": "Pineapple - A tropical fruit well-known for its sweet-tart flavor, spiky exterior, and widespread culinary and cultural use worldwide.",
    "R": "Raspberry - A popular fruit known worldwide for its sweet-tart flavor and versatility in desserts, jams, and as a source of vitamins and antioxidants.",
    "S": "Strawberry - Renowned for its sweet flavor and versatility in desserts, preserves, and fresh eating, making it one of the world's most popular fruits.",
    "T": "Tangerine - A sweet, easy-to-peel citrus fruit known for its bright, tangy flavor and popularity as a convenient snack and ingredient in desserts.",
    "U": "Ugli - A Jamaican tangelo known for its rough, wrinkled rind and sweet-tart flavor, making it distinctive among citrus fruits.",
    "V": "Vanilla - The seed pods of the vanilla orchid, famous worldwide for their aromatic flavor used in cooking, baking, and perfumes.",
    "Y": "Yuzu - A fragrant Japanese citrus prized for its aromatic zest and distinctive tart flavor, widely used in cooking, sauces, and beverages.",
    "Z": "Zucchini - A widely known summer squash celebrated for its culinary versatility and prolific yields, commonly used in savory dishes, baking, and as a low‑carb substitute."
  },
  "Furniture": {
    "A": "Armchair - A well-known upholstered chair known for comfort and iconic design, often the center of the living room.",
    "B": "Beanbag - A comfortable, inflatable chair known for its simplicity, versatility, and widespread use for relaxation.",
    "C": "Chesterfield - An iconic sofa with deep buttoning and cylindrical arms, known for its timeless British design.",
    "D": "Daybed - Known for its combination of a sofa and bed, popular as a place for relaxation and as a bedspread.",
    "E": "Eames - The Eames Lounge Chair is famous for its innovative molded plywood construction and iconic mid-century modern comfort and style.",
    "F": "Futon - A versatile Japanese-style mattress that folds into a sofa and is celebrated for its space-saving, multipurpose design.",
    "G": "Gondola - A distinctive curved, boat-shaped sofa known for its elegant rounded back and historic popularity in Victorian and Art Deco interiors.",
    "H": "Hammock - A suspended bed-like furniture piece famous for its gentle swaying comfort and versatility for relaxation both indoors and outdoors.",
    "I": "IKEA - Known for affordable, well-designed flat-pack furniture and a global retail presence.",
    "J": "Jeanneret - An iconic mid-century wooden chair designed by Pierre Jeanneret for Chandigarh, celebrated for its minimalist form, robust craftsmanship, and lasting influence on modern furniture design.",
    "K": "Kokon - An iconic chair designed by Eero Saarinen, known for its sleek, ergonomic form and iconic status in modernist furniture design.",
    "L": "LC4 - The LC4 Chaise Longue by Le Corbusier, Charlotte Perriand and Pierre Jeanneret is famous for its sleek, ergonomic form and iconic status in modernist furniture design.",
    "M": "Morris - The Morris chair is celebrated as an early adjustable reclining armchair and a defining piece of the Arts and Crafts movement for its craftsmanship and functional, simple design.",
    "N": "Noguchi table - The iconic sculptural coffee table designed by Isamu Noguchi in 1944, celebrated for its organic wooden base and glass top that seamlessly blend art and function.",
    "O": "Ottoman - A low upholstered seat or footstool widely known for its versatility as extra seating, hidden storage, and a decorative staple in interior design.",
    "P": "Poäng - An iconic IKEA armchair known for its bentwood frame and comfortable, affordable design that has remained popular worldwide for decades.",
    "R": "Recliner - A popular chair known for its adjustable backrest and extendable footrest that provides superior comfort and support for relaxation.",
    "S": "Sofa - A comfortable seating furniture known for its design and role as the main place for relaxation and gathering in living rooms.",
    "T": "Togo - An iconic 1973 low-profile sofa by Michel Ducaroy for Ligne Roset, famed for its ergonomic comfort and distinctive pleated foam design.",
    "U": "Ultrafragola - A sculptural mirror designed by Ettore Sottsass in 1970, celebrated as an iconic piece of Memphis design for its playful, curving frame and bold, pop-art aesthetic.",
    "V": "Vanity - A vanity is a dressing table with an integrated mirror and storage, well-known for providing a dedicated space for personal grooming and organization in bedrooms and bathrooms.",
    "Y": "YChair - The Y Chair by Hans Wegner is renowned for its distinctive Y-shaped backrest and elegant mid-century modern design that showcases exceptional craftsmanship and comfort.",
    "Z": "Zigzag - Gerrit Rietveld’s Zigzag chair is renowned for its bold single-piece, cantilevered geometry and its iconic role in De Stijl modernist design."
  },
  "Group": {
    "A": "ABBA - They are renowned for polished pop songwriting, rich harmonies, and global hits like \"Dancing Queen\" that made them icons of 1970s pop.",
    "B": "Beatles - Pioneering British rock band known for their innovative songwriting, stylistic experimentation, and enormous cultural and musical influence worldwide.",
    "C": "Coldplay - Britská rocková skupina proslulá chytlavými melodiemi, emotivními texty a obrovskými stadionovými turné.",
    "D": "Disturbed - American heavy metal band known for their aggressive sound, distinctive vocals, and mainstream success with hits like \"Down with the Sickness\".",
    "E": "Eagles - Americká rocková skupina proslulá jemnými harmonickými vokály a ikonickým hitem „Hotel California“.",
    "F": "Fugazi - Influential post-hardcore band known for their DIY ethic, intense live shows, and politically engaged lyrics.",
    "G": "Greenpeace - Known for high-profile direct-action protests, investigative campaigns and global advocacy to protect the environment and promote conservation.",
    "H": "Huawei - A leading Chinese telecommunications company known for its 5G network equipment and global smartphone market presence, often at the center of security and trade disputes.",
    "I": "Interpol - They are well-known as an influential post-punk revival band from New York City, recognized for their atmospheric, guitar-driven sound and melancholic, melodic songwriting.",
    "J": "Journey - Known for their melodic arena-rock sound, powerful vocals, and the enduring hit \"Don't Stop Believin'.\"",
    "K": "Kraftwerk - Pioneering German electronic band known for their minimalist, synthesizer-driven sound that greatly influenced synth-pop, techno, and modern electronic music.",
    "L": "Lakers - Known for their rich history in the NBA and many championship titles due to their star players and long-term dominance in professional basketball.",
    "M": "Metallica - One of the most influential heavy metal bands, known for pioneering thrash metal with aggressive riffs, fast tempos, and huge global commercial success.",
    "N": "Nirvana - Known for pioneering the grunge movement and bringing alternative rock to mainstream audiences with their raw sound and Kurt Cobain's songwriting.",
    "O": "Oasis - English rock band known for their anthemic Britpop songs, chart-topping albums, and the Gallagher brothers' public rivalry.",
    "P": "Pixar - A pioneering computer-animation studio known for groundbreaking CGI feature films, technical innovations, and emotionally rich storytelling.",
    "R": "Radiohead - Known for their innovative and experimental approach to alternative rock and notable albums like OK Computer.",
    "S": "Scorpions - Renowned for their melodic hard rock and iconic power ballads like \"Wind of Change\" that achieved worldwide success.",
    "T": "Tool - Renowned for their complex polyrhythms, dense progressive-metal compositions, and immersive visual aesthetic that reshaped modern metal.",
    "U": "U2 - The Irish rock band U2 is known for their anthemic sound, Bono's distinctive vocals, politically charged lyrics, and massive stadium tours.",
    "V": "Vengaboys - Known for their catchy late-1990s Eurodance hits like \"Boom, Boom, Boom, Boom!!\" and upbeat party anthems.",
    "Y": "Yes - They are a pioneering progressive rock band known for complex compositions, virtuosic musicianship, and landmark albums like Fragile and Close to the Edge.",
    "Z": "Zapatistas - Known for their 1994 uprising in Chiapas and ongoing grassroots struggle for indigenous autonomy and opposition to neoliberal policies."
  },
  "Historical Event": {
    "A": "Assassination - The 1914 killing of Archduke Franz Ferdinand in Sarajevo set off the diplomatic crises and mobilizations that triggered World War I.",
    "B": "Bastille - A symbolic beginning of the French Revolution, because the capture of the Bastille on July 14, 1789 showed the strength of the people's uprising against the monarchy.",
    "C": "Chernobyl - A nuclear disaster in 1986, known for its massive radioactive leak, long-term health and environmental impacts, and influence on nuclear safety and policy.",
    "D": "D-Day - The Allied invasion of Normandy on 6 June 1944 is famous for initiating the liberation of Western Europe from Nazi occupation and demonstrating unprecedented large-scale amphibious and airborne coordination.",
    "E": "Exodus - The biblical account of the Israelites' departure from slavery in Egypt, central to Jewish identity and hugely influential in religious, legal, and cultural history.",
    "F": "Fukushima - A nuclear disaster in 2011, when the earthquake and tsunami damaged reactors, revealing unexpected risks in nuclear power plant operation and changing approaches to safety.",
    "G": "Guernica - The 1937 aerial bombing of the Basque town during the Spanish Civil War became emblematic of civilian suffering in modern warfare and inspired Picasso’s famous painting.",
    "H": "Holocaust - The state-sponsored, systematic genocide carried out by Nazi Germany during World War II that resulted in the murder of six million Jews and millions of other victims, and is the central reference point for studies of modern genocide.",
    "I": "Intifada - The Palestinian uprisings, most notably the First Intifada (1987–1993), are well-known for widespread grassroots resistance that reshaped the Israeli–Palestinian conflict and international attention.",
    "J": "Jamestown - The first permanent English settlement in North America (1607), well-known for its early survival struggles, pivotal interactions with Indigenous peoples, and the emergence of the tobacco-based economy and labor systems that shaped colonial America.",
    "K": "Kristallnacht - The 1938 Nazi-organized pogrom against Jewish homes, businesses, and synagogues in Germany and Austria, widely seen as a major escalation toward the Holocaust.",
    "L": "Lusitania - The 1915 sinking of the RMS Lusitania by a German U-boat, killing many civilians, helped turn international opinion against Germany and influenced the U.S. path toward entering World War I.",
    "M": "Marathon - The Battle of Marathon (490 BCE) is famous for the unexpected Athenian victory over a Persian invasion, a turning point in the Greco-Persian Wars and the origin of the modern marathon race.",
    "N": "Nuremberg - The Nuremberg Trials prosecuted major Nazi leaders after World War II, establishing important precedents in international law for crimes against humanity and war crimes.",
    "O": "Overlord - The Allied invasion of Normandy in June 1944, codenamed Operation Overlord, is famous as the largest amphibious assault in history and for opening the decisive Western front against Nazi Germany.",
    "P": "Prohibition - The U.S. constitutional ban on the manufacture, sale, and transport of alcoholic beverages from 1920 to 1933, famous for fueling organized crime, speakeasies, and its eventual repeal.",
    "R": "Reformation - A 16th-century religious movement, led by figures like Martin Luther, that challenged Catholic Church practices and doctrines, leading to the rise of Protestantism and major social and political changes in Europe.",
    "S": "Stalingrad - A pivotal World War II battle in which Soviet forces encircled and destroyed the German 6th Army, marking a major turning point on the Eastern Front.",
    "T": "Tet - The 1968 Tet Offensive was a coordinated series of surprise attacks by North Vietnamese and Viet Cong forces across South Vietnam that dramatically shifted U.S. public opinion and marked a turning point in the Vietnam War.",
    "U": "Uprising - A localized mass rebellion against authority, known for how grassroots resistance can escalate into major political or social change (e.g., the Warsaw Uprising).",
    "V": "Vesuvius - The AD 79 eruption of Mount Vesuvius buried Pompeii and Herculaneum, preserving buildings, artifacts, and human remains that provide unparalleled insight into Roman daily life.",
    "Y": "Yalta - The 1945 conference where Roosevelt, Churchill, and Stalin negotiated post‑World War II arrangements that shaped Europe’s postwar order and helped set the stage for the Cold War.",
    "Z": "ZimmermannTelegram - A secret 1917 German diplomatic proposal to Mexico promising U.S. territories in return for alliance, whose interception and publication helped bring the United States into World War I."
  },
  "Hobby": {
    "A": "Astronomy - Amateur and professional astronomers are known for observing celestial bodies and discovering comets, asteroids, or exoplanets, contributing to our understanding of the universe.",
    "B": "Birding - Enthusiasts are well-known for their sharp observation and species-identification skills and for contributing to conservation through citizen-science monitoring.",
    "C": "Cycling - Known for its popularity in races (such as the Tour de France), speed, endurance, and widespread use as a sport and transportation.",
    "D": "Dancing - Well-known for expressive movement and cultural performance, combining artistic expression, social interaction, and physical fitness.",
    "E": "Embroidery - Known for its intricate needlework techniques that create decorative textiles and heirloom pieces.",
    "F": "Photography - Known for capturing moments and shaping visual storytelling through composition and light.",
    "G": "Gardening - Known for cultivating plants to create attractive, productive outdoor spaces that promote relaxation and local biodiversity.",
    "H": "Hiking - Popular for its accessible combination of physical exercise and nature exploration, drawing people of all ages to trails and parks.",
    "I": "Illustration - Known for its recognizable style and ability to tell stories through visual media.",
    "J": "Yoga - Known for its ability to improve flexibility, strength, and mental well-being through poses, breathing exercises, and meditation.",
    "K": "Keramika - Praktici a umělci v keramice jsou známí výrobou funkčních i dekorativních předmětů z hlíny pomocí tvarování, glazování a vypalování.",
    "L": "LARP - Known for its live character playing and interactive stories that combine theater, costumes, and improvisation.",
    "M": "Mountaineering - Climbers are well-known for tackling high and technically difficult peaks, showcasing endurance, navigational skill, and careful risk management.",
    "N": "Numismatics - Enthusiasts are well-known for their meticulous identification, grading, and preservation of coins and currency, which reveal historical and economic insights.",
    "O": "Origami - Practitioners are renowned for transforming a single sheet of paper into intricate, precise sculptures using complex folding techniques.",
    "P": "Photography - Well-known for capturing moments and shaping visual storytelling through composition and light.",
    "R": "Running - Well-known for being an accessible, low-equipment activity that builds cardiovascular endurance and is practiced worldwide.",
    "S": "Singing - Renowned for its power to convey emotion and connect with audiences, making singers central figures in music and culture.",
    "T": "Tennis - Known worldwide for its fast-paced play, prestigious tournaments like Wimbledon, and a long line of iconic professional players.",
    "U": "Ukulele - Known for its bright, mellow sound and simple chord shapes, making it a popular, easy-to-learn musical hobby.",
    "V": "Veterinary - Known for its ability to improve flexibility, strength, and mental well-being through poses, breathing exercises, and meditation.",
    "Y": "Yachting - Known for combining competitive racing and leisurely cruising, showcasing seamanship, navigation skills, and a love of the sea.",
    "Z": "Zumba - A dance-based fitness hobby famous for its energetic Latin-inspired choreography and accessible cardio workouts that make exercise fun and approachable."
  },
  "Insect": {
    "A": "Ant - Ants are famous for their highly organized social colonies, division of labor, and ability to carry many times their own body weight.",
    "B": "Bee - Bees are famous for pollinating crops and producing honey, making them essential to ecosystems and agriculture.",
    "C": "Cicada - Famous for their extremely loud mating calls and remarkable mass emergences at long, regular intervals.",
    "D": "Dragonfly - Known for its exceptional flight agility and ability to effectively catch other insects.",
    "E": "Earwig - Known for their distinctive forceps-like pincers used in defense and mating, and for persistent folklore claiming they crawl into human ears.",
    "F": "Firefly - They are well-known for their bioluminescent flashes used to attract mates and communicate.",
    "G": "Grasshopper - Renowned for their powerful hind legs that enable long jumps and for their role as major agricultural pests.",
    "H": "Honeybee - Renowned for pollinating crops and producing honey, making them essential to agriculture and ecosystems.",
    "I": "Icerya - A genus containing the cottony cushion scale (Icerya purchasi), famous as a devastating citrus pest that was successfully controlled by introduction of the vedalia beetle in one of the first classical biological control efforts.",
    "J": "Junebug - A common name for large scarab beetles noted for their nocturnal flights and attraction to lights, making them familiar to many.",
    "K": "Katydid - A green, leaf-like insect famous for its loud nocturnal mating calls that sound like \"katy-did\" and its excellent camouflage.",
    "L": "Locust - Well-known for forming massive migratory swarms that devastate crops and can trigger famines.",
    "M": "Monarch - A butterfly famous for its long-distance annual migration across North America and its distinctive orange-and-black warning coloration.",
    "N": "Nasonia - A genus of parasitoid wasps widely used as model organisms in evolutionary genetics and developmental biology because of their short generation time, ease of laboratory rearing, and sequenced genomes.",
    "O": "Odonata - Dragonflies and damselflies are famous for their agile flight, voracious predatory behavior, and use as indicators of freshwater ecosystem health.",
    "P": "Papilio - A genus of swallowtail butterflies known for their large, colorful wings and importance in studies of mimicry and evolution.",
    "R": "Roach - A resilient insect famous for its hardiness, ability to survive extreme conditions, and its status as a common household pest.",
    "S": "Silkworm - They are famous for producing silk that has been cultivated and woven into textiles for millennia.",
    "T": "Termite - Termites are famous for their complex social colonies and wood-eating behavior that both recycle dead plant material and cause widespread structural damage.",
    "U": "Ulysses - The Ulysses butterfly is famous for its vivid iridescent blue wings and iconic status in Australian and Pacific lepidopteran fauna.",
    "V": "Viceroy - A butterfly known for its mimetic appearance mimicking a monarch, helping it deter predators.",
    "Y": "Yellowjacket - A social wasp famous for its aggressive defense of nests and painful sting, commonly seen scavenging at outdoor gatherings.",
    "Z": "Zyzzyva - A genus of South American weevils famously noted for being one of the last words in many English dictionaries."
  },
  "Literary Genre": {
    "A": "Allegory - Uses symbolic characters and events to convey deeper moral, political, or philosophical meanings.",
    "B": "Bildungsroman - A novel about growing up, known for its psychological and moral development of the main character from childhood to adulthood.",
    "C": "Crime - Known for its focus on plotting, suspense, and the intellectual puzzle of solving wrongdoing, which captivates and challenges readers.",
    "D": "Dystopian - Known for imagining oppressive societies that critique contemporary politics and social trends.",
    "E": "Epic - A long narrative, often poetic, known for its grand scope, heroic protagonists, and its role in shaping cultural myths and national identity.",
    "F": "Fantasy - Known for its rich imaginary worlds filled with magic, myths, and epic conflicts that captivate readers by escaping reality.",
    "G": "Gothic - Famous for brooding, atmospheric stories that mix the supernatural, horror, and romance to probe human fears and social anxieties.",
    "H": "Horror - Renowned for its ability to evoke fear and suspense, often using supernatural or psychological elements to probe human anxieties and taboos.",
    "I": "Idyll - A literary genre depicting an idealized, peaceful rural life, known for its idealization of nature and simple way of life.",
    "J": "Juvenile - Known for its appealing stories and heroes that appeal to teenage readers.",
    "K": "Künstlerroman - A novel centered on an artist's development, renowned for its in-depth exploration of creativity, artistic growth, and the protagonist's inner struggles.",
    "L": "Lyric - Renowned for its concentrated, musical expression of personal emotions and thoughts in poetry.",
    "M": "Mystery - Known for its puzzling plots, suspenseful atmosphere, and emphasis on clues and deduction that keep readers guessing until the resolution.",
    "N": "Novel - Celebrated for its extended length and capacity to develop complex characters, themes, and plots across sustained narratives.",
    "O": "Ode - Celebrated for its elevated, lyrical tone and direct address to a person, idea, or object, often expressing deep emotion or praise.",
    "P": "Poetry - Renowned for its condensed, rhythmic language and vivid imagery that distills emotions and ideas into memorable, musical expression.",
    "R": "Realism - Known for its faithful and detailed depiction of everyday life and social problems, with an emphasis on objectivity.",
    "S": "Satire - Known for its use of humor, irony, and exaggeration to criticize social shortcomings and human weaknesses.",
    "T": "Tragedy - Known for depicting the downfall of a noble or sympathetic protagonist caused by a fatal flaw or fate, provoking pity and catharsis.",
    "U": "Utopian - Known for depicting idealized societies to critique existing social and political structures and imagine alternatives.",
    "V": "Vampire - Renowned for exploring themes of immortality, desire, and social anxieties through seductive supernatural beings that have dominated horror and fantasy literature.",
    "Y": "YA - Known for its focus on adolescent protagonists and themes, driving bestseller sales and widespread cultural adaptations.",
    "Z": "Zuihitsu - Japonský literární žánr složený z volných esejí a reflexí, známý svou fragmentární formou a osobním, asociativním stylem."
  },
  "Male Name": {
    "A": "Alexander - A Macedonian king and military commander famous for conquering a vast empire and spreading Hellenistic culture.",
    "B": "Barack - The 44th President of the United States, widely known for the Affordable Care Act and his leadership in domestic and international policy.",
    "C": "Cristiano - Portuguese footballer Cristiano Ronaldo is famous for his prolific goal-scoring, exceptional athleticism, and multiple Ballon d'Or awards.",
    "D": "Dante - Italian poet best known for writing The Divine Comedy, a cornerstone of world literature.",
    "E": "Elon - The founder and CEO of companies like SpaceX and Tesla, known for innovations in space travel and electric vehicles.",
    "F": "Frank - He was an American singer and actor known for his smooth voice, charismatic phrasing, and enduring influence on 20th-century popular music.",
    "G": "Galileo - Italian astronomer and physicist famous for his telescopic discoveries and forceful advocacy of heliocentrism.",
    "H": "Homer - Ancient Greek poet traditionally credited with composing the Iliad and the Odyssey, foundational epics that shaped Western literature.",
    "I": "Isaac - Renowned for formulating the laws of motion and universal gravitation, laying the foundations of classical physics.",
    "J": "John - John Lennon was a founding member of The Beatles and became famous worldwide for his songwriting, singing, and peace activism.",
    "K": "Kobe - A famous American basketball player, known for his shooting skills and five NBA championships.",
    "L": "Leonardo - An Italian Renaissance artist and inventor, known primarily for the Mona Lisa and his extensive scientific drawings.",
    "M": "Mozart - Renowned Austrian composer celebrated for his prolific and influential works in classical music.",
    "N": "Neil - An American astronaut who became the first person to walk on the Moon during Apollo 11 in 1969.",
    "O": "Obama - Barack Obama is known for serving as the 44th President of the United States and for major initiatives like the Affordable Care Act.",
    "P": "Plato - Ancient Greek philosopher whose dialogues and ideas about forms, knowledge, and politics shaped Western thought.",
    "R": "Rafael - Spanish tennis legend known for his record-breaking Grand Slam tally and extraordinary dominance on clay courts.",
    "S": "Socrates - Ancient Greek philosopher credited as a founder of Western philosophy, famous for the Socratic method of questioning.",
    "T": "Tesla - Nikola Tesla was a pioneering inventor and electrical engineer best known for developing alternating current (AC) power systems and numerous innovations in electromagnetism.",
    "U": "Usain - A Jamaican sprinter known as the fastest man on earth, holder of world records and multiple Olympic champion.",
    "V": "Vincent - Vincent van Gogh was a Dutch post-Impressionist painter famed for his expressive brushwork, vivid colors, and iconic works like The Starry Night.",
    "Y": "Yuri - Yuri Gagarin became the first human to travel into space in 1961, marking a milestone in space exploration.",
    "Z": "Zlatan - Swedish footballer renowned for his prolific goal-scoring, acrobatic strikes, and dominant presence at top European clubs."
  },
  "Mammal": {
    "A": "Aardvark - A nocturnal African mammal famous for its long snout and sticky tongue used to feed primarily on ants and termites.",
    "B": "Bat - Bats are famous for their use of echolocation to navigate and hunt at night, and for being the only mammals capable of sustained flight.",
    "C": "Chimpanzee - Known for their close genetic relationship to humans and for using tools and exhibiting complex social behavior.",
    "D": "Dolphin - Famous for high intelligence, complex social structures, and sophisticated echolocation, making them key subjects in studies of animal cognition and communication.",
    "E": "Elephant - One of the largest land mammals, famous for their intelligence, strong social bonds, and distinctive trunks used for sensing, manipulating objects, and communication.",
    "F": "Fox - A widely known mammal celebrated for its adaptability, resourcefulness, and frequent depiction in folklore and media.",
    "G": "Gorila - Known for its strength, high intelligence, and complex social behavior.",
    "H": "Horse - Famous for their strength and speed, horses have been domesticated for riding, transport, and sport for thousands of years.",
    "I": "Impala - A well-known African antelope celebrated for its speed and agility, often seen in large herds and serving as a key prey species on the savanna.",
    "J": "Jaguar - A large, solitary big cat native to the Americas, famed for its powerful bite, distinctive rosetted coat, and role as an apex predator.",
    "K": "Kangaroo - A marsupial native to Australia, famous for its powerful hind legs and distinctive hopping locomotion.",
    "L": "Lion - A well-known big cat famous for living in social prides and symbolizing strength and leadership.",
    "M": "Moose - The largest species of deer, well-known for its massive antlers and iconic presence in North American and Eurasian forests.",
    "N": "Narval - Known for its long spiral-shaped tooth (tusk) resembling a unicorn's horn.",
    "O": "Orangutan - A highly intelligent great ape known for tool use, problem-solving abilities and an arboreal lifestyle.",
    "P": "Panda - A giant bear famous for its distinctive black-and-white fur and specialized bamboo diet, making it a global symbol of conservation.",
    "R": "Raccoon - Known for their dexterous front paws and remarkable adaptability to urban environments.",
    "S": "Sloth - Famous for its extremely slow movement and low metabolic rate, making it an iconic example of energy-conserving adaptations among mammals.",
    "T": "Tiger - A large carnivorous feline renowned for its striking striped coat, powerful hunting abilities as an apex predator, and its endangered conservation status.",
    "U": "Uakari - A South American primate known for its vibrant red face used for signaling health.",
    "V": "Vaquita - A critically endangered porpoise known for having the smallest wild population of any cetacean due to bycatch in illegal gillnets.",
    "Y": "Yak - A large high-altitude mammal known as a domesticated transport animal and source of milk, meat, and wool in the Himalayas.",
    "Z": "Zebra - Famous for their distinctive black-and-white striped coats, which help with camouflage, social recognition, and deterring biting flies."
  },
  "Material": {
    "A": "Aluminium - A lightweight metal known for its low weight, good corrosion resistance, and widespread use in industry and transportation.",
    "B": "Bakelit - The first commercially successful synthetic plastic, known for its thermal resistance and electrical insulation.",
    "C": "Cement - A fundamental building material known for its strength and ability to bind aggregates into durable concrete when it hardens.",
    "D": "Diamond - Known as the hardest natural material, prized for its brilliance as a gemstone and widely used in cutting and industrial applications.",
    "E": "Epoxy - A versatile thermosetting polymer widely used as an adhesive and composite matrix material because of its excellent mechanical strength, chemical resistance, and durability.",
    "F": "Fiberglass - A lightweight, strong composite made from glass fibers embedded in a resin matrix, widely used for its high strength-to-weight ratio and corrosion resistance in construction, automotive, and marine applications.",
    "G": "Graphene - A single-atom-thick sheet of carbon atoms arranged in a hexagonal lattice, renowned for its exceptional strength, electrical and thermal conductivity, and wide-ranging application potential.",
    "H": "Hafnium - Known for its strong neutron absorption used in nuclear control rods and for hafnium oxide's crucial role as a high-k dielectric in advanced semiconductor transistors.",
    "I": "Iron - A fundamental structural metal, best known for its central role in steel production and construction because of its strength, abundance, and versatility.",
    "J": "Jade - Celebrated for its toughness and beautiful green coloration, historically prized across East Asia for carved ornaments and ceremonial objects.",
    "K": "Kevlar - A highly strong aramid fiber known for its use in bulletproof vests and lightweight composites.",
    "L": "Lithium - Renowned for its use in rechargeable batteries because of its high energy density and low atomic weight.",
    "M": "Molybden - A metal with a very high melting point and strength, valued in alloys and high-temperature applications.",
    "N": "Nylon - A synthetic polymer famous for its strength, elasticity and widespread use in textiles, ropes and engineering plastics.",
    "O": "Obsidian - A volcanic glass prized for its conchoidal fracture that yields extremely sharp edges, historically used for cutting tools and even surgical scalpel blades.",
    "P": "Platinum - A precious metal known for its excellent catalytic properties and use in jewelry and automotive catalysts.",
    "R": "Rubber - A versatile elastic polymer widely known for its use in tires, seals, and industrial products due to its exceptional elasticity and durability.",
    "S": "Silicon - It is the foundational semiconductor material used in integrated circuits and solar cells because of its excellent electronic properties and mature manufacturing infrastructure.",
    "T": "Teflon - A non-stick and chemically resistant fluoropolymer (PTFE) renowned for its use as a non-stick surface in kitchenware and in industrial applications.",
    "U": "Uranium - A heavy radioactive element widely known for its use as a nuclear fuel and in atomic weapons.",
    "V": "Vantablack - A material made of vertically aligned carbon nanotubes that absorbs about 99.965% of visible light, making it the darkest known man-made substance.",
    "Y": "Yttrium - Chemický prvek známý pro použití v supravodivých keramických materiálech (např. YBa2Cu3O7) a v fosforech pro bílé LED.",
    "Z": "Zirconia - A widely used ceramic (zirconium dioxide) renowned for its high strength, fracture toughness, and biocompatibility, making it common in dental restorations and structural ceramics."
  },
  "Medical Supplies": {
    "A": "Aspirin - A common analgesic and antipyretic known for its effectiveness in pain and preventing blood clots.",
    "B": "Bandage - A fundamental dressing material known for protecting wounds, controlling bleeding, and providing support to injured limbs.",
    "C": "Catheter - A flexible tube commonly used to drain urine or deliver fluids, indispensable in urology and inpatient care.",
    "D": "Defibrillator - A life-saving device best known in emergency medicine for delivering controlled electric shocks to restore normal heart rhythm.",
    "E": "Endoscope - A flexible or rigid instrument used to view and operate inside body cavities, enabling minimally invasive diagnosis and surgery.",
    "F": "Forceps - Widely used surgical instruments known for enabling precise grasping, holding, and manipulation of tissues and objects during medical procedures.",
    "G": "Gas - A sterile textile widely used to stop bleeding and cover wounds.",
    "H": "Heparin - Anticoagulant medication widely used to prevent clotting in IV lines, catheters and during surgeries.",
    "I": "Insulin - A lifesaving hormone replacement used to control blood glucose in people with diabetes.",
    "J": "Jelco - A well-known brand of peripheral intravenous catheters valued for reliable venous access and a wide range of sizes for infusion and medication delivery.",
    "K": "Ketamin - Anesthetic and analgesic medication known for its rapid onset and widespread use in emergency medicine.",
    "L": "Lancet - A small disposable blade used for capillary blood sampling, well-known for finger‑prick glucose testing and other point‑of‑care diagnostics.",
    "M": "Mask - Used to protect the respiratory tract from aerosols and particles and is essential in preventing the spread of infectious diseases.",
    "N": "Naloxone - A rapid-acting opioid antagonist widely used to reverse opioid overdoses in emergency and prehospital care.",
    "O": "Oxygen - A colorless, odorless, and tasteless gas that is essential for human life and is used in medical settings for oxygen therapy and emergency care.",
    "P": "PPE - Essential for protecting healthcare workers from infectious agents and widely associated with outbreak and hospital infection control.",
    "R": "Respirator - A device that filters airborne particles and is well-known for protecting patients and staff by reducing transmission of respiratory infections.",
    "S": "Syringe - A basic tool for injecting and drawing blood, known for precise drug administration.",
    "T": "Tape - A medical tape known for reliable securing of bandages and fixing medical materials.",
    "U": "Ultrasound - Known for providing quick, noninvasive real-time imaging widely used in diagnostics, obstetrics, and bedside assessments.",
    "V": "Vaccine - Vaccines are well-known for preventing infectious diseases and forming the backbone of global immunization programs.",
    "Y": "Yankauer - A well-known suction tip used in medicine for effective and safe secretion drainage during operations and resuscitation due to its rigid construction and versatility.",
    "Z": "Zinc oxide ointment - A topical barrier and mild antiseptic widely used in wound care and for diaper rash because it protects skin and promotes healing."
  },
  "Medicine": {
    "A": "Aspirin - A widely used analgesic, antipyretic, and antiplatelet drug famous for relieving pain and fever and for reducing the risk of heart attack and stroke.",
    "B": "Bupropion - An antidepressant also used for smoking cessation, well-known for inhibiting norepinephrine and dopamine reuptake and having a lower risk of sexual side effects compared to SSRIs.",
    "C": "Ciprofloxacin - A fluoroquinolone antibiotic widely used for its broad-spectrum activity against Gram-negative and some Gram-positive bacteria, especially in urinary tract and gastrointestinal infections.",
    "D": "Doxycycline - A broad-spectrum tetracycline antibiotic widely used to treat various bacterial infections, acne, and for malaria prophylaxis.",
    "E": "Epinephrine - The first-line emergency medication for anaphylaxis, rapidly reversing bronchospasm and hypotension.",
    "F": "Fentanyl - A synthetic opioid known for its extreme potency and rapid onset, widely used in anesthesia and severe pain management but also associated with a high risk of overdose.",
    "G": "Gabapentin - An anticonvulsant and analgesic widely used for neuropathic pain and seizure control due to its effectiveness in reducing neuronal hyperexcitability.",
    "H": "Heparin - A widely used anticoagulant known for preventing and treating blood clots in surgery, dialysis, and hospitalized patients.",
    "I": "Ibuprofen - A nonsteroidal anti-inflammatory drug widely used for pain relief, fever reduction, and inflammation suppression.",
    "J": "Januvia - An inhibitor of DPP-4 used in type 2 diabetes, known for improving blood sugar control at low risk of hypoglycemia.",
    "K": "Ketamine - A dissociative anesthetic famous for producing rapid anesthesia and, more recently, for its rapid-acting antidepressant effects in treatment-resistant depression.",
    "L": "Lithium - A mood stabilizer widely used in the treatment of bipolar disorder due to its ability to reduce the frequency of episodes and reduce the risk of suicide.",
    "M": "Metformin - The first choice in the treatment of type 2 diabetes due to its effective reduction of blood sugar levels and positive impact on cardiometabolic risk.",
    "N": "Naloxone - Rapidly reverses opioid overdose by antagonizing opioid receptors, making it essential in emergency medicine and harm reduction.",
    "O": "Omeprazole - A proton pump inhibitor widely used to reduce gastric acid secretion, making it a mainstay treatment for GERD, peptic ulcers, and Zollinger–Ellison syndrome.",
    "P": "Penicillin - The first widely used antibiotic discovered by Alexander Fleming, which revolutionized medicine by effectively treating bacterial infections.",
    "R": "Rituximab - A monoclonal antibody targeting CD20 that revolutionized treatment of B-cell lymphomas and many autoimmune diseases.",
    "S": "Sildenafil - A phosphodiesterase‑5 inhibitor best known for treating erectile dysfunction and pulmonary arterial hypertension by potentiating nitric oxide–mediated vasodilation.",
    "T": "Tamoxifen - A selective estrogen receptor modulator widely used to treat and prevent estrogen receptor–positive breast cancer.",
    "U": "Ursodiol - A bile acid medication widely used in hepatology to dissolve cholesterol gallstones and treat cholestatic liver diseases such as primary biliary cholangitis.",
    "V": "Vancomycin - A glycopeptide antibiotic widely used as a last-resort treatment for serious Gram-positive infections, including MRSA, because of its effectiveness against resistant strains.",
    "Y": "Yervoy - The first CTLA-4 immune checkpoint inhibitor (ipilimumab), known for pioneering cancer immunotherapy by producing durable responses in metastatic melanoma.",
    "Z": "Zidovudin - The first approved antiretroviral drug against HIV, known as a breakthrough in AIDS treatment."
  },
  "Mood": {
    "A": "Anxious - Well-known in psychology for being a prevalent mood that underlies anxiety disorders and significantly affects cognition and daily functioning.",
    "B": "Bliss - Known for increasing subjective well-being and being associated with better physical and mental health.",
    "C": "Curious - Known for driving discovery and innovation by motivating exploration and continuous learning.",
    "D": "Dramatic - Known for its intense emotional energy and heightened tension, making it a defining quality in theatre and film.",
    "E": "Euphoria - A mood of intense happiness and elation, well-known for its powerful effects on perception, motivation, and behavior.",
    "F": "Fear - A basic emotion extensively studied in psychology and neuroscience for its evolutionary role in survival and its well‑characterized physiological and behavioral responses.",
    "G": "Gloomy - Known for its melancholic, gloomy atmosphere that easily influences mood and behavior of people.",
    "H": "Hopeful - Known for fostering optimism and motivating action by focusing attention on positive future outcomes.",
    "I": "Inspired - Known in creative fields for sparking original ideas and fueling sustained artistic or innovative output.",
    "J": "Joy - A positive emotion recognized for enhancing social bonding, boosting resilience, and promoting overall well-being.",
    "K": "Keen - Known in psychology and everyday language as a state of sharp enthusiasm or heightened interest that strongly influences attention and behavior.",
    "L": "Love - Widely recognized and studied because it underlies attachment, motivates social bonding, and profoundly shapes human behavior and well-being.",
    "M": "Melancholie - Known for its deep, sad, and engaging tune, often used in literature and music to evoke emotional depth.",
    "N": "Nostalgic - The nostalgic mood is well-known for evoking a bittersweet longing for the past, often used in music, film, and advertising to create strong emotional resonance.",
    "O": "Optimistic - Known in psychology for promoting resilience and better mental and physical health outcomes by fostering positive expectations and proactive coping.",
    "P": "Playful - Known for its playful and energetic tone, often used in advertising, design, and children's media to establish a positive emotional relationship with the audience.",
    "R": "Radost - Strong positive emotional state, known in psychology for its positive effects on mental and physical health and increased motivation.",
    "S": "Sorrow - Widely recognized in literature and music for its ability to convey profound emotional weight and elicit empathy.",
    "T": "Tense - Known in psychology for causing increased arousal that can hinder cognitive performance and decision-making under pressure.",
    "U": "Uplifting - Known for inspiring optimism and emotional elevation through bright melodies, positive lyrics, or hopeful narratives.",
    "V": "Vivacious - A lively, spirited mood widely recognized in performance and social contexts for energizing audiences and conveying charismatic presence.",
    "Y": "Yearning - A deep, persistent longing that shapes motivation and often inspires emotional expression in art and relationships.",
    "Z": "Zealous - A mood of intense enthusiasm and dedication, notable for driving persistent effort and high motivation."
  },
  "Mountain": {
    "A": "Aconcagua - It is the highest peak in the Americas and the tallest mountain outside Asia, making it a major objective for mountaineers.",
    "B": "Bromo - A famous active volcano in Indonesia known for its dramatic crater and spectacular sunrise views that attract many tourists.",
    "C": "Cotopaxi - Known stratovolcano in Ecuador, known for its symmetrical conical silhouette and frequent eruptions.",
    "D": "Denali - The highest peak in North America, famous for its extreme weather, massive prominence, and demanding climbs.",
    "E": "Everest - The highest mountain in the world, known as the goal of mountain climbers and a symbol of mountain conquest.",
    "F": "Fuji - An iconic stratovolcano and cultural symbol of Japan, famous for its near-perfect symmetrical cone and prominence in art and pilgrimage.",
    "G": "Gasherbrum - A Karakoram massif best known for Gasherbrum I and II, which are among the world's 8,000‑meter peaks and major objectives for high‑altitude mountaineers.",
    "H": "Hood - Mount Hood is a prominent stratovolcano in Oregon, well-known for its year-round skiing, popular climbing routes, and status as an iconic peak of the Cascade Range.",
    "I": "Iztaccíhuatl - A dormant Mexican volcano renowned for its snow-capped peaks and iconic silhouette that resembles a sleeping woman in local legend.",
    "J": "Jungfrau - Slavný vrchol Bernských Alp, proslulý svou impozantní severní stěnou a významem pro alpský turismus a horolezectví.",
    "K": "Kilimanjaro - Nejznámější jako nejvyšší hora Afriky, oblíbený turistický a horolezecký cíl pro svoji impozantní samostatnou kupu a relativně přístupné trasy.",
    "L": "Lhotse - The world's fourth-highest mountain, renowned for its tremendous altitude and its extremely steep, technical south face that challenges elite mountaineers.",
    "M": "Matterhorn - A striking pyramidal peak in the Alps famous for its distinctive shape and historic significance in mountaineering.",
    "N": "Nanga Parbat - One of the world's highest peaks, notorious for its steep faces and high fatality rate, earning the nickname \"Killer Mountain.\"",
    "O": "Olympus - Slavný jako sídlo řeckých bohů a významný symbol antické mytologie.",
    "P": "Popocatepetl - A highly active Mexican volcano, famous for its frequent eruptions and cultural significance.",
    "R": "Rainier - A heavily glaciated stratovolcano in Washington State, USA, famous for its enormous prominence, extensive glaciers, and as a classic yet challenging objective for climbers.",
    "S": "Shishapangma - The lowest of the fourteen 8,000‑meter peaks and the only one located entirely within Tibet, making it well-known among Himalayan mountaineers.",
    "T": "Teide - A stratovolcano on Tenerife, famous as Spain's highest peak and a major tourist and astronomical site.",
    "U": "Uluru - Slavný monolit v Austrálii, známý pro svůj kulturní význam a dramatické změny barvy.",
    "V": "Vesuv - Známý především díky výbuchu v roce 79 n. l., který zničil Pompeje a Herculaneum, a proto je jedním z nejznámějších aktivních vulkánů.",
    "Y": "Yushan - Nejvyšší hora Tchaj-wanu, proslulá svým impozantním vrcholem a bohatou biodiverzitou.",
    "Z": "Zugspitze - Nejvyšší hora Německa, známá jako oblíbený cíl pro horolezectví, turistiku a lyžování."
  },
  "Movie": {
    "A": "Avatar - Groundbreaking visual effects and immersive 3D technology that revolutionized modern blockbuster filmmaking.",
    "B": "Braveheart - Acclaimed for its epic battle sequences, emotional storytelling, and Mel Gibson's direction and lead performance.",
    "C": "Casablanca - Slavný romantický film známý pro ikonické postavy, nezapomenutelné hlášky a zásadní vliv na klasické hollywoodské drama.",
    "D": "Dune - Famous for its epic world‑building, stunning visuals, and a landmark cinematic adaptation of Frank Herbert’s sci‑fi novel.",
    "E": "E.T. - Steven Spielberg's 1982 family sci‑fi about a stranded alien is renowned for its emotional storytelling, iconic imagery, and massive cultural and box-office impact.",
    "F": "Fargo - Famous for the Coen brothers' darkly comic crime storytelling, memorable characters, and sharp dialogue.",
    "G": "Gladiator - A 2000 epic historical drama celebrated for Russell Crowe’s Oscar-winning performance, Hans Zimmer’s stirring score, and reinvigorating Hollywood’s interest in large-scale antiquity epics.",
    "H": "Her - Acclaimed sci-fi romance known for its poignant exploration of human–AI relationships and Joaquin Phoenix's subtle lead performance.",
    "I": "Inception - Proslulý pro svou inovativní, mnohovrstevnatou strukturu snů a průlomové vizuální efekty.",
    "J": "Jaws - Credited as the first summer blockbuster, Spielberg's 1975 thriller is renowned for its suspenseful direction and John Williams' iconic score.",
    "K": "Kagemusha - Akira Kurosawa's epic historical drama is renowned for its sweeping visuals, meticulous direction, and lasting influence on world cinema.",
    "L": "Logan - A gritty, emotionally powerful final Wolverine film widely praised for Hugh Jackman's performance and its mature, character-driven take on the superhero genre.",
    "M": "Matrix - Renowned for its groundbreaking visual effects, pioneering \"bullet time\" cinematography, and influential cyberpunk storytelling.",
    "N": "Network - A landmark film celebrated for its scathing satire of television news and Peter Finch's electrifying, iconic performance.",
    "O": "Oppenheimer - Christopher Nolan's 2023 biopic, acclaimed for its direction, Cillian Murphy's performance, and its powerful portrayal of the development and consequences of the atomic bomb.",
    "P": "Psycho - Hitchcock's seminal 1960 thriller is famous for its masterful suspense, shocking plot twist, and the iconic shower scene that changed cinematic horror.",
    "R": "Rocky - A classic sports drama that launched Sylvester Stallone's career and became iconic for its underdog story and memorable training montage.",
    "S": "Shrek - Renowned for its subversive take on fairy tales, sharp humor for adults, and groundbreaking CGI that helped redefine mainstream animated family films.",
    "T": "Titanic - Renowned for its sweeping romance, groundbreaking visual effects, and record‑breaking box-office and Academy Award success.",
    "U": "Unforgiven - A gritty revisionist Western directed by and starring Clint Eastwood, celebrated for its moral complexity and for winning the Academy Award for Best Picture.",
    "V": "Vertigo - A landmark Alfred Hitchcock thriller celebrated for its innovative camera techniques, haunting portrayal of obsession, and lasting influence on cinema.",
    "Y": "Yojimbo - A 1961 Akira Kurosawa samurai film famed for its sharp storytelling and major influence on both Japanese cinema and Westerns (it inspired A Fistful of Dollars).",
    "Z": "Zodiac - Známý pro svou precizní, napínavou rekonstrukci vyšetřování Zodiacského vraha a atmosférickou režii Davida Finchera."
  },
  "Musical Instrument": {
    "A": "Akordeon - Známý pro svou schopnost zároveň hrát melodii i harmonii, díky čemuž je široce používaný v lidové i populární hudbě.",
    "B": "Banjo - Noted for its bright, twangy tone and rapid fingerpicking, making it a hallmark of bluegrass and traditional American folk music.",
    "C": "Clarinet - Renowned for its warm, expressive tone and versatility, the clarinet is a staple of classical orchestras and jazz ensembles, capable of lyrical solos and agile technical passages.",
    "D": "Didgeridoo - Australský dechový nástroj známý svým hlubokým drone zvukem a technikou oběhového dechu.",
    "E": "Erhu - A two-stringed Chinese bowed instrument renowned for its expressive, vocal-like tone and central role in traditional and contemporary Chinese music.",
    "F": "Flute - Renowned for its bright, agile tone and versatility, the flute is a central solo and ensemble instrument across classical, jazz, and folk traditions.",
    "G": "Guitar - The guitar is well-known for its versatility and prominence across genres, serving as both a primary rhythm and lead instrument in popular, classical, and folk music.",
    "H": "Harp - Iconic for its sweeping, resonant plucked strings and central role in orchestral, chamber, and folk music.",
    "I": "Igil - Dvoustrunný tuvinský smyčcový nástroj známý svým rezonantním, nosným tónem a používáním jako doprovod hrdelního zpěvu.",
    "J": "Janggu - A traditional Korean hourglass-shaped drum renowned for its distinctive rhythmic versatility and central role in court, folk, and contemporary Korean music.",
    "K": "Koto - A Japanese plucked zither, well-known for its distinctive resonant timbre and central role in traditional and contemporary Japanese music.",
    "L": "Lute - Renowned as the primary plucked string instrument of the Renaissance and Baroque eras for its resonant, intimate tone and central role in solo and accompaniment repertoire.",
    "M": "Mandolin - A small, plucked string instrument known for its bright, percussive tone and prominent role in bluegrass, folk, and classical music.",
    "N": "Ney - Renowned in Middle Eastern classical and Sufi music for its breathy, expressive tone and ability to convey profound emotion.",
    "O": "Oboe - Renowned for its penetrating, lyrical tone and role as the orchestra's principal double-reed instrument, often used to sound the tuning A.",
    "P": "Piano - Renowned for its wide range and expressive dynamics, the piano is central to composition, solo performance, and accompaniment across many musical genres.",
    "R": "Recorder - A woodwind instrument well-known for its clear, sweet tone and widespread use in early music performance and elementary music education.",
    "S": "Saxophone - Renowned for its warm, expressive tone and central role in jazz improvisation and big-band music.",
    "T": "Trumpet - Renowned for its bright, projecting tone and virtuosic solos, making it a central instrument in jazz, orchestral fanfares, and popular music.",
    "U": "Ukulele - Well-known for its small size, bright, cheerful tone, and strong association with Hawaiian music and easy playability.",
    "V": "Violin - Renowned for its expressive range, virtuosic solo repertoire, and central role in orchestras and chamber music.",
    "Y": "Yangqin - A Chinese hammered dulcimer known for its bright, percussive tone and versatility in traditional and contemporary ensembles.",
    "Z": "Zither - A plucked string instrument known for its bright, resonant tone and its prominent role in Central European folk and classical music."
  },
  "Myths and Legends": {
    "A": "Achilles - The Greek hero of the Trojan War immortalized in the Iliad, famous for his unmatched prowess and the legend of his vulnerable heel.  \nAeneas - Trojan prince whose epic journey to Italy, told in Virgil’s Aeneid, became a foundational myth for Rome’s origins.  \nArachne - Mortal weaver in Greek myth who was transformed into a spider after challenging Athena, symbolizing hubris and craft.  \nAnansi - West African trickster-spider whose clever tales teach moral lessons and spread cultural knowledge.  \nAnubis - Egyptian jackal-headed god of embalming and the afterlife, central to funerary rites and judgment myths.  \nApollo - Major Greek deity of prophecy, music, and healing, renowned for the Oracle of Delphi and numerous myths.  \nArtemis - Greek goddess of the hunt and the moon, known for her independence, protection of youth, and mythic hunts.  \nAmaterasu - Shinto sun goddess whose withdrawal into a cave and return explains the restoration of light in Japanese myth.  \nAtlantis - Legendary advanced island civilization that sank into the sea, emblematic of lost utopias and moral cautionary tales.  \nAvalon - Mystical island in Arthurian legend associated with healing, magic, and King Arthur’s final rest.  \nAtlas - Titan condemned to bear the heavens, a potent symbol of cosmic burden and endurance in Greek myth.  \nAurora - Roman goddess of the dawn celebrated in poetic myths as the bringer of light and renewal each morning.  \nAsgard - Norse realm of the gods and the stage for many central myths about the Aesir and cosmic events.  \nArthur - Legendary British king whose tales of chivalry, Camelot, and the quest for the Holy Grail define Arthurian legend.  \nAtalanta - Swift huntress of Greek myth famed for her athletic prowess and key role in the Calydonian Boar hunt.  \nApsu - Mesopotamian primeval freshwater deity whose conflict with younger gods explains creation in Babylonian myth.  \nAnzu - Mesopotamian storm-bird/demon who steals the Tablet of Destinies, playing a pivotal role in Sumerian heroic tales.  \nAztlan - Mythical ancestral homeland of the Nahua peoples, central to Aztec-origin stories and cultural identity.",
    "B": "Baba Yaga - Iconic Slavic witch who lives in a hut on chicken legs and embodies the ambiguous boundary between helper and hinderer in folktales.  \nBaldur - Beloved Norse god whose tragic death triggers the events leading to Ragnarök, making him central to Norse myth.  \nBanshee - Irish wailing spirit well-known as an omen of imminent death in Gaelic folklore.  \nBeowulf - Legendary Geatish hero famed from the Old English epic for defeating Grendel and a dragon, foundational to English literary mythology.  \nBellerophon - Greek hero famous for taming Pegasus and slaying the Chimera, exemplifying classical heroic exploits.  \nBalor - Formidable Fomorian leader in Irish myth, notorious for his destructive \"evil eye\" and role in the Tuatha Dé Danann cycles.  \nBacchus - Roman god of wine and ecstatic rites whose cult and myths about revelry influenced ancient religion and literature.  \nBasilisk - Legendary serpent or rooster-serpent hybrid famed in medieval bestiaries for its deadly gaze or breath.  \nBluebeard - Folktale villain known for murdering his wives and the forbidden chamber, symbolizing warnings about curiosity and marital trust.  \nBarghest - Spectral black dog from northern English folklore famed as a portent of death and supernatural menace.  \nBran - (Bran the Blessed) Legendary Welsh giant-king of the Mabinogion, remembered for the magical cauldron of rebirth and his protective role.  \nBhima - Powerful Pandava warrior in the Mahabharata celebrated for his immense strength and pivotal role in the epic war.  \nBrahma - Hindu creator god central to cosmology and creation myths, forming part of the Trimurti with Vishnu and Shiva.  \nBrigid - Prominent Celtic goddess (and later saint) associated with fire, poetry, healing and household protection in Irish tradition.  \nBroceliande - Legendary enchanted forest of Arthurian romance famed as the setting for Merlin’s mysteries and faerie lore.",
    "C": "Cerberus - The three-headed dog who guards the Greek Underworld, iconic as the boundary between life and death.  \nChimera - A fire-breathing hybrid monster from Greek myth, famous as a terrifying composite creature and metaphor for impossible problems.  \nCthulhu - A cosmic entity by H.P. Lovecraft, renowned for defining modern cosmic horror and spawning a vast mythos.  \nCyclops - One-eyed giants in Greek myth, best known from Polyphemus and Odysseus' tale as emblematic solitary brute strength.  \nCupid - Roman god of love whose arrows cause desire, central to art and stories about romantic fate.  \nCronus - Titan who swallowed his children in Greek myth, well-known for themes of time, power, and dynastic overthrow.  \nCassandra - Trojan prophetess cursed to have true prophecies disbelieved, symbolic of ignored warnings and tragic foresight.  \nCalypso - Nymph who held Odysseus on her island, noted for representing temptation and the tension between homecoming and desire.  \nCirce - Enchantress who transforms men into beasts, famous for her magical tests of heroes and moral ambiguity.  \nCharybdis - Sea monster creating deadly whirlpools opposite Scylla, known as a perilous navigational hazard and source of the expression \"between Scylla and Charybdis.\"  \nCamelot - Legendary court of King Arthur, celebrated as the idealized center of chivalry and Arthurian romance.  \nCuchulainn - Irish hero of the Ulster Cycle, famed for superhuman feats and a tragic, heroic narrative central to Celtic legend.",
    "D": "Dragon - A ubiquitous legendary reptile famous worldwide for symbolizing power, hoarding treasure, and starring in countless heroic and creation myths.\nDjinn - Supernatural beings from Arabian legend known for their moral ambiguity and wish-granting role in many folktales.\nDavy Jones - A nautical folkloric figure whose name became synonymous with the sea’s graveyard, \"Davy Jones's Locker,\" for lost sailors.\nDullahan - A headless rider from Irish folklore renowned for heralding death and instilling dread with his eerie appearance.\nDaedalus - A master craftsman of Greek myth celebrated for building the labyrinth and the tragic tale of his wax-winged flight from Crete.\nDraugr - An undead creature of Norse legend famed for guarding burial mounds and displaying supernatural strength and malice.\nDemeter - Greek goddess of the harvest best known for the myth of Persephone, which explains the cycle of the seasons.\nDionysus - Greek god of wine and ecstasy famous for his cults, theatrical inspirations, and myths about divine revelry and madness.\nDiarmuid - An Irish hero (Diarmuid Ua Duibhne) famed in the Fenian Cycle for his tragic love story with Gráinne and his prowess in battle.\nDurga - A major Hindu goddess celebrated for defeating the buffalo demon Mahishasura, symbolizing the victory of good over evil.\nDryad - A tree spirit from Greek myth well-known as a nature nymph embodying the life and fate of a particular tree.\nDracula - A literary and folkloric vampire figure inspired by historical sources, renowned for shaping modern vampire myths and gothic horror.",
    "E": "Echidna - A monstrous figure in Greek myth known as the \"mother of monsters\" for bearing many famous beasts.  \nEros - The Greek god of love whose powers over desire and attraction make him central to many myths about passion and fate.  \nEpona - A Celtic horse goddess famous for protecting horses and riders and for being adopted into Roman religion.  \nEldorado - A legendary city of immense gold that became a symbol of colonial greed and the obsessive quest for riches.  \nErlkönig - A malevolent supernatural \"Elf-King\" from German folklore, immortalized by Goethe's poem as a deathly seducer.  \nEnkidu - The wild companion of Gilgamesh in the Mesopotamian epic, known for humanizing the hero and embodying themes of friendship and mortality.  \nEnlil - A chief Mesopotamian deity associated with wind and storms, central to creation, kingship, and fate in Sumerian myth.  \nEreshkigal - The Sumerian queen of the underworld, famous for ruling the dead and featuring in descent and resurrection narratives.  \nEurydice - The ill-fated wife of Orpheus whose failed rescue from the underworld epitomizes tragic love in Greek myth.  \nEmpusa - A shape-shifting female demon in Greek folklore noted for seducing and devouring men as a cautionary figure.  \nEfreet - A powerful class of fire jinn in Islamic folklore, renowned for immense strength, supernatural abilities, and volatile temper.  \nElves - Supernatural beings from Germanic and Norse folklore whose ambiguous benevolence and mischief shaped later fairy lore and fantasy.  \nExcalibur - King Arthur's legendary sword, symbolic of rightful sovereignty, divine favor, and magical authority in Arthurian legend.  \nEdda - The Poetic and Prose Eddas are fundamental Old Norse collections that preserve and systematize much of Norse mythology.",
    "F": "Fafnir - Norský drak z eddických sáh, proslulý jako proměněný trpaslík a symbol chamtivosti poté, co získal prokletý poklad.\nFenrir - Obří vlk v severské mytologii, známý tím, že podle věštby zabije Odina během Ragnaröku, a proto jej bohové spoutali.\nFaust - Legenda o doktoru Faustovi popisuje jeho pakt s ďáblem výměnou za vědění a rozkoš, což se stalo literárním archetypem „smlouvy s ďáblem“.\nFionn - Irský hrdina Fionn mac Cumhaill, proslavený jako vůdce Fiannů a nositel moudrosti a dobrodružných příběhů v irském folklóru.\nFreyja - Severská bohyně lásky, krásy a válek, slavná pro svůj náhrdelník Brísingamen a roli v mýtech o osudech bohů.\nFreyr - Severský bůh plodnosti a úrody, obdivovaný pro svou moc nad počasím a blahobytem, často spojovaný s prosperitou.\nFuxi - Mýtický čínský kulturní hrdina Fuxi, tradičně připisovaný vynálezu písma, rybolovu a základním civilizačním dovednostem.\nFlidais - Keltská bohyně lesů a dobytka, známá v irském folklóru pro spojení s přírodou a plodností.",
    "G": "Gilgamesh - One of the oldest epic heroes from Mesopotamia, famed for his quest for immortality and the earliest surviving exploration of friendship and mortality.  \nGaia - The primordial Greek personification of Earth, central to cosmogony as the mother of gods and life.  \nGanesha - Hindu elephant-headed deity widely revered as the remover of obstacles and patron of beginnings and learning.  \nGorgon - Monstrous figures in Greek myth (notably Medusa) whose petrifying gaze made them enduring symbols of danger and protection.  \nGolem - A clay-made animated being from Jewish folklore, notable for stories about creation, protection, and the risks of playing creator.  \nGriffin - A hybrid creature (lion body, eagle head/wings) common in ancient art and legend as a guardian and symbol of strength.  \nGrendel - The fearsome antagonist of Beowulf whose brutality and otherness have made him a lasting emblem of monstrous opposition in Germanic legend.  \nGawain - A chivalric Knight of the Round Table celebrated especially for the moral-testing tale in Sir Gawain and the Green Knight.  \nGuinevere - Queen of Arthurian legend whose love affair with Lancelot and role in Camelot’s downfall make her central to themes of romance and betrayal.  \nGoblin - Small, often malevolent folkloric creatures across Europe, well-known as embodiments of mischief, fear, and the uncanny.  \nGiant - Large humanoid beings found in many cultures, used in myths to personify natural forces, primordial foes, or challenges for heroes.  \nGyges - Figure from Greek thought famous for the Ring of Gyges story that questions whether people behave morally when unseen.  \nGlooscap - Legendary culture hero of the Wabanaki and other Algonquian peoples, credited with shaping the land and teaching essential skills.  \nGwydion - A prominent trickster-magician in Welsh mythology whose cunning and transformations are central to several Mabinogi tales.  \nGog - Apocalyptic antagonist from Biblical and later traditions, known for representing eschatological invasion and end-times conflict.",
    "H": "Hades - The Greek god who rules the underworld and the dead, central to many myths about death and the afterlife.  \nHecate - A Greek goddess associated with witchcraft, crossroads, and magic, often invoked in rituals and literature.  \nHercules - Renowned for his extraordinary strength and the canonical Twelve Labors, making him the archetypal hero of Greek myth.  \nHel - The Norse ruler of the underworld whose domain over the dead and role in fate make her a key figure in Norse cosmology.  \nHeimdall - The vigilant Norse guardian of the Bifrost bridge, famed for his keen senses and pivotal role at Ragnarok.  \nHydra - The multi-headed serpent slain by Hercules, infamous for its heads that regrow and for symbolizing intractable problems.  \nHarpy - A fearsome winged spirit from Greek myth known for snatching people and souls as agents of punishment and terror.  \nHouyi - The legendary Chinese archer celebrated for shooting down nine of ten suns and saving the world from devastation.  \nHuma - A mythical Persian bird said to bestow kingship or good fortune by its shadow or touch, symbolizing royal favor.  \nHuldra - A seductive forest spirit in Scandinavian folklore famous for luring people into the woods and embodying nature’s enchantment.  \nHippogriff - A mythical hybrid creature from medieval lore, celebrated for combining the nobility of horse and bird and appearing in chivalric tales.  \nHerne - An English folkloric ghost or spirit of the hunt, famed for haunting Windsor Forest and associated with seasonal and wild motifs.",
    "I": "Icarus - Famous in Greek myth for flying too close to the sun and falling, symbolizing the dangers of hubris and overambition.  \nIzanagi - Central in Shinto creation myths as the male creator god who, with Izanami, formed the Japanese islands and set foundational cosmology.  \nIzanami - Known as the female creator and death-goddess in Japanese myth whose descent to Yomi explains death and ritual purity taboos.  \nIsis - Renowned in Egyptian religion for resurrecting Osiris and for her widespread, long-lasting cult as a mother and magician deity.  \nInanna - Celebrated in Sumerian myth for her complex roles as goddess of love and war and her dramatic descent to the underworld.  \nIshtar - Widely known in Mesopotamian myths for similar love-and-war attributes and for prominent roles in epics like Gilgamesh.  \nInti - Prominent in Inca religion as the sun god and principal deity legitimizing Inca rulers and state religion.  \nIlya - A legendary Russian bogatyr (Ilya Muromets) famed in byliny for superhuman strength and heroic defense of the homeland.  \nIktomi - Well-known in Lakota and Plains folklore as a trickster-spider figure who teaches moral lessons through cunning mischief.  \nIxchel - Recognized in Maya mythology as a moon and childbirth goddess important for fertility and healing rituals.  \nImhotep - Famous historically and mythically in Egypt as an architect and physician later deified as a god of medicine and wisdom.  \nIara - Noted in Brazilian/Amazonian folklore as a seductive river nymph whose legend warns of the dangers of waterways and temptation.  \nIblis - Central in Islamic tradition as the jinn who refused to bow and fell from grace, symbolizing disobedience and evil.  \nIdunn - Known in Norse myth for guarding apples that grant the gods youth, making her crucial to their immortality theme.  \nIsolde - Famous in Celtic/Arthurian legend for the tragic love story with Tristan that shaped medieval romance themes.  \nIndra - Prominent in early Vedic myth as the warrior-thunder god and king of gods, central to Indo-Aryan religious narratives.",
    "J": "Jormungandr - Obří had z norštiny, proslulý tím, že obepíná svět a při Ragnaroku se střetne s Thorem.  \nJinn - Nadpřirozené bytosti z arabské mytologie, známé jako duchové/geniové ovládající přání a kouzla.  \nJason - Hrdina řecké mytologie, proslulý vedením Argonautů při hledání Zlatého rouna.  \nJatayu - Bojovník-ptačí bohém z indického eposu Rámájana, slavný tím, že se pokusil zachránit Sítu.  \nJack - Lidový pohádkový hrdina (Jack and the Beanstalk), známý svým střetem s obrem a magickými fazolemi.  \nJorogumo - Japonská yokai ve formě pavoučice, proslulá svým sváděním a hrozivými překvapenými oběťmi.  \nJengu - Vodní duchové západoafrické tradice, známí jako léčivé a ochranitelské bytosti u pobřežních komunit.  \nJiangshi - Čínský „skáčící upír“, známý svým statickým skokem a vysáváním života z obětí.  \nJanus - Římský bůh dveří a začátků s dvěma tvářemi, známý symbolikou přechodů a času.  \nJežibaba - Slovanská čarodějnice z lidových pověstí, proslulá jako nebezpečná i pomocná postava v pohádkách.",
    "K": "Kraken - Legendary Scandinavian sea monster blamed for sinking ships and the source of modern giant-cephalopod myths.  \nKali - Hindu goddess of time and destruction, widely recognized for her fierce iconography and role in cosmic cycles.  \nKappa - Japanese water yokai known for mischievous or dangerous behavior around rivers, used in cautionary folklore.  \nKukulkan - Maya feathered-serpent deity tied to creation and astronomy, famous for the Chichen Itza pyramid’s equinox serpent shadow.  \nKitsune - Japanese fox spirit famed for shapeshifting and serving as both trickster and guardian in countless tales.  \nKintaro - Folkloric Japanese child hero endowed with superhuman strength, celebrated as a symbol of bravery in stories and festivals.  \nKokopelli - Humpbacked flute-playing fertility figure from Southwestern Native American traditions, widely used as a cultural and artistic emblem.  \nKrishna - Central Hindu deity and Bhagavad Gita teacher, renowned for his divine deeds, teachings, and enduring devotional following.  \nKaguya - Protagonist of the Tale of the Bamboo Cutter, celebrated as Japan’s archetypal lunar princess and a foundational folktale.  \nKurent - Slovenian carnival figure believed to drive away winter, central to the well-known Kurentovanje festival.  \nKullervo - Tragic antihero from the Finnish Kalevala whose story of fate and vengeance influenced Nordic art and literature.  \nKarna - Epic hero of the Mahabharata renowned for his generosity, martial skill, and tragic loyalty dilemmas.",
    "L": "Loki - The Norse trickster god famed for shape-shifting, deception, and precipitating the events of Ragnarök.  \nLancelot - A central Arthurian knight celebrated for his unmatched prowess and tragic love affair with Queen Guinevere.  \nLamia - A Greek mythic bogeywoman or child-devouring demon whose story warned against desire and transgression.  \nLeviathan - A primeval sea monster from Hebrew scripture symbolizing chaos and divine power over the deep.  \nLilith - A figure in Jewish folklore often portrayed as Adam’s first wife turned demon, influential in discussions of femininity and danger.  \nLugh - A major Irish deity of skill, crafts, and war, renowned for his many talents and heroic deeds.  \nLeprechaun - An Irish fairy shoemaker famous in folklore for mischief and hiding a pot of gold at the rainbow’s end.  \nLadon - The serpent-dragon that guarded the golden apples in Greek myth, notable as one of Heracles’ labors.  \nLyonesse - A legendary sunken kingdom tied to Arthurian lore, remembered as a vanished land swallowed by the sea.  \nLamassu - An Assyrian protective hybrid creature (human-headed winged bull) iconic as a guardian of palaces and gates.  \nLlorona - A Latin American ghost legend of a mourning woman who drowned her children and haunts waterways as a cautionary tale.  \nLycaon - A Greek king transformed into a wolf as divine punishment, often cited as an origin for werewolf myths.",
    "M": "Medusa - A Greek monster with snakes for hair whose gaze turned people to stone, famous as a symbol of danger and the hero Perseus’ victory.\nMinotaur - A half-man, half-bull creature confined in the Labyrinth, well-known for representing monstrous otherness and Theseus’ triumph.\nMerlin - The legendary wizard of Arthurian legend celebrated for his prophetic magic and pivotal role in King Arthur’s rise.\nMidas - A king in Greek myth whose golden touch became a cautionary tale about greed and unintended consequences.\nMaui - A Polynesian demigod and trickster famed for feats like fishing up islands and slowing the sun, central to Pacific oral traditions.\nMorrigan - A Celtic war goddess associated with fate, battle, and shape‑shifting, remembered for influencing the outcome of conflicts.\nMorpheus - The Greek god of dreams credited with shaping human dreams, giving his name to the concept of dream-figures.\nMulan - A legendary Chinese heroine who disguised herself as a man to fight in her father’s place, celebrated for filial piety and bravery.\nMorgan - (Morgan le Fay) The powerful enchantress of Arthurian tales, famous for her magic and ambiguous role as antagonist and healer.\nMedea - A sorceress in Greek myth known for aiding Jason and exacting horrific revenge, symbolizing the destructive potential of passion.\nMithras - The central figure of the Roman Mithraic mysteries, known for the bull-slaying imagery and the cult’s secretive rites across the Roman Empire.\nManannán - (Manannán mac Lir) An Irish sea deity famous as a guardian of the Otherworld and a master of sea and weather in Celtic mythology.",
    "N": "Narcissus - A Greek mythic youth whose self-love for his reflection gave rise to the enduring concept of narcissism.  \nNian - A Chinese monster blamed for New Year dangers whose fright of noise and red led to fireworks and red decorations in the festival.  \nNidhogg - A Norse dragon that gnaws at Yggdrasil, emblematic of cosmic decay and the cycle of destruction in Norse cosmology.  \nNyx - The Greek primordial goddess of night, famous for her powerful, mysterious role in cosmogony and fate.  \nNuwa - A Chinese creator goddess celebrated for shaping humanity and mending the broken heavens in origin myths.  \nNamtar - A Mesopotamian underworld deity and bringer of fate, well-known as an agent of death and divine decree.  \nNephilim - Mysterious giant figures from Biblical tradition often cited in discussions of ancient heroes and angelic lore.  \nNimue - An Arthurian enchantress (the Lady of the Lake) renowned for her magical role in Merlin’s story and Excalibur’s fate.  \nNuada - An Irish god-king of the Tuatha Dé Danann famed for his silver hand and themes of kingship and loss.  \nNuckelavee - A grotesque Orcadian sea demon notorious in Scottish folklore for spreading disease and blight.  \nNaga - Serpentine deities across South and Southeast Asia, widely recognized as powerful guardians and spiritual beings.  \nNanna - The Sumerian/Babylonian moon god (Sin), prominent in Mesopotamian religion and temple cults.",
    "O": "Odin - The chief Norse god, famed for sacrificing an eye for wisdom and ruling over war, death, and magic, which makes him central to Norse myth and its modern adaptations.",
    "P": "Pangu - The Chinese creator giant who separated heaven and earth and is central to Chinese cosmogony.  \nPan - The Greek rustic god of nature and shepherds, famed for his horned appearance and the term “panic.”  \nPandora - The first woman in Greek myth who opened a container releasing evils, an enduring origin story for human suffering.  \nPegasus - The winged horse born from Medusa’s blood, famous as a symbol of inspiration and heroic aid.  \nPersephone - Daughter of Demeter and queen of the underworld whose seasonal descent explains the cycle of the seasons.  \nPerseus - The Greek hero who beheaded Medusa and rescued Andromeda, epitomizing heroic adventure aided by the gods.  \nPhoenix - The mythical bird that cyclically burns and is reborn, widely known as a symbol of resurrection and renewal.  \nPrometheus - The Titan who stole fire for humanity and was punished, renowned as a symbol of defiance and the gift of knowledge.  \nPoseidon - The Greek god of the sea and earthquakes, infamous for his power over sailors, storms, and horses.  \nPuck - The mischievous English fairy popularized by Shakespeare’s A Midsummer Night’s Dream, representing trickery and the capricious supernatural.  \nPoltergeist - A type of noisy, disruptive spirit in German folklore that became a staple of ghost stories and paranormal lore.  \nPwyll - A prince in the Welsh Mabinogi known for adventures that blend human politics with the otherworld, central to Celtic legend.  \nPele - The Hawaiian goddess of volcanoes and fire, famed for creating islands and her tempestuous, creative power.  \nPhaethon - The ill-fated son of Helios who lost control of the sun chariot, a cautionary myth about hubris and reckless ambition.  \nParvati - A principal Hindu goddess, consort of Shiva, celebrated for her roles as mother, wife, and embodiment of devotion and power.  \nPyramus - One half of the tragic lovers in the classical tale Pyramus and Thisbe, known as a precursor to later tragic-romance narratives.",
    "R": "Ragnarok - The apocalyptic Norse saga known for its cataclysmic battle in which gods die and the world is reborn.  \nRa - The principal Egyptian sun god widely recognized as creator and symbol of royal power.  \nRama - The hero-king of the Ramayana revered as the embodiment of dharma and ideal rulership.  \nRavana - The ten‑headed demon king of the Ramayana famous as a powerful antagonist who abducts Sita.  \nRomulus - The legendary founder of Rome famed for killing his twin Remus and establishing the city.  \nRusalka - A Slavic water spirit or nymph known for luring people to water and popularized by Dvořák’s opera.  \nRhiannon - A prominent figure in Welsh mythology associated with horses, magic, and sovereignty in the Mabinogion.  \nRyujin - The Japanese sea dragon god famed for controlling tides with magical jewels and ruling an undersea palace.  \nRokurokubi - A Japanese yokai known for its long, stretchable neck and eerie nocturnal transformations.  \nRán - The Norse sea goddess notorious for using a net to capture drowned sailors and symbolize the perils of the sea.",
    "S": "Siren - Known for luring sailors to shipwreck with enchanting song in Greek mythology.  \nSphinx - Renowned for posing riddles and guarding thresholds in Egyptian and Greek myths.  \nSelkie - Famous in Celtic folklore as seal-people who shed skins and create tragic human romances.  \nSasquatch - Widely known in North American legend as an elusive, ape-like cryptid symbolizing the wild unknown.  \nSatyr - Recognized in Greek myth as half-goat companions of Dionysus representing revelry and fertility.  \nScylla - Infamous sea monster in Greek myth that personifies unavoidable maritime danger.  \nSalamander - Legendary creature in medieval bestiaries famed for its supposed ability to withstand or live in fire.  \nSleipnir - Odin’s eight-legged horse in Norse myth celebrated for its supernatural speed and origin.  \nSkadi - Norse giantess and goddess of winter and hunting, noted for her marriage to the sea-god Njord.  \nSurtr - Fire giant in Norse mythology fated to set the world ablaze at Ragnarök, embodying destruction and renewal.  \nSusanoo - Japanese storm god famed for slaying the eight-headed serpent Yamata no Orochi.  \nSiegfried - Hero of Germanic legend who slays a dragon and gains invulnerability, central to the Nibelungenlied.  \nShapeshifter - Universal mythic archetype known for beings that change form, symbolizing transformation and trickery.  \nSol - Personification of the sun in Norse/Germanic myth, famous for being pursued by wolves across the sky.  \nSeraph - High-ranking angelic beings in Judeo-Christian tradition, notable for their fiery imagery and closeness to the divine.",
    "T": "Tiamat - Mezopotamská bohyně a chaosní mořská příšera, známá jako matka bohů a symbol kosmického chaosu poražená při stvoření světa.  \nThor - Severský bůh hromu, proslulý svým kladivem Mjölnirem a rolí v ochraně bohů a lidí.  \nTezcatlipoca - Aztécký bůh noci a osudu, známý svou mocí, intrikami a rituálními oběťmi.  \nTlaloc - Aztécký bůh deště a zemědělství, uctívaný pro dávání úrody i hrozbu bouří a sucha.  \nThunderbird - Legendární pták severoamerických kmenů, proslulý jako nadpřirozené stvoření ovládající blesky a počasí.  \nTantalus - Postava řecké mytologie, proslulá trestem věčného hladovění a žízně jako varování před rouháním.  \nTheseus - Athénský hrdina, známý porážkou Minotaura a sjednocením a osvobozením obyvatel Attiky.  \nTristan - Hrdina středověké legendy, proslulý tragickým milostným příběhem s Isoldou.  \nTyphon - Obří monstrum řecké mytologie, známé jako zosobnění chaosu, které ohrožovalo bohy i světový řád.  \nTýr - Severský bůh války a práva, známý především pro ztrátu ruky při spoutání vlka Fenrira.  \nTiresias - Slepý věštec řecké mytologie, proslulý svými proroctvími a legendou o dočasné změně pohlaví.  \nTeutates - Keltský bůh, známý z římských záznamů pro obětní praktiky a ochrannou roli vůči lidu.",
    "U": "Unicorn - A mythical horse-like creature with a single horn, famed across cultures as a symbol of purity, rarity, and prominent in European medieval lore.\nUlysses - The Roman name for Odysseus, celebrated for his cunning and his long, adventurous voyage home in Homeric epic tradition.\nUkko - The chief Finnish god of sky and thunder, known as a creator and bringer of rain in Finnish pagan belief.\nUnkulunkulu - The principal creator deity in Zulu mythology, renowned for creating humanity and establishing social order.\nUllr - A Norse god associated with archery, hunting and winter, remembered in place-names and skaldic poetry.\nUroboros - A serpent or dragon eating its own tail, famous as a symbol of cyclicality, eternity, and transformation in alchemy and myth.\nUmibozu - A mysterious sea spirit of Japanese folklore, notorious for appearing at sea and capsizing ships.\nUshioni - A monstrous yokai in Japanese tales, often depicted with an ox-like head and feared for attacking people and causing disasters.\nUbar - A legendary lost Arabian city, famed as the mysterious \"Atlantis of the Sands\" in Middle Eastern legend and exploration lore.\nUrd - One of the three Norns in Norse mythology, renowned for weaving fate and tending the world tree, Yggdrasil.\nUtgard - The giant stronghold in Norse myth, best known as the realm of Utgard-Loki where gods face deceptive trials.\nUbume - A Japanese ghost of a mother who died in childbirth, widely known in folklore as a tragic spirit that haunts roads and seeks aid.",
    "V": "Valkyrie - Iconic Norse choosers of the slain who escort heroes to Valhalla, central to Viking warrior lore.  \nVampire - Enduring folkloric undead that drain blood, shaping centuries of horror fiction and popular culture.  \nVainamoinen - A chief hero and wise singer of the Finnish Kalevala, foundational to Finnish national myth and literature.  \nVritra - Vedic dragon-serpent defeated by Indra, symbolizing the release of waters and the establishment of cosmic order.  \nVaraha - The boar avatar of Vishnu who rescues the earth, a prominent motif in Hindu creation and salvation myths.  \nVishnu - Major Hindu deity whose avatars and role as preserver are central to vast mythic cycles and devotional traditions.  \nVulcan - Roman god of fire and craftsmanship, influential in myths about metallurgy and divine artisanship.  \nVanir - A faction of Norse gods associated with fertility and prosperity, notable for their war and eventual peace with the Aesir.  \nVasilisa - Russian folktale heroine famed for her cleverness and encounter with Baba Yaga, emblematic of Slavic fairy tales.  \nVodyanoy - Slavic water-spirit notorious for drowning victims and guarding waterways in Eastern European folklore.  \nVoluspa - An Elder Edda poem that prophesies Norse cosmology and Ragnarok, serving as a primary source for Norse myth.  \nVolund - Legendary smith (Wayland) famed across Germanic tradition for extraordinary craftsmanship and revenge tales.",
    "Y": "Yggdrasil - Světový strom v severské mytologii, proslulý tím, že spojuje světy a je osou kosmu.  \nYmir - Prvotní obr v severských mýtech, známý tím, že z jeho těla vznikl svět i božstvo.  \nYama - Bůh smrti v hinduistické mytologii, proslulý jako soudce zemřelých a vládce podsvětí.  \nYamata-no-Orochi - Osmihlavý had v japonské mytologii, slavný bojem se hrdinou Susanoem, který jej porazil.  \nYuki-onna - Duch sněžné ženy v japonských legendách, známý svou mrazivou krásou a smrtící přítomností.  \nYs - Legendární zatopené město v bretaňských pověstech, proslulé příběhem o jeho pádu kvůli hříchům obyvatel.  \nYara-ma-yha-who - Australská aboriginská bytost, známá jako malé vampirické stvoření, které vysává a polyká oběti.  \nYaksha - Duchové a strážci v indické mytologii, známí jako ochránci pokladů a bohatství v eposech.  \nYale - Mytologická bestie ve středověkých bestiářích, známá pro své vratné rohy a použití v heraldice.  \nYali - Mytologické zvíře v jihovýchodní indické chrámové ikonografii, proslulé jako strážce a dekorativní motiv.",
    "Z": "Zeus - Hlavní bůh řecké mytologie, proslulý svými blesky a mocí vládnout bohům a lidem.  \nZalmoxis - Trácký/dáký bůh nebo moudrý léčitel, známý díky představám o posmrtném životě a tajným kultům.  \nZmey - Slovanský drak (často Zmey Gorynych), proslulý jako mocný protivník hrdinů a symbol divokých přírodních sil.  \nZorya - Slovanské nebeské bohyně/strážkyně, známé jako ochránkyně slunce a osudu světa.  \nZashiki-warashi - Japonský domovní duch ve tvaru dítěte, proslulý tím, že přináší štěstí rodinám, kde se objevuje.  \nZhongKui - Čínský lovec démonů, slavný jako ochránce před zlými duchy a posednutím.  \nZhurong - Čínský bůh ohně, známý z mýtů o boji s jinými božstvy a zavádění ohně lidstvu.  \nZlatorog - Slovinský legendární kamzík se zlatými rohy, proslulý svou nepolapitelnou krásou a pokladem, který střeží.  \nZilant - Tatarský/baškirský dračí tvor z kazaňských pověstí, známý jako heraldický symbol města Kazaň.  \nZana - Albánská horská nymfa, známá pro svou nadpřirozenou sílu, krásu a ochranu přírody.  \nZiusudra - Sumerský hrdina potopy, proslulý tím, že přežil velkou povodeň a získal nesmrtelnost.  \nZoroaster - Zakladatel zoroastrismu, známý pro učení o boji mezi dobrem a zlem, které ovlivnilo perské náboženství."
  },
  "Occupation": {
    "A": "Architect - Known for designing buildings that combine functionality and aesthetics, shaping the built environment.",
    "B": "Bankéř - Je známý svými schopnostmi řídit finance, poskytovat úvěry a ovlivňovat investiční a investiční a ekonomická rozhodnutí.",
    "C": "Chemik - Provádí výzkum a vyvíjí nové látky, materiály a postupy, díky nimž posouvá vědu a průmysl.",
    "D": "Doctor - They are well-known for diagnosing and treating illnesses and providing medical care to patients.",
    "E": "Engineer - Known for applying scientific and mathematical principles to design, build, and improve structures, machines, and systems.",
    "F": "Firefighter - Known for extinguishing fires and performing emergency rescues to protect people and property.",
    "G": "Geologist - Studies Earth's materials and processes, and is well-known for interpreting the planet's history and locating natural resources.",
    "H": "Historian - Known for researching, interpreting, and communicating past events to help societies understand their origins and development.",
    "I": "Ilustrátor - Vytváří vizuální obsah pro knihy a média, známý pro schopnost vyprávět příběhy obrazem.",
    "J": "Journalist - Known for investigating, reporting, and communicating news to the public, often holding institutions and individuals accountable.",
    "K": "Kardiolog - Specialista na onemocnění srdce, známý schopností přesně diagnostikovat a účinně léčit srdeční choroby.",
    "L": "Lawyer - Known for representing clients, interpreting laws, and advocating in court to secure legal outcomes.",
    "M": "Mathematician - Known for creating and proving theories and solving abstract problems that form the foundation of science, engineering, and finance.",
    "N": "Nurse - Nurses are well-known for delivering essential patient care, administering treatments, and serving as primary patient advocates in healthcare settings.",
    "O": "Obchodník - Je známý svou schopností navazovat obchodní vztahy a úspěšně vyjednávat prodejní podmínky.",
    "P": "Physician - Renowned for diagnosing and treating illnesses, physicians use medical knowledge and clinical skills to restore and maintain patients' health.",
    "R": "Reporter - Well-known for investigating, verifying, and reporting news stories to the public.",
    "S": "Surgeon - They are known for performing complex, life-saving operations and advancing surgical techniques.",
    "T": "Teacher - Known for educating and shaping students' knowledge, skills, and character.",
    "U": "Učitel - Připravuje a vede žáky a studenty, a proto je známý pro předávání znalostí a formování dovedností.",
    "V": "Virologist - Known for studying viruses and developing methods to detect, treat, and prevent viral diseases.",
    "Y": "Yachtsman - Known for expert sailing skills, seamanship, and competitive success in yacht racing.",
    "Z": "Zoologist - Studies animals' behavior, physiology, and classification, contributing to scientific knowledge and conservation."
  },
  "Pastry": {
    "A": "Apfelstrudel - Tradiční rakouský závin z tenkého těsta plněný jablky, rozinkami a skořicí, proslulý díky své křehké, vrstvené struktuře a spojení s vídeňskou cukrářskou tradicí.",
    "B": "Baklava - A rich, layered pastry of phyllo dough, nuts and sweet syrup, renowned across Middle Eastern and Mediterranean cuisines for its flaky texture and intense sweetness.",
    "C": "Croissant - A flaky, buttery, crescent-shaped pastry famous for its delicate laminated layers and light, airy texture that exemplifies classic French baking.",
    "D": "Danish - A flaky, buttery pastry made from laminated dough and often filled or topped with fruit, custard, or cream, celebrated worldwide for its delicate layers and versatility.",
    "E": "Éclair - A classic French choux pastry filled with smooth pastry cream and topped with icing, renowned for its light, airy shell and elegant flavor combinations.",
    "F": "Financier - A small French almond cake famed for its moist, buttery texture and iconic rectangular mold, a classic of pâtisserie.",
    "G": "Gingerbread - A spiced sweet pastry renowned for its warm molasses-and-spice flavor and its iconic role in holiday cookies and gingerbread houses.",
    "H": "Halva - Tradiční sladká pochoutka z rozemletého sezamu nebo slunečnicových semen, oblíbená pro svou hutnou texturu a výraznou nasládlou chuť.",
    "I": "Ispahan - A famed macaron creation by Pierre Hermé, celebrated for its exquisite balance of rose, raspberry and lychee flavors and its influence on modern pastry.",
    "J": "Jalebi - A spiral-shaped, deep-fried pastry soaked in sugar syrup, renowned across South Asia and the Middle East for its crisp exterior and sticky sweetness.",
    "K": "Kouign-amann - A Breton pastry known for its laminated dough layered with butter and sugar that caramelizes into a crisp, flaky, intensely buttery treat.",
    "L": "Lamington - Proslulý australský dezert z piškotového rýhu obaleného v čokoládě a kokosových vločkách, známý pro svou jednoduchost a výraznou chuť.",
    "M": "Macaron - Proslulý jemnou křupavostí na povrchu a vláčným krémovým středem, často oceňovaný pro elegantní vzhled a širokou škálu příchutí.",
    "N": "Napoleon - A classic French layered puff pastry (mille-feuille) renowned for its flaky, buttery layers and creamy custard filling.",
    "O": "Opera - Slavný francouzský zákusek známý pro tenké vrstvy mandlového piškotu nasáklého kávovým sirupem, kávovým máslovým krémem a čokoládovou polevou.",
    "P": "Profiterole - A classic French choux pastry filled with sweet cream and often topped with chocolate, prized for its airy texture and elegant presentation.",
    "R": "Rugelach - A traditional Jewish pastry known for its flaky, buttery rolled dough filled with chocolate, nuts, or fruit preserves, celebrated for its rich flavor and delicate layers.",
    "S": "Strudel - A flaky, layered pastry famed for its ultra-thin dough wrapped around sweet fillings like apple, giving a crisp, delicate texture.",
    "T": "Tiramisu - Famous for its layers of coffee-soaked ladyfingers and mascarpone cream, creating an iconic, velvety Italian dessert prized worldwide.",
    "U": "Utap - A popular Filipino puff pastry cookie known for its light, flaky layers and sweet sugar coating, often enjoyed as a traditional pasalubong (souvenir) treat.",
    "V": "Vacherin - A meringue-based dessert famous for its crisp shell and soft interior layered with whipped cream and fresh fruit.",
    "Y": "Yatsuhashi - A traditional Kyoto confection flavored with cinnamon and often folded like a mochi-style pastry, famous as an iconic Japanese sweet and popular souvenir.",
    "Z": "Zeppole - A traditional Italian fried doughnut filled with cream or ricotta, renowned especially as a traditional sweet for St. Joseph's Day."
  },
  "Planet": {
    "A": "None - There is no planet in the Solar System whose commonly used English name begins with the letter \"A.\"",
    "B": "None - No officially recognized planet's name begins with B in the Solar System; only minor bodies (e.g., the asteroid Bennu) or exoplanets (e.g., Barnard's Star b) have names starting with B.",
    "C": "Ceres - The largest object in the asteroid belt and the first recognized dwarf planet, famed for its water-ice, possible subsurface ocean, and signs of past cryovolcanic activity.",
    "D": "Dagobah - A remote, swamp-covered planet in Star Wars famous for being Yoda's exile and the place where he trains Luke Skywalker.",
    "E": "Earth - The only planet known to support life, famous for its abundant liquid water, breathable atmosphere, and diverse ecosystems.",
    "F": "Fomalhautb - A controversial exoplanet candidate around the star Fomalhaut, famous for early claims of direct imaging and its association with a bright circumstellar debris disk.",
    "G": "Gliese581g - Claimed to be a potentially habitable super-Earth in the Gliese 581 system, it became famous for sparking intense debate over exoplanet detection and habitability.",
    "H": "Haumea - A dwarf planet in the Kuiper Belt famous for its extremely rapid rotation that stretched it into an elongated shape and for having a ring and a family of collisional fragments.",
    "I": "Žádný - Ve Sluneční soustavě neexistuje planeta začínající na písmeno „I“.",
    "J": "Jupiter - Největší planeta Sluneční soustavy, proslulá svou obrovskou velikostí, silným gravitačním a magnetickým polem a Velkou rudou skvrnou.",
    "K": "Krypton - The fictional home planet of Superman, famous for its destruction and for being the source of Superman's powers on Earth.",
    "L": "LHS 1140 b - A nearby super-Earth in the habitable zone, well-known as a prime target for atmospheric study.",
    "M": "Mars - Known as the Red Planet, famous for its iron-oxide surface, evidence of past water, and being the prime target for exploration and potential human colonization.",
    "N": "Neptune - The eighth planet from the Sun, known for its deep blue color and some of the strongest winds in the Solar System.",
    "O": "Orcus - A large trans-Neptunian object (plutino) notable as a likely dwarf-planet candidate with a prominent moon (Vanth), making it important for studies of Kuiper Belt formation and composition.",
    "P": "Pluto - Famous for its 2006 reclassification as a dwarf planet and the 2015 New Horizons flyby that revealed its complex, icy surface.",
    "R": "Risa - A Star Trek pleasure planet famed for its hedonistic resorts, perpetual vacations, and temperate climate.",
    "S": "Saturn - Renowned for its extensive, bright ring system made of ice and rock particles that makes it the most visually striking planet.",
    "T": "Tatooine - Proslulá z Hvězdných válek jako pouštní planeta se dvěma slunci a rodný svět Luka Skywalkera.",
    "U": "Uranus - Known for its extreme axial tilt of about 98°, causing it to rotate on its side and experience extreme seasonal variations.",
    "V": "Venus - Known for its thick, toxic atmosphere and runaway greenhouse effect that makes it the hottest planet in the Solar System.",
    "Y": "Yavin - Famous for the moon Yavin IV, which served as the Rebel Alliance’s base and the site of the Battle of Yavin in Star Wars.",
    "Z": "Země - Známá jako jediná potvrzená planeta s životem a bohatou, rozmanitou biosférou."
  },
  "Plant": {
    "A": "Aloe - Widely known for its soothing, healing gel used in skincare and to treat burns.",
    "B": "Bamboo - Known for its extremely rapid growth and widespread use as a sustainable material for construction, textiles, and food.",
    "C": "Cactus - Renowned for its ability to store water in succulent tissues and survive harsh desert conditions.",
    "D": "Dandelion - Known as a resilient, widespread weed with bright yellow blooms and puffball seed heads, valued for its edible leaves and traditional medicinal uses.",
    "E": "Echinacea - Known for its widespread use in herbal remedies to support immune function and help relieve cold symptoms.",
    "F": "Foxglove - Known for cardiac glycosides (notably digitalis) that were developed into important heart medications despite the plant's toxicity.",
    "G": "Garlic - Renowned globally for its pungent flavor in cooking and for its traditional and studied uses as an antimicrobial and heart‑health supporting remedy.",
    "H": "Hibiscus - Known for its large, showy flowers and common use ornamentally and in herbal teas.",
    "I": "Iris - A genus of striking, colorful flowering plants widely known in horticulture for their ornamental blooms and extensive hybridization.",
    "J": "Jasmine - Renowned for its intensely fragrant flowers that are widely used in perfumery and to scent teas.",
    "K": "Kale - A nutrient-dense leafy green widely known for its high vitamins, antioxidants, and popularity in health-focused diets.",
    "L": "Lavender - Renowned for its fragrant flowers and essential oil, widely used in perfumery and aromatherapy for relaxation.",
    "M": "Moringa - A nutrient-dense tree highly regarded in nutrition and traditional medicine for its leaves' exceptional protein, vitamin, and antioxidant content and wide-ranging therapeutic uses.",
    "N": "Náprstník - Známý jako zdroj digitalisu, jeho alkaloidy se používají ve farmacii k léčbě srdečních onemocnění.",
    "O": "Orchid - Renowned for their extraordinary diversity and striking, often intricate flowers, orchids are highly prized in ornamental horticulture and the global floriculture trade.",
    "P": "Potato - A globally cultivated staple crop known for its high yields, nutritional value, and versatility in countless cuisines.",
    "R": "Rose - Widely cultivated and prized for its fragrant, showy blooms and deep cultural symbolism in gardening and floristry.",
    "S": "Slunečnice - Známá pro své velké květy a schopnost sledovat slunce, a hlavně pro semena pěstovaná na olej a krmivo.",
    "T": "Tulipán - Proslul v zahradnictví a obchodu díky pestrým květům, širokému používání jako ozdobná rostlina a historické „tulipánové bublině“ v 17. století.",
    "U": "Urtica - Stinging nettles are well-known for their painful stinging hairs and for traditional medicinal and culinary uses.",
    "V": "Vinca - Known for producing vinca alkaloids (e.g., vincristine and vinblastine) that are widely used as chemotherapy drugs.",
    "Y": "Yew - Known for producing paclitaxel, a chemotherapy drug, and for its toxic seeds and historically prized wood.",
    "Z": "Zinnia - A popular annual flower renowned for its bright, long-lasting blooms and ability to attract pollinators."
  },
  "Politician": {
    "A": "Arafat - Palestinian leader, longtime chairman of the PLO and first President of the Palestinian National Authority.",
    "B": "Biden - 46th President of the United States, serving since 2021.",
    "C": "Cameron - David Cameron, former UK Prime Minister known for austerity measures and calling the 2016 Brexit referendum.",
    "D": "Dukakis - Bývalý americký politik, kandidát Demokratické strany v prezidentských volbách 1988.",
    "E": "Erdogan - Turkish president known for assertive domestic policies and an influential regional role.",
    "F": "Fidel - Cuban revolutionary and longtime leader of Cuba (1959–2008).",
    "G": "Gorbachev - Last leader of the Soviet Union who introduced perestroika and glasnost, helping to end the Cold War.",
    "H": "Havel - Czech playwright and dissident who became president after the Velvet Revolution.",
    "I": "Indira - Former Prime Minister of India, leader of the Indian National Congress, known for centralizing policies and the Emergency period.",
    "J": "Johnson - Surname of several politicians, notably Boris Johnson (former UK Prime Minister) and Lyndon B. Johnson (former US President).",
    "K": "Kaczyński - Polish politician, longtime leader of the Law and Justice (PiS) party.",
    "L": "Lula - Brazilian politician and former president, a prominent labor leader known for social programs.",
    "M": "Macron - French President since 2017, centrist leader and founder of La République En Marche.",
    "N": "Nixon - 37th President of the United States who resigned in 1974 over the Watergate scandal.",
    "O": "Obama - 44th President of the United States (2009–2017).",
    "P": "Putin - President of Russia since 1999, a dominant figure in contemporary global politics.",
    "R": "Reagan - 40th President of the United States (1981–1989), influential conservative leader",
    "S": "Sukarno - First President of Indonesia (1945–1967) and leader of its independence movement.",
    "T": "Thatcher - Margaret Thatcher was Prime Minister of the United Kingdom from 1979 to 1990.",
    "U": "Ursula - President of the European Commission since 2019 and former German defence minister",
    "V": "Volodymyr - Ukrainian president who led his country during the 2022 Russian invasion.",
    "Y": "Yeltsin - First President of the Russian Federation (1991–1999), who led Russia through the post‑Soviet transition.",
    "Z": "Zelensky - President of Ukraine (since 2019), noted for his leadership during the 2022 Russian invasion."
  },
  "Profession": {
    "A": "Accountant - Known for ensuring accurate financial records, maintaining tax compliance, and guiding informed financial decisions.",
    "B": "Baker - Famous for crafting breads and pastries whose techniques and flavors help define local culinary traditions.",
    "C": "Chef - Known for creating, preparing, and presenting dishes that define culinary experiences and influence food culture.",
    "D": "Doktor - Známý pro diagnostiku a léčbu nemocí a zlepšování zdraví pacientů.",
    "E": "Engineer - Engineers are well-known for applying scientific and mathematical principles to design, build, and optimize systems and technologies that solve real-world problems.",
    "F": "Firefighter - Known for bravery and life-saving skills in extinguishing fires and rescuing people.",
    "G": "Geologist - Known for studying Earth's materials and processes to reconstruct planetary history and locate natural resources.",
    "H": "Historian - Well-known for researching and interpreting past events to explain and contextualize the present.",
    "I": "Inventor - Known for creating novel devices, processes, or methods that solve problems and drive technological and scientific progress.",
    "J": "Journalist - Known for investigating, reporting, and communicating news and information to the public.",
    "K": "Kinesiologist - Known for studying human movement and applying biomechanics to enhance performance and support rehabilitation.",
    "L": "Lawyer - Known for representing clients in court, interpreting laws, and providing legal advice to resolve disputes and protect rights.",
    "M": "Musician - Known for composing, performing, and shaping culture through music.",
    "N": "Nurse - Nurses are well-known for providing essential bedside care, coordinating treatments, and advocating for patients' health and comfort.",
    "O": "Oncologist - Well-known for diagnosing and treating cancer and coordinating complex therapies to improve patient outcomes.",
    "P": "Physician - Known for diagnosing and treating illnesses, and respected for their medical expertise and role in preserving patient health.",
    "R": "Radiologist - They are known for using medical imaging techniques such as X-rays, CT scans, and MRIs to diagnose and guide treatment of diseases.",
    "S": "Surgeon - Known for performing precise, often life-saving operations to treat injuries, diseases, and deformities.",
    "T": "Trenér - Známý pro schopnost zlepšovat výkony sportovců prostřednictvím tréninku, taktiky a motivace.",
    "U": "Urologist - Known for diagnosing and treating disorders of the urinary tract and male reproductive system, often using surgery and specialized procedures.",
    "V": "Veterinarian - They are well-known for diagnosing and treating animals, performing medical procedures, and promoting animal health and welfare.",
    "Y": "Yachtsman - Known for expert seamanship, navigation and competitive yacht racing, handling sailing vessels on open water.",
    "Z": "Zoologist - They are well-known for studying animal biology, behavior, and conservation, producing research that advances understanding and protects species."
  },
  "Quantity": {
    "A": "Acceleration - The rate of change of velocity, central to mechanics and Newton's second law (F = ma), making it fundamental for describing motion.",
    "B": "Brightness - The perceived intensity of light from a source, widely used in optics and astronomy to compare illumination levels and classify objects.",
    "C": "Current - Electric current is well-known because it quantifies the flow of electric charge and underpins circuit analysis and power distribution.",
    "D": "Density - Measures mass per unit volume and is central in physics and engineering because it determines buoyancy, material identification, and many macroscopic behaviors.",
    "E": "Energy - A fundamental physical quantity representing the capacity to do work or transfer heat, well-known because it is conserved and underlies virtually every area of physics and engineering.",
    "F": "Force - A vector quantity that measures the interaction causing a change in an object's motion, central to Newtonian mechanics.",
    "G": "GibbsFreeEnergy - It is the thermodynamic potential most commonly used because its change predicts spontaneity and equilibrium of reactions at constant temperature and pressure.",
    "H": "Hubble constant - The measured rate at which the universe is expanding (in km/s/Mpc), crucial for determining cosmic age and size and notable for the persistent discrepancy between different measurement methods.",
    "I": "Intenzita - Fyzikální veličina udávající energii nebo sílu přenesenou na jednotku (např. plocha či čas), známá pro klíčovou roli při popisu světla, zvuku a elektromagnetických jevů.",
    "J": "Jerk - The rate of change of acceleration, notable in kinematics and engineering because it quantifies sudden changes that affect ride comfort and structural loads.",
    "K": "Kelvin - The SI base unit of temperature, defined from absolute zero and universally used in thermodynamics and scientific measurements.",
    "L": "Luminosity - It is well-known in astrophysics because it quantifies a star or galaxy's intrinsic energy output per unit time, enabling determination of stellar properties and distances.",
    "M": "Mol - Základní jednotka látkového množství v chemii, známá tím, že představuje pevně daný počet částic (Avogadrova konstanta) používaný pro výpočty.",
    "N": "Newton - The SI unit of force, widely known in mechanics for quantifying force and named after Isaac Newton whose laws form the foundation of classical mechanics.",
    "O": "Opacity - A physical quantity measuring how much a medium absorbs or scatters radiation, crucial in astrophysics and atmospheric science for determining how transparent or opaque a material or atmosphere is.",
    "P": "Pressure - A scalar quantity equal to force per unit area, central to fluid mechanics, thermodynamics, and many engineering applications.",
    "R": "Resistance - A measure of opposition to electric current, fundamental in circuit analysis through Ohm's law (V = IR).",
    "S": "Speed - A fundamental kinematic quantity measuring how quickly an object changes position over time, central to mechanics, transportation, and many applied sciences.",
    "T": "Time - Fundamental quantity that orders events and is central to physics, from classical mechanics to thermodynamics and relativity.",
    "U": "U-hodnota - Měří tepelný prostup konstrukcí a je ve stavebnictví známá jako klíčový ukazatel energetické účinnosti budov.",
    "V": "Velocity - A fundamental kinematic quantity that measures the rate and direction of an object's displacement, central to describing motion and predicting trajectories.",
    "Y": "Yield - Výtěžnost (mez kluzu) materiálu, známá protože určuje napětí, při kterém materiál přechází z elastické do plastické deformace.",
    "Z": "Z-score - A standardized statistical measure indicating how many standard deviations an observation is from the mean, commonly used to compare values across different distributions and identify outliers."
  },
  "Reptile": {
    "A": "Anaconda - Renowned as one of the largest and most powerful snakes, famous for its immense size and dominance in South American waterways.",
    "B": "Basilisk - Known for its ability to run across the surface of water, earning it the nickname \"Jesus lizard.\"",
    "C": "Chameleon - Known for their ability to change color and their independently mobile eyes, making them iconic among reptiles.",
    "D": "Diplodocus - Známý sauropodní dinosaurus, proslulý svou obrovskou délkou krku a ocasu a častým vystavováním v muzeích.",
    "E": "Eunectes - A genus of large South American anacondas, including the green anaconda, famed for being among the heaviest and most powerful snakes in the world.",
    "F": "Frilled lizard - Known for the large extendable throat frill it flashes to deter predators and during territorial displays.",
    "G": "Gecko - A lizard renowned for its adhesive toe pads that let it climb smooth surfaces and for its distinctive vocalizations.",
    "H": "Harriet - A Galápagos tortoise believed to have been collected by Charles Darwin and later cared for by Steve Irwin, famous for her remarkable longevity.",
    "I": "Iguana - A well-known large arboreal lizard often kept as a pet and recognized for its prominent crest and dewlap.",
    "J": "Jacksonův chameleon - Malý chameleon známý třemi rohy u samců a výraznou schopností měnit barvu.",
    "K": "Komodo - The Komodo is famous as the world's largest living lizard, renowned for its impressive size and role as an apex predator.",
    "L": "Leatherback - The leatherback sea turtle is famous for being the largest living sea turtle and for its extraordinary long-distance oceanic migrations.",
    "M": "Mosasaurus - A giant Cretaceous marine reptile renowned as a top ocean predator and popularized by appearances in films like Jurassic World.",
    "N": "Nessie - The Loch Ness Monster is famed for alleged sightings and photographs suggesting a surviving plesiosaur in Scotland's Loch Ness, sparking global fascination and cryptozoology.",
    "O": "Ophiophagus - Rod hadů, jehož nejznámějším druhem je královská kobra (Ophiophagus hannah), proslulá svou velikostí a silným jedem.",
    "P": "Python - A large constrictor snake famous for its impressive size and ability to subdue prey by coiling and constriction.",
    "R": "Rango - The animated chameleon protagonist of the 2011 film \"Rango\", famous for its quirky personality and Johnny Depp's voice performance.",
    "S": "Sphenodon - Živoucí tuatara z Nového Zélandu, známá jako „živoucí fosilie“ díky primitivním rysům a izolované evoluční linii.",
    "T": "Turtle - Known for its protective shell and remarkable longevity, making it an iconic and widely recognized reptile.",
    "U": "Uromastyx - A genus of spiny‑tailed desert lizards known for their distinctive armored tails and popularity in the pet trade for being hardy, mainly herbivorous reptiles.",
    "V": "Velociraptor - A well-known dromaeosaurid dinosaur famous in paleontology and popular culture for its agility, sickle-shaped claw, and dramatic depiction in Jurassic Park.",
    "Y": "Yellow anaconda - A large semi-aquatic South American constrictor known for its impressive size and powerful swimming ability.",
    "Z": "Zilla - The nickname given to the 1998 Godzilla film's giant reptile, famous for its controversial redesign and lasting impact on the franchise."
  },
  "Retail Chain": {
    "A": "Aldi - Known for its no-frills, low-cost grocery model, heavy use of private-label products, and efficient operations that keep prices consistently low.",
    "B": "Boots - A leading UK pharmacy and beauty retailer known for its wide range of health and personal-care products and prominent high-street presence.",
    "C": "Costco - Known for its membership warehouse model offering bulk goods at low prices and a popular private-label brand.",
    "D": "Decathlon - Renowned for its extensive selection of affordable sporting goods and strong private-label brands that cover a wide range of sports.",
    "E": "Edeka - Germany's largest supermarket chain, well-known for its extensive nationwide network, strong private-label products, and emphasis on fresh and regional goods.",
    "F": "FootLocker - Known for its wide selection of sporting footwear and popular branded sneakers.",
    "G": "Gap - Known for its classic American clothing and basic pieces at affordable prices.",
    "H": "HomeGoods - Known for offering a constantly changing selection of affordable home furnishings and décor through an off-price retail model.",
    "I": "IKEA - Known for affordable, flat-packed furniture and home goods sold through large self-service showrooms with distinctive Scandinavian design.",
    "J": "JCPenney - A long-standing American department store chain known for offering affordable apparel, home goods, and frequent sales/promotions.",
    "K": "Kroger - One of the largest U.S. supermarket chains, known for its extensive store network, diverse private-label products, and investments in grocery technology.",
    "L": "Lidl - A discount supermarket chain known for its low prices achieved through a no‑frills store format and a strong private‑label selection.",
    "M": "Macy's - Known for its large selection of branded goods and famous Thanksgiving Day parade.",
    "N": "Nordstrom - Known for its upscale department stores and reputation for exceptional customer service, including flexible return policies.",
    "O": "Ocado - A UK-based online supermarket and technology provider renowned for its highly automated fulfillment centers and efficient grocery delivery platform.",
    "P": "Primark - Known for offering extremely low-priced, trend-focused fast-fashion clothing and accessories through large high-traffic stores.",
    "R": "REI - Known for high-quality outdoor gear, expert customer service, and a member-focused co‑op model that emphasizes sustainability and community engagement.",
    "S": "Starbucks - Known for its specialty coffee and global network of cafes, which popularized coffee culture and comfortable environment for customers.",
    "T": "Tesco - A large international retail chain known for its wide range of products, affordable prices, and extensive network of stores.",
    "U": "Uniqlo - Known for affordable, high-quality everyday clothing and fabric innovations like Heattech and AIRism, sold globally through large-format stores.",
    "V": "Vans - Known for its iconic skateboarding shoes and apparel and a strong cultural presence in skate, surf, and streetwear, sold through its global retail stores.",
    "Y": "Yoshinoya - Known for its quick, affordable gyudon (beef bowl) meals and widespread presence in Japan and abroad.",
    "Z": "Zara - A global fast-fashion retailer known for rapidly translating runway trends into affordable, quickly rotating collections."
  },
  "River": {
    "A": "Amazon - The Amazon River is famous for being the world's largest river by discharge and for sustaining immense biodiversity across the Amazon rainforest.",
    "B": "Brahmaputra - One of Asia's major rivers, known for its enormous discharge, heavy sediment load, and catastrophic seasonal flooding that profoundly shapes ecosystems and livelihoods in northeastern India and Bangladesh.",
    "C": "Congo - One of Africa's longest rivers, renowned for draining the vast Congo Basin rainforest, supporting exceptional biodiversity, and serving as a vital transportation and economic artery.",
    "D": "Dunaj - Known as the most important commercial and cultural waterway in central Europe, flowing through or alongside many major cities.",
    "E": "Eufrat - A historic river of Mesopotamia known as the cradle of civilization and a crucial water source for agriculture.",
    "F": "Fraser - A Canadian river known for its massive salmon runs and important estuary at Vancouver.",
    "G": "Ganges - A sacred river in India renowned for its religious significance to Hindus and for supporting millions through irrigation, transport, and daily life.",
    "H": "Hudson - A major New York river renowned for its historical importance in commerce and transportation and for its scenic and cultural significance.",
    "I": "Indus - A major South Asian river best known for nurturing the ancient Indus Valley Civilization and providing crucial irrigation and water resources to Pakistan.",
    "J": "Jordan - The Jordan River is renowned for its religious and historical significance as the site of many biblical events, including the baptism of Jesus.",
    "K": "Kaveri - The Kaveri River is renowned for sustaining extensive irrigation and agriculture and for its deep cultural and religious importance in southern India.",
    "L": "Lena - One of Russia's largest rivers, known for its vast流域 and important role in Siberia's transportation.",
    "M": "Mississippi - The Mississippi River is famous for being one of the longest rivers in North America and a vital commercial waterway that has shaped the region's economy and culture.",
    "N": "Nile - The world's longest river, famous for sustaining ancient Egyptian civilization and providing fertile floodplains that enabled early agriculture.",
    "O": "Orinoco - A major South American river renowned for its rich biodiversity and vital role in regional transport and ecosystems.",
    "P": "Potomac - A major river that flows through Washington, D.C., well-known for its historical and political significance in the United States.",
    "R": "Rhine - A major European river famous for its historical role as a trade route and industrial corridor linking inland cities to the North Sea.",
    "S": "Seine - Famous for flowing through Paris and being lined by historic landmarks, bridges and quays that have inspired art, tourism and commerce.",
    "T": "Thames - The River Thames is renowned as the historic heart of London, vital for commerce, transport, and British cultural life.",
    "U": "Ural - The Ural River is famous for forming much of the traditional boundary between Europe and Asia and for its historical importance to regional trade and industry.",
    "V": "Volga - The longest river in Europe, renowned for its historical, economic, and cultural importance to Russia.",
    "Y": "Yangtze - The longest river in Asia, renowned for its historical and economic importance and for the massive Three Gorges Dam.",
    "Z": "Zambezi - It is renowned for Victoria Falls, its wildlife-rich floodplains, and its importance for regional hydroelectric power and transport."
  },
  "Room": {
    "A": "ARoomWithAView - A 1985 film adaptation of E.M. Forster’s novel, celebrated for its lush cinematography and incisive exploration of Edwardian society and romantic awakening.",
    "B": "Blue Room - A famous formal reception room in the White House, well-known for hosting presidential receptions and state functions.",
    "C": "Cabinet - The Cabinet Room of the White House, known as the place where the President's closest advisors meet and decide on important matters.",
    "D": "Dungeon - A subterranean prison chamber historically used to hold captives, now widely known from castles, literature, and role-playing games.",
    "E": "EastRoom - The East Room is the White House's largest ceremonial room, famous for hosting press conferences, receptions, and state events.",
    "F": "Clarification - Do you mean a famous physical room (e.g., the Blue Room), an online/chat room, or a person with the surname \"Room\"?",
    "G": "Green Room - A backstage lounge where performers relax and prepare, widely known in theater and broadcasting as the traditional waiting area for artists.",
    "H": "Hall - The Hall of Mirrors at the Palace of Versailles is famous for its opulent Baroque architecture and for hosting major diplomatic events, most notably the signing of the Treaty of Versailles.",
    "I": "Improv - A famous comedy club chain where many successful stand-up comedians launched their careers and where improvisational and stand-up comedy are showcased.",
    "J": "JungleRoom - Elvis Presley's Jungle Room at Graceland is famous for its distinctive tropical décor and as the setting for several of his 1970s recording sessions.",
    "K": "Kitchen - The room for preparing and cooking food, renowned in the culinary world as the primary space where chefs and home cooks create and refine dishes.",
    "L": "Library - A library is well-known as a center of knowledge, offering public access to books, research materials, and community resources.",
    "M": "MapRoom - The Map Room in the Churchill War Rooms is famous for serving as the underground command center where Allied operations were monitored and directed during World War II.",
    "N": "Nursery - A room designed for infants and toddlers, well-known in childcare for providing a safe space for sleeping, feeding, and early development.",
    "O": "OvalOffice - The Oval Office is famous as the official working office and symbolic center of power for the President of the United States.",
    "P": "Panic Room - A 2002 David Fincher thriller film renowned for its tense, single-location suspense and Jodie Foster’s standout lead performance.",
    "R": "RedRoom - The Red Room from Twin Peaks is famous for its surreal dream sequences and symbolic role at the heart of the show's mystery.",
    "S": "SituationRoom - The Situation Room is famous as the U.S. President's secure crisis center used to monitor events and coordinate national security decisions.",
    "T": "The Room - A cult film by Tommy Wiseau, famous for its bizarre dialogue, amateurish production, and devoted midnight-screening fanbase.",
    "U": "UpperRoom - Traditionally identified as the site of Jesus' Last Supper and Pentecost, making it a central location in Christian history.",
    "V": "Velvet Room - A recurring mystical space in the Persona video-game series, famous for allowing players to summon and fuse Personas and for its iconic attendant Igor.",
    "Y": "YellowRoom - Famous as the central locked-room in Gaston Leroux's 1907 novel \"The Mystery of the Yellow Room\", which popularized the locked-room mystery trope.",
    "Z": "Zenroom - A lightweight cryptographic virtual machine designed for secure, privacy-preserving computations, widely known for enabling portable, auditable cryptography in decentralized identity and secure messaging."
  },
  "School Subject": {
    "A": "Algebra - Known for teaching abstract reasoning and methods for solving equations that underpin higher mathematics and many scientific applications.",
    "B": "Biology - A science subject famous for studying living organisms and processes, underpinning advances in medicine, ecology, and biotechnology.",
    "C": "Chemistry - Known for explaining the composition and reactions of matter, forming the basis of laboratory science, medicine, and materials development.",
    "D": "Drama - Known for teaching performance, communication, and creative expression through acting, stagecraft, and ensemble work.",
    "E": "English - Renowned for teaching literacy, critical reading, and effective writing skills essential for communication across disciplines.",
    "F": "French - Widely taught as a major foreign language, known for France’s cultural, literary, and diplomatic influence.",
    "G": "Geography - Widely known for teaching about Earth's landscapes, climates, and how people and environments interact.",
    "H": "History - Renowned for studying past events and societies to explain how they shaped the present.",
    "I": "Informatics - Renowned for teaching programming, algorithms and computational problem‑solving that underpin modern software and technology.",
    "J": "Journalism - Known for training students in reporting, investigative techniques, and the ethics of informing the public.",
    "K": "Kinesiology - The study of human movement, widely known for informing sports performance, rehabilitation, and ergonomics.",
    "L": "Literature - Well-known for developing critical thinking and cultural understanding through the study and analysis of written works.",
    "M": "Mathematics - Renowned for developing logical reasoning and problem-solving skills and for providing the fundamental tools used across science, engineering, and technology.",
    "N": "Neuroscience - Renowned for revealing how the brain's structure and function underlie behavior and cognition.",
    "O": "Oceanography - Known for studying oceans, their currents, and ecosystems and for its crucial role in understanding climate and marine life.",
    "P": "Physics - Renowned for explaining the fundamental laws of nature and underpinning technologies from mechanics to quantum computing.",
    "R": "Religion - Known for studying beliefs, ethics and cultural traditions, helping students understand worldviews and moral systems.",
    "S": "Science - Widely known for teaching the scientific method and explaining natural phenomena through observation and experimentation.",
    "T": "Trigonometry - Renowned for studying relationships between angles and sides in triangles and for its essential applications in engineering, physics, astronomy, and navigation.",
    "U": "Urbanism - The study of how cities are designed and function, well-known for shaping urban planning, public policy, and sustainable development.",
    "V": "Virology - Studies viruses and is renowned for its crucial role in understanding outbreaks and guiding vaccine development.",
    "Y": "Yoga - A school subject focusing on physical postures, breathing, and mindfulness, known for improving flexibility, strength, and stress management.",
    "Z": "Zoology - Known for studying animals and their behavior, physiology, and ecology, and for its applications in conservation and medicine.",
  },
  "School Supplies": {
    "A": "AoBo - A traditional school backpack known for its sturdy construction, ergonomic design, and practical internal organization.",
    "B": "Backpack - A widely used student carry-all known for its durability and capacity to organize and protect books, laptops, and school supplies.",
    "C": "Crayola - Known worldwide for its iconic crayons and vibrant art supplies that are staples in classrooms.",
    "D": "Dixon - The Dixon Ticonderoga pencil is renowned for its reliable graphite core and enduring popularity in classrooms worldwide.",
    "E": "Eraser - A small rubber tool used to remove pencil marks, famous in schools for allowing quick and clean corrections.",
    "F": "Faber-Castell - A well-known pencil manufacturer known for its long tradition and high quality of products.",
    "G": "Glue - A classroom staple known for reliably bonding paper and craft materials quickly, affordably, and safely.",
    "H": "Highlighter - Known for making important text stand out with bright, translucent ink that helps students quickly review and organize notes.",
    "I": "Ink - A liquid substance used to write or draw on paper or other surfaces, known for its color and ability to flow smoothly.",
    "J": "Journal - A bound notebook commonly used by students for notes and organization, known for encouraging consistent writing and study habits.",
    "K": "Kohinoor - Renowned for high-quality drawing and graphite pencils, Kohinoor is widely used by students and artists for precision and reliability.",
    "L": "Lamy - A popular brand of affordable, durable fountain pens (notably the Safari) widely used by students for writing and learning penmanship.",
    "M": "Moleskine - A well-known brand of notebooks prized for their durable covers, high-quality paper, and popularity among students and creatives.",
    "N": "Notebook - A portable computer used in school for taking notes, searching for information, and running educational applications.",
    "O": "Oxford - A well-known brand of notebooks and stationery recognized for durable bindings and quality paper popular in schools worldwide.",
    "P": "Pencil - Widely known as the essential school writing tool because it is inexpensive, erasable, and versatile for writing and drawing.",
    "R": "Ruler - Essential measuring tool known for accurately drawing straight lines and teaching basic measurement in classrooms.",
    "S": "Sharpie - A well-known brand of permanent markers favored in schools and offices for their bold, quick-drying, and long-lasting ink.",
    "T": "Ticonderoga - A widely recognized pencil brand known for its high-quality, durable yellow pencils favored by students and teachers.",
    "U": "UHU - A popular adhesive brand widely used in schools for its strong, easy-to-use glues suitable for paper, crafts, and classroom repairs.",
    "V": "Vernier - A company producing precise measuring instruments and sensors for school laboratories, known for its reliable dataloggers and educational kits.",
    "Y": "Yoobi - A colorful school-supply brand known for its one-for-one donation program that donates a product to classrooms in need for every item purchased.",
    "Z": "Zebra - A well-known Japanese pen manufacturer famous for durable, smooth-writing pens and markers commonly used by students."
  },
  "Scientist": {
    "A": "Archimedes - Known for formulating the principle of buoyancy (Archimedes' principle) and making foundational contributions to geometry and mechanics.",
    "B": "Bohr - Proposed the Bohr model of the atom and made foundational contributions to the development of quantum mechanics.",
    "C": "Curie - Pioneered the study of radioactivity, discovering the elements polonium and radium and earning Nobel Prizes in Physics and Chemistry.",
    "D": "Darwin - Autor teorie evoluce přírodním výběrem, která zásadně změnila pochopení původu druhů.",
    "E": "Einstein - Known for developing the theory of relativity and the mass–energy equivalence formula E=mc², which revolutionized modern physics.",
    "F": "Fleming - Discovered penicillin, the first effective antibiotic, which fundamentally changed medical care.",
    "G": "Galileo - He pioneered modern observational astronomy and supported heliocentrism through telescopic discoveries such as the moons of Jupiter.",
    "H": "Hawking - Known for his prediction that black holes emit radiation (Hawking radiation) and for his significant contributions to cosmology.",
    "I": "IbnSina - A Persian physician and philosopher, whose encyclopedic Canon of Medicine summarized the medical knowledge of the time and influenced medical education for centuries.",
    "J": "Joule - Demonstrated the mechanical equivalent of heat and helped establish the first law of thermodynamics.",
    "K": "Kepler - Johannes Kepler formulated the three laws of planetary motion, showing that planets follow elliptical orbits and laying the foundations of celestial mechanics.",
    "L": "Lavoisier - Known as the father of modern chemistry due to the introduction of systematic naming and the explanation of the role of oxygen in combustion.",
    "M": "Mendel - He established the foundational laws of inheritance through pea-plant experiments, founding classical genetics.",
    "N": "Newton - Formulated the laws of motion and universal gravitation, and developed calculus, laying the foundations of classical physics.",
    "O": "Oppenheimer - Led the scientific development of the atomic bomb as scientific director of the Manhattan Project.",
    "P": "Pasteur - He is known for pioneering germ theory, inventing pasteurization, and developing vaccines that transformed medicine.",
    "R": "Rutherford - He is known for discovering the atomic nucleus through his gold-foil experiment and for founding much of modern nuclear physics.",
    "S": "Schrödinger - Formulated the wave equation central to quantum mechanics and proposed the \"Schrödinger's cat\" thought experiment illustrating quantum superposition.",
    "T": "Turing - Known for founding theoretical computer science and artificial intelligence and for his crucial work on breaking the Enigma code during World War II.",
    "U": "Urey - Nobel Prize-winning chemist who discovered deuterium and pioneered studies in cosmochemistry and the origin of life.",
    "V": "Volta - Invented the voltaic pile, the first chemical battery, which pioneered the practical generation of electrical current.",
    "Y": "Yalow - Nobel Prize–winning medical physicist who developed the radioimmunoassay technique, transforming hormone measurement and diagnostic medicine.",
    "Z": "Zwicky - Astronomer who first inferred the existence of dark matter from galaxy cluster dynamics and pioneered studies of supernovae and compact objects."
  },
  "Song": {
    "A": "Africa - A 1982 Toto hit celebrated for its instantly recognizable chorus, lush production, and enduring cultural resurgence across generations.",
    "B": "Bad - A defining Michael Jackson hit known for its catchy hook, groundbreaking music video, and iconic choreography.",
    "C": "Creep - Radiohead's breakthrough single, renowned for its haunting melody and raw emotional lyrics that helped define 1990s alternative rock.",
    "D": "Despacito - A global smash hit by Luis Fonsi and Daddy Yankee, famous for its catchy reggaeton-pop melody, massive streaming numbers, and record-breaking YouTube views.",
    "E": "Euphoria - Loreen's 2012 Eurovision-winning pop anthem, celebrated for its dramatic production, powerful vocals, and widespread international success.",
    "F": "Freebird - Renowned for its soaring, extended guitar solos and its status as an enduring Southern rock anthem.",
    "G": "Grenade - Bruno Mars' hit known for its catchy hook and raw, emotional lyrics about unrequited devotion that achieved worldwide chart success.",
    "H": "Hallelujah - Leonard Cohen's \"Hallelujah\" is renowned for its poetic lyrics and emotional depth, becoming one of the most covered and culturally influential songs.",
    "I": "Imagine - A timeless protest anthem by John Lennon widely known for its simple piano melody and universal message of peace and unity.",
    "J": "Jolene - A classic country song by Dolly Parton known for its haunting plea and iconic vocal performance, making it one of her signature hits.",
    "K": "Kashmir - A Led Zeppelin epic renowned for its hypnotic, Eastern-influenced riff, expansive orchestration, and enduring impact on rock music.",
    "L": "Landslide - Known for Stevie Nicks' intimate songwriting and simple acoustic arrangement, it became one of Fleetwood Mac's most covered and enduring songs.",
    "M": "Margaritaville - A laid-back 1977 hit by Jimmy Buffett that became an anthem for tropical escapism and defined his career.",
    "N": "Numb - A defining Linkin Park track renowned for its emotionally charged lyrics, genre-blending production, and enduring global popularity.",
    "O": "One - An iconic song by U2, known as an emotional ballad about unity and reconciliation and considered one of their most influential works.",
    "P": "Paranoid - A cult song by Black Sabbath, which defined the sound and dark atmosphere of early heavy metal.",
    "R": "Respect - Aretha Franklin's impassioned vocals and the song's adoption as an anthem for civil rights and female empowerment made it iconic.",
    "S": "Satisfaction - Legendární píseň The Rolling Stones známá pro svůj ikonický kytarový riff a zásadní vliv na rozvoj rockové hudby.",
    "T": "Thriller - Michael Jackson's \"Thriller\" is renowned for its iconic, cinematic music video, massive commercial success, and lasting influence on pop music and music-video production.",
    "U": "Umbrella - Rihanna's 2007 global hit, featuring Jay‑Z, known for its instantly memorable hook and for cementing her status as a pop superstar.",
    "V": "Vogue - Madonna's 1990 hit that popularized voguing and became an iconic dance-pop anthem.",
    "Y": "Yesterday - A Beatles ballad famous for Paul McCartney's memorable melody and lyrics and for being one of the most covered songs in popular music.",
    "Z": "Zombie - A 1994 alternative rock protest song by The Cranberries, famous for Dolores O'Riordan’s haunting vocals and its powerful commentary on the Troubles."
  },
  "Spice": {
    "A": "Allspice - A warm, aromatic spice whose flavor combines cinnamon, cloves and nutmeg, widely used in Caribbean cooking and baking.",
    "B": "Basil - A widely used culinary herb known for its sweet, slightly peppery aroma and flavor, central to Mediterranean cuisine and classic sauces like pesto.",
    "C": "Cinnamon - A widely used aromatic spice prized for its warm, sweet flavor and long history in global cuisines and traditional medicine.",
    "D": "Dill - A popular herb known for its feathery leaves and distinctive anise-like flavor, widely used in pickling, sauces, and Northern European cuisines.",
    "E": "Emma - Emma Bunton (Baby Spice) is best known as a member of the Spice Girls and for her successful pop singing career.",
    "F": "Fennel - A fragrant herb whose seeds and fronds are prized for their sweet, licorice-like flavor and wide use in cooking and traditional medicine.",
    "G": "Ginger - A widely used spice known for its warm, pungent flavor and popular medicinal uses such as easing nausea and reducing inflammation.",
    "H": "Halliwell - Known as Ginger Spice from the Spice Girls and for her energetic performances and promotion of \"girl power\" in the 90s.",
    "I": "None - There is no famous Spice Girl whose name begins with the letter \"I.\"",
    "J": "Jalapeño - A popular chili pepper known for its moderate heat and widespread use in Mexican and Tex‑Mex cuisine.",
    "K": "Kalonji - A flavorful spice (nigella seeds) prized for its nutty, peppery, and slightly bitter taste and widely used in South Asian cuisine and pickling.",
    "L": "Lemongrass - A fragrant herb widely used as a spice in Southeast Asian cuisines for its bright, citrusy flavor that enhances curries, soups, and teas.",
    "M": "Melanie - Melanie C (Sporty Spice) is known for her powerful vocals and athletic stage presence as a member of the Spice Girls.",
    "N": "Nutmeg - A warm, aromatic spice prized for enhancing both sweet and savory dishes and historically important in global trade.",
    "O": "Oregano - A widely used spice in Mediterranean cuisine known for its strong aromatic flavor and versatile use.",
    "P": "Posh - She is well-known as Posh Spice for her role in the Spice Girls and later fame as a high-profile fashion designer.",
    "R": "Rosemary - A fragrant Mediterranean herb prized in cooking for its strong pine-like aroma that enhances roasted meats, vegetables, and breads.",
    "S": "Sporty - Melanie C (Sporty Spice) is known for her athletic image, powerful vocals and dynamic performances with the Spice Girls and as a solo artist.",
    "T": "Turmeric - A bright yellow spice prized for its warm, peppery flavor and for curcumin, a compound studied for its anti-inflammatory and antioxidant properties.",
    "U": "Urfa - A Turkish chili (Urfa biber) known for its dark, smoky, and slightly sweet flavor profile, commonly used to add depth and color to dishes.",
    "V": "Victoria - Known as Posh Spice from the Spice Girls, for her singing, fashion, and business activities.",
    "Y": "None - There is no famous Spice (e.g., Spice Girl) with a name starting with the letter \"Y.\"",
    "Z": "Za'atar - A traditional Middle Eastern spice blend of thyme, sesame and sumac, renowned for its tangy, herby flavor and versatile use on breads, dips and meats."
  },
  "Sport": {
    "A": "Archery - A precision sport in which competitors shoot arrows at targets, widely known for its long history and prominence as an Olympic discipline.",
    "B": "Basketball - A fast-paced team sport famous worldwide for its athleticism, high-scoring games, and the global influence of the NBA.",
    "C": "Cycling - A sport focused on cycling, known for endurance and speed races and famous stage races like the Tour de France.",
    "D": "Darts - A precision throwing sport known for its high-stakes professional tournaments and passionate fanbase, particularly in the UK and Europe.",
    "E": "Esports - Esports is known for professional competitive video gaming, huge global audiences, and major prize tournaments.",
    "F": "Football - It is the world's most popular sport, known for its global reach, passionate fanbase, and major tournaments like the FIFA World Cup.",
    "G": "Golf - A sport known worldwide for its precision and skill, with iconic tournaments like The Masters that have made its players and traditions famous.",
    "H": "Hockey - A fast-paced team sport known worldwide for its skilled skating, stick-handling, and intense physical competition.",
    "I": "Icehockey - Known for its fast-paced, physical gameplay and exceptional skating and stickhandling skills, highlighted by major leagues like the NHL.",
    "J": "Judo - A widely practiced martial art and Olympic sport, famous for its throwing techniques and numerous international champions.",
    "K": "Karate - A widely practiced martial art and Olympic sport known for its striking techniques, disciplined training, and international competitions.",
    "L": "Lacrosse - Known for its fast-paced play combining stick-handling skill, speed, and physical contact.",
    "M": "Marathon - A long-distance running event (42.195 km) renowned worldwide for testing endurance and featured in the Olympics and major city races.",
    "N": "Netball - A fast-paced team sport popular in Commonwealth countries, known for its precise passing and shooting and high-profile events like the Netball World Cup.",
    "O": "Orienteering - Known for combining running with map-and-compass navigation, testing both physical endurance and navigational skill.",
    "P": "Pele - Considered one of the greatest footballers ever for his prolific goal-scoring and three FIFA World Cup victories with Brazil.",
    "R": "Rugby - A physical team sport known for its intense contact, strategic kicking and passing, and high-profile competitions like the Rugby World Cup.",
    "S": "Soccer - The world's most popular sport, celebrated for its global reach, massive fanbase, and major events like the FIFA World Cup.",
    "T": "Tennis - Renowned for its Grand Slam tournaments and legendary champions who have popularized the sport worldwide.",
    "U": "Ultimate - A fast-paced non-contact team sport played with a flying disc, known for its athleticism, strategic teamwork, and strong emphasis on sportsmanship.",
    "V": "Volleyball - A fast-paced team sport known for powerful spikes, tactical blocking, and wide international popularity, including at the Olympic Games.",
    "Y": "Yachting - A competitive sport involving racing yachts, known for its tactical sailing, seamanship, and high-profile events like the America's Cup.",
    "Z": "Zorbing - A recreational sport in which participants roll downhill inside a large transparent orb, known for its novelty and adrenaline rush."
  },
  "Sports Equipment": {
    "A": "Arrow - The primary projectile in archery, prized for its aerodynamic design that enables speed and accuracy.",
    "B": "Babolat - French brand of tennis rackets and strings, known for its professional use (e.g. Rafael Nadal) and technological innovations.",
    "C": "Cleats - Studded shoes that provide essential traction and stability on grass or turf, making them crucial for performance in sports like soccer, football, and rugby.",
    "D": "Dumbbell - A versatile piece of strength-training equipment known for enabling a wide range of exercises to build and isolate muscle.",
    "E": "Epee - A thrusting-only fencing weapon used in Olympic competition, known for its heavier blade and whole-body target area.",
    "F": "Frisbee - A flying disc famous for recreational play and organized sports like Ultimate and disc golf thanks to its aerodynamic design and easy throwability.",
    "G": "Glove - A baseball glove is famous for protecting the hand and enabling players to catch and control the ball, making it essential to defensive play.",
    "H": "Helmet - A protective headgear renowned for reducing the risk of head and brain injuries in sports like cycling, American football, and hockey.",
    "I": "Iron - A golf club known for its accuracy and versatility in approach shots and short-game play.",
    "J": "Javelin - A spear used in track and field, renowned for requiring precise technique and explosive speed to achieve long-distance throws.",
    "K": "Kayak - A narrow, lightweight boat used in competitive paddling events like sprint and slalom, known for its speed and maneuverability.",
    "L": "Longboard - A long skateboard known for its stability and ability to achieve high speeds during downhill (downhill) and cruising.",
    "M": "Mikasa - A Japanese brand famous for making the official volleyballs used in the Olympics and international competitions for their consistent quality and durability.",
    "N": "Nike - A global leader in athletic footwear and equipment, famous for innovative shoe technology and high-profile athlete sponsorships.",
    "O": "Oar - A long pole with a flat blade used to propel and steer rowing boats, essential and iconic equipment in competitive rowing.",
    "P": "Puck - A hard rubber disc used in ice hockey, renowned for its durability and for enabling the fast, precise play that defines the sport.",
    "R": "Racket - The primary striking implement in sports like tennis, badminton, and squash, renowned for determining a player's power, control, and spin.",
    "S": "Skateboard - Iconic for enabling creative tricks, street-style riding and competitive skateboarding, and for its central role in skate culture and the sport's rise to the Olympics.",
    "T": "Treadmill - A staple of gyms and home workouts, the treadmill is famous for allowing controlled indoor running and walking training regardless of weather.",
    "U": "Uneven-bars - A women's artistic gymnastics apparatus featuring two horizontal bars at different heights, famous for dynamic swinging, release moves, and high-difficulty routines.",
    "V": "Vuvuzela - A plastic horn popularized at the 2010 FIFA World Cup, known for its loud buzzing that became emblematic of soccer fan culture.",
    "Y": "Yoke - A heavy strongman apparatus used to carry massive loads across a course, testing core, back and leg strength.",
    "Z": "Zamboni - The ice-resurfacing machine widely used in rinks, famed for quickly smoothing and maintaining ice for hockey and skating."
  },
  "Sports Team": {
    "A": "Arsenal - A famous English football club from London, known for its history, success in the Premier League, and offensive style of play.",
    "B": "Barcelona - Famous for its possession-based attacking football, its La Masia youth academy, and a rich trophy history including multiple La Liga and Champions League titles.",
    "C": "Celtics - A famous American basketball team from Boston, known for its high number of NBA titles and legends like Bill Russell and Larry Bird.",
    "D": "Dodgers - The Los Angeles Dodgers are well-known for their long history of success, multiple World Series championships, and for breaking baseball’s color barrier by signing Jackie Robinson.",
    "E": "Everton - A historic English football club known for its long-standing presence in the top flight, passionate fanbase, and strong local identity.",
    "F": "Flamengo - One of Brazil's most popular football clubs, famed for its huge fanbase and numerous national and continental titles.",
    "G": "Warriors - Known primarily for winning a few NBA titles in the last decade and the revolutionary three-point shooting style led by Stephen Curry.",
    "H": "Heat - The Miami Heat are well-known for multiple NBA championships, high-profile star players, and consistent playoff success.",
    "I": "Inter - One of Italy's most storied football clubs, famous for multiple Serie A titles and their 2010 UEFA Champions League victory.",
    "J": "Juventus - One of the most successful Italian football clubs, known for many domestic titles and a long history in European competitions.",
    "K": "Knicks - Known for their long history in the NBA, loyal fans, and playing in the iconic Madison Square Garden.",
    "L": "Lakers - The Los Angeles Lakers are one of the NBA's most successful and recognizable franchises, known for numerous championships and legendary star players.",
    "M": "Mavericks - The Dallas Mavericks are well-known for winning the 2011 NBA championship led by Dirk Nowitzki.",
    "N": "Nets - A well-known basketball team in the NBA, known for its star players and significant media presence.",
    "O": "Olympiacos - A significant Greek football club from Piraeus, known for many domestic titles and regular appearances in the Champions League.",
    "P": "Patriots - A famous American football team from New England known for many victories in the Super Bowl, especially in the era of Tom Brady.",
    "R": "Raptors - The Toronto Raptors are known for winning the 2019 NBA championship, becoming the first Canadian team to claim the title and hugely raising basketball's profile in Canada.",
    "S": "Spurs - The San Antonio Spurs are renowned for their sustained excellence, disciplined team play, and multiple NBA championships under coach Gregg Popovich.",
    "T": "Tottenham - Tottenham Hotspur are well-known for their attacking style and longstanding presence in top-level English football.",
    "U": "Udinese - Known for its prolific scouting and youth development that regularly uncovers talent and sustains competitive Serie A performances.",
    "V": "Vikings - The Minnesota Vikings are an NFL franchise known for their passionate fanbase and multiple Super Bowl appearances despite never winning the championship.",
    "Y": "Yankees - The New York Yankees are renowned for their record 27 World Series championships and their long-standing influence on Major League Baseball.",
    "Z": "Zenit - A Russian football club known for multiple domestic league titles and its 2008 UEFA Cup victory, making it a prominent force in Russian and European football."
  },
  "Superhero": {
    "A": "Aquaman - He is well-known for his telepathic command of marine life and rulership of Atlantis, making him the premier superhero of the oceans.",
    "B": "Batman - A billionaire vigilante detective who uses intelligence, martial skill, and advanced technology rather than superpowers to fight crime and become an enduring cultural icon.",
    "C": "Cyclops - A founding X-Men leader renowned for his powerful optic blasts and disciplined tactical leadership.",
    "D": "Daredevil - Known for his acrobatic skills, masterful combat style, and highly developed senses that he uses to fight crime despite his blindness.",
    "E": "Elastigirl - She is known for her elastic powers and for being a leading, family-focused superhero in Pixar's The Incredibles.",
    "F": "Flash - Famous for his super-speed, which lets him move and think at extraordinary velocities, run faster than light in some stories, and tap into the Speed Force.",
    "G": "Gambit - A Marvel mutant known for charging objects (notably playing cards) with explosive kinetic energy and for his charming Cajun rogue persona.",
    "H": "Hulk - He is known for his immense, rage-fueled strength as scientist Bruce Banner transforms into a nearly unstoppable green powerhouse.",
    "I": "Iceman - One of the original X-Men, known for his ability to create and control ice and frost.",
    "J": "Jubilee - Known for generating bright, explosive plasmoids as a youthful X-Men member and for her prominence in 1990s comics and the animated series.",
    "K": "Krypto - Superman's superpowered dog, famous for sharing his Kryptonian abilities (strength, flight and heat vision) and fierce loyalty.",
    "L": "Lobo - An ultra-violent, interstellar bounty hunter in DC Comics, famous for his superhuman strength, durability, and darkly comedic antihero persona.",
    "M": "Magneto - A mutant known for controlling magnetism, known as the leader of mutants and a frequent enemy of the X-Men.",
    "N": "Namor - Marvel's Sub-Mariner, one of the earliest comic antiheroes and King of Atlantis, known for his superhuman strength, aquatic abilities and turbulent relationships with the surface world.",
    "O": "Oracle - Known as Barbara Gordon’s identity after her paralysis, she became a preeminent information broker and hacker who provides crucial intelligence and coordination to the superhero community.",
    "P": "Punisher - Known as a merciless vigilante who fights crime through violence and murder instead of adhering to the traditional heroic code after losing his family.",
    "R": "Rogue - Famous for her ability to absorb others' powers, memories and life force by touch, making her both a formidable ally and a tragic character.",
    "S": "Superman - Known as the archetypal superhero for his superhuman strength, ability to fly, near-invulnerability and steadfast moral compass.",
    "T": "Thor - Known for wielding the enchanted hammer Mjolnir and being the Norse god of thunder, a central figure in Marvel comics and a founding Avenger.",
    "U": "Ultraman - A pioneering Japanese tokusatsu superhero, famous for growing to giant size to battle kaiju and inspiring decades of sci-fi and special-effects television.",
    "V": "Vision - An android Avenger famous for his synthetic intelligence, phasing and energy powers, and prominent role in Marvel Comics and the MCU.",
    "Y": "Yellowjacket - A Marvel superhero alias (most famously Hank Pym) known for using Pym Particles to shrink and grow and for his pivotal, sometimes controversial role among the Avengers.",
    "Z": "Zatanna - A stage magician and powerful sorceress best known for casting spells by speaking backwards and for her prominent role in DC Comics and the Justice League."
  },
  "Technology": {
    "A": "Android - A mobile operating system developed by Google, widely used on smartphones and tablets for its openness and vast app ecosystem.",
    "B": "Blockchain - A decentralized ledger technology known for enabling secure, transparent, and tamper-resistant recording of transactions across distributed networks.",
    "C": "CRISPR - A revolutionary gene-editing technology known for its precise, efficient ability to modify DNA, enabling rapid advances in genetic research and potential therapies.",
    "D": "Docker - A containerization platform known for simplifying application deployment and isolation using lightweight containers.",
    "E": "Ethereum - A decentralized platform for smart contracts and decentralized applications, known for popularizing programmable blockchains.",
    "F": "Firefox - A widely used open-source web browser known for strong privacy features, extensibility through add-ons, and commitment to open web standards.",
    "G": "Google - A dominant technology company best known for its search engine and advertising platform, and for developing Android and major cloud computing services.",
    "H": "HTML - A markup language used to create and structure web pages, which is the foundation of most websites.",
    "I": "Internet - The global network that transformed communication, information access, and commerce by connecting billions of devices and enabling services like the web, email, and streaming.",
    "J": "JavaScript - A high-level, dynamic programming language that powers interactive web pages and is ubiquitous in front-end and increasingly in back-end development.",
    "K": "Kubernetes - An open-source container orchestration system renowned for automating deployment, scaling, and management of containerized applications.",
    "L": "Linux - A widely used open-source operating system known for its stability, security, and dominant role in servers and cloud infrastructure.",
    "M": "Metaverse - A virtual, persistent shared space combining VR/AR and social interaction, widely known for driving immersive online experiences and major tech investment.",
    "N": "NVIDIA - A leading GPU maker famous for high-performance graphics cards and AI accelerators widely used in gaming, data centers, and machine learning.",
    "O": "OCR - Optical Character Recognition technology that converts images of printed or handwritten text into machine-readable text, widely used for digitizing documents and automating data entry.",
    "P": "Python - A versatile, high-level programming language known for its readable syntax and extensive ecosystem, widely used in web development, data science, automation, and scripting.",
    "R": "Radar - A technology using radio waves to detect and determine the position and velocity of objects, known from aviation and meteorology.",
    "S": "Selenium - A widely used open-source framework for automating web browsers, enabling reliable cross-browser testing and scripting across multiple languages.",
    "T": "TensorFlow - An open-source machine learning framework from Google, widely used for building, training and deploying deep neural networks.",
    "U": "USB - Univerzální sériové rozhraní pro připojování periferií a přenos dat, proslulé snadným použitím a širokou kompatibilitou.",
    "V": "Vulkan - A low-overhead, cross-platform 3D graphics and compute API known for providing explicit GPU control and high-performance multithreading.",
    "Y": "YouTube - The largest platform for sharing videos, known for its wide reach among content creators and monetization opportunities.",
    "Z": "Zigbee - A low-power, low-data-rate wireless standard widely used in IoT for its reliable mesh networking and long battery life."
  },
  "Tool": {
    "A": "Ansible - It is well-known for simple, agentless IT automation and orchestration using human-readable YAML playbooks.",
    "B": "Blender - Open-source 3D software známé pro své rozsáhlé nástroje pro modelování, animaci a renderování a aktivní komunitu.",
    "C": "ChatGPT - A conversational AI model known for generating coherent, context-aware, human-like text across a wide range of tasks.",
    "D": "Docker - A containerization platform that standardizes packaging and deployment of applications, making them portable and consistent across environments.",
    "E": "Excel - Known for its powerful spreadsheet capabilities and widespread use in data analysis, finance, and business reporting.",
    "F": "Figma - A collaborative interface design tool renowned for its real-time multi-user editing, prototyping, and design-system features.",
    "G": "Git - A distributed version control system known for its speed, efficient branching, and widespread adoption in software development.",
    "H": "Hammer - A simple, versatile hand tool widely known for driving nails and shaping materials, making it essential in construction and woodworking.",
    "I": "Inclinometer - A widely used tool in surveying and geotechnical engineering for precisely measuring angles of slope or tilt to monitor stability and deformation.",
    "J": "Jenkins - An open-source automation server widely known for enabling continuous integration and continuous delivery pipelines to automate building, testing, and deployment.",
    "K": "Knife - Known for its versatility as the primary cutting and utility tool across cooking, crafts, and survival contexts.",
    "L": "Laser - A tool known in medicine and industry for highly precise and directional cutting, welding, and measurement due to its coherent and intense light beam.",
    "M": "MATLAB - A high-level programming environment widely used in engineering and scientific computing for numerical analysis, algorithm development, and data visualization.",
    "N": "Nmap - A powerful network scanner known for reliable host discovery, port mapping, and service detection.",
    "O": "Osciloskop - A device for displaying and analyzing electrical signals in time, widely used in electronics for measuring and tuning circuits.",
    "P": "Photoshop - An industry-standard image-editing software known for powerful photo retouching, compositing, and design tools.",
    "R": "R - Statistický programovací jazyk a prostředí známé pro svou rozsáhlou sadu balíčků a silné statistické a grafické schopnosti.",
    "S": "Screwdriver - A fundamental hand tool renowned for its simplicity and versatility in driving and removing screws across virtually all construction, repair, and assembly work.",
    "T": "TensorFlow - An open-source machine learning framework by Google, renowned for scalable neural network development and deployment across platforms.",
    "U": "Unity - A popular cross-platform game engine known for its user-friendly editor, extensive asset store, and wide adoption among indie and mobile developers.",
    "V": "Vim - A modal text editor known for its lightning-fast, keyboard-driven editing and powerful extensibility, making it a favorite among programmers.",
    "Y": "YARA - A rule-based pattern-matching tool widely used by malware researchers and incident responders to identify, classify, and hunt malicious files and code.",
    "Z": "Zotero - A free, open-source reference manager known for its easy browser capture of citations and seamless citation generation across formats."
  },
  "Toy": {
    "A": "Aibo - A robotic dog from Sony, known as the pioneer of domestic entertainment robots due to its advanced interactivity and ability to mimic emotions.",
    "B": "Barbie - An iconic fashion doll introduced by Mattel in 1959, known worldwide for shaping imaginative play and influencing fashion and popular culture.",
    "C": "CabbagePatchKids - A line of adoptable cloth dolls famous for their unique individual faces and adoption certificates that sparked a major toy craze in the 1980s.",
    "D": "Doll - A toy representing a human or baby, widely known for imaginative play and iconic collectible lines like Barbie.",
    "E": "Erector - A classic metal construction set famous for letting children and hobbyists build durable mechanical models while learning basic engineering principles.",
    "F": "Furby - A robotic plush pet introduced in 1998 that became famous for its interactive speech, emotive responses, and perceived ability to \"learn\" from users.",
    "G": "Gundam - Renowned for its highly detailed plastic model kits (\"Gunpla\") that popularized building and collecting mecha models worldwide.",
    "H": "Hatchimals - Interactive toy creatures that hatch from eggs, known for their surprise reveal and huge holiday-season popularity.",
    "I": "Imaginext - A popular toy brand of building blocks and figures from Fisher‑Price, known for small interactive games that support children's creativity.",
    "J": "Jenga - A popular stacking game where players remove and replace wooden blocks without toppling the tower, renowned for its tense, balance-based gameplay.",
    "K": "Ken - Introduced by Mattel in 1961 as Barbie's companion, he is known as an iconic male fashion doll and enduring pop-culture figure.",
    "L": "Lego - A construction toy brand famous for its interlocking plastic bricks and limitless creative building possibilities.",
    "M": "Monopoly - A classic board game famous for its property-trading mechanics and long-standing popularity as a competitive family strategy game.",
    "N": "Nerf - Well-known for its foam-based blasters and projectiles that made fast, safe, action play widely popular.",
    "O": "Orbeez - A popular toy brand of superabsorbent polymer beads that expand into squishy balls in water and are widely used for sensory play and crafts.",
    "P": "Playmobil - A line of small, durable plastic figures and themed playsets from Germany, famous for encouraging imaginative, long-lasting role-play.",
    "R": "RubiksCube - Iconic 3D combination puzzle invented by Ernő Rubik, famous for its challenging mechanics, colorful faces and the global speedcubing community.",
    "S": "Slinky - A helical spring toy famous for \"walking\" down stairs and captivating generations with its simple, gravity-driven motion.",
    "T": "Tamagotchi - A handheld virtual pet released in 1996 that became a global phenomenon for its real-time care mechanics and role in launching the virtual pet craze.",
    "U": "Uno - A famous card game known for its simple color-and-number matching rules, wild cards, and fast-paced, family-friendly play.",
    "V": "Voltron - A famous toy and franchise known for its combine-able robot figures based on the popular 1980s animated series.",
    "Y": "Yo-yo - A classic toy known for its ability to perform tricks and for its long history as a skill-based pastime.",
    "Z": "Zoids - A model kit and toy franchise of mechanical animal robots, famous for its detailed buildable kits and popular anime tie-ins."
  },
  "Tradition": {
    "A": "Abrahamic - The Abrahamic tradition, encompassing Judaism, Christianity, and Islam, is renowned for its shared monotheistic roots and profound influence on law, ethics, and global history.",
    "B": "Buddhism - Renowned for its teachings on the Four Noble Truths and the Eightfold Path, offering a systematic method for understanding and alleviating suffering.",
    "C": "Confucianism - A Chinese philosophical and ethical tradition centered on filial piety, social harmony, and moral cultivation that has shaped East Asian government and society for millennia.",
    "D": "Druidism - An ancient Celtic tradition known for its emphasis on nature worship, rituals, and the preservation of myths and poetry.",
    "E": "Epicureanism - A Hellenistic philosophical tradition known for teaching that modest pleasures, absence of pain, and friendship are the path to a tranquil, happy life.",
    "F": "Flamenco - A passionate music and dance tradition from Andalusia, Spain, renowned worldwide for its emotional intensity, virtuosic guitar playing, expressive singing, and complex rhythmic patterns.",
    "G": "Gamelan - A traditional Indonesian ensemble music known for its interlocking percussion patterns, distinctive metallophone and gong timbres, and central role in ritual and cultural performances.",
    "H": "Hinduism - A ancient Indian religious and philosophical tradition known for its diverse mythology, rituals, and significant cultural influence.",
    "I": "Ignatian - Known for the Spiritual Exercises developed by St. Ignatius of Loyola, emphasizing discernment and active service.",
    "J": "Jainism - A religious tradition renowned for its strict adherence to nonviolence (ahimsa) and ascetic practices aimed at achieving spiritual liberation.",
    "K": "Kabbalah - A Jewish mystical tradition renowned for its esoteric teachings about the divine, creation, and the hidden meanings of scripture, influencing theology, philosophy, and popular spirituality.",
    "L": "Lutheranism - Famous for emphasizing justification by faith alone and the authority of Scripture, originating in the Protestant Reformation led by Martin Luther.",
    "M": "Mahayana - A significant Buddhist tradition known for its emphasis on the ideal of bodhisattva, unity, and widespread expansion in Asia.",
    "N": "Neoplatonism - A major philosophical and mystical tradition originating in the 3rd century AD that developed Plato's ideas into a comprehensive metaphysical system influential across late antiquity and medieval Christian, Jewish, and Islamic thought.",
    "O": "Opera - A long-standing musical-theatrical tradition known for combining orchestral composition, virtuosic singing, and dramatic staging to create enduring works by composers like Mozart and Verdi.",
    "P": "Platonism - A philosophical tradition originating with Plato, famous for its doctrine of Forms and its profound influence on metaphysics and Western thought.",
    "R": "Rastafari - A Jamaican religious and cultural movement known for reverence of Haile Selassie, promotion of Pan-African identity, and major influence on reggae music.",
    "S": "Sufism - A mystical tradition of Islam known for its ecstatic practices, poetry, and emphasis on direct personal union with God.",
    "T": "Taoism - An ancient Chinese philosophical and religious tradition known for teaching harmony with the Tao (the Way), profoundly influencing Chinese culture, medicine, and the arts.",
    "U": "Ukiyo-e - A Japanese woodblock print tradition famous for its stylized, colorful depictions of everyday life, landscapes, and kabuki actors.",
    "V": "Vajrayana - A branch of Buddhism known for its esoteric tantric teachings and elaborate rituals that have profoundly shaped Tibetan Buddhist practice.",
    "Y": "Yoga - An ancient Indian tradition best known for its widely practiced physical postures, breath-control, and meditation techniques that promote physical health and mental well-being.",
    "Z": "Zen - A Buddhist meditation tradition known for its practice of zazen and emphasis on direct experience of enlightenment."
  },
  "Trait": {
    "A": "Altruism - In evolutionary biology and social psychology, altruism is well-known for explaining cooperative behaviors that benefit others at a cost to the actor, shaping theories like kin selection and reciprocal altruism.",
    "B": "Bristly - Known for quick understanding of complex situations and the ability to find effective solutions.",
    "C": "Conscientiousness - Known in psychology for reliably predicting job performance, health behaviors, and long-term outcomes because it reflects organization, responsibility, and self-discipline.",
    "D": "Diligent - Known for consistent hard work and meticulous attention to detail, making them highly reliable and productive in professional and academic settings.",
    "E": "Empathy - Widely recognized in psychology and healthcare for improving relationships and outcomes by enabling practitioners to understand and respond to others' emotions.",
    "F": "Flexibility - Known for the ability to quickly adapt to changes, which is useful in management, innovation, and team work.",
    "G": "Grit - Known for perseverance and passionate effort towards long-term goals, which often predicts success.",
    "H": "Honesty - Valued in leadership, ethics, and relationships because it builds trust, credibility, and reliable communication.",
    "I": "Innovation - Known for introducing novel ideas and solutions that drive progress and transform industries.",
    "J": "Joviality - Known for its friendly and cheerful nature, which improves social atmosphere and facilitates making connections.",
    "K": "Knowledgeable - Known for deep expertise and reliable understanding of their field, making them a trusted authority.",
    "L": "Leadership - Renowned for the ability to motivate and guide teams to achieve objectives through vision, decision-making, and influence.",
    "M": "Machiavellianism - In psychology, it is known for describing manipulative, strategic interpersonal behavior focused on self-interest and exploitation.",
    "N": "Neuroticism - A Big Five personality trait denoting emotional instability and a tendency toward anxiety and negative affect, widely used to predict mental health outcomes and stress reactivity.",
    "O": "Openness - Widely known in personality psychology as the Big Five trait reflecting creativity, intellectual curiosity, and receptivity to new experiences, making it a strong predictor of artistic interests and cognitive flexibility.",
    "P": "Perseverance - Known in many fields for enabling individuals to persist through setbacks and steadily achieve long-term goals.",
    "R": "Rationality - Known for its ability to think systematically and logically, which is useful in decision-making in science, economics, and management.",
    "S": "Sociability - Valued for enabling people to form connections, influence others, and succeed in relationship-driven fields like sales, management, and client services.",
    "T": "Tenacity - Entrepreneurs are well-known for tenacity because they persist through setbacks and long odds to build successful ventures.",
    "U": "Unflappable - Renowned in leadership and crisis management for remaining calm under pressure, which enables clear, decisive action.",
    "V": "Visionary - Known for pioneering forward-looking ideas that reshape their field and inspire widespread change.",
    "Y": "Youthful - Known in entertainment and marketing for high energy, trendsetting influence, and rapid adoption of new technologies.",
    "Z": "Zeal - Known for intense enthusiasm and unwavering dedication that often propels movements, causes, and high-impact projects."
  },
  "Tree": {
    "A": "Apple - Cultivated worldwide for its edible fruit and central to pomology, with thousands of cultivars bred for flavor, storage, and climate adaptation.",
    "B": "Baobab - Renowned for its enormous, water-storing trunk, exceptional longevity, and iconic silhouette across African savannas.",
    "C": "Cedar - Renowned for its aromatic, rot-resistant timber widely used in construction, furniture, and cedar chests.",
    "D": "Dogwood - Renowned for its showy spring bracts and attractive form, making it a widely planted ornamental and important understory tree.",
    "E": "Eucalyptus - Widely known for its rapid growth and production of aromatic essential oils used in medicine, industry, and forestry.",
    "F": "Fir - A genus of evergreen conifers (Abies) widely known for their symmetrical shape and soft needles, making them popular as Christmas trees and important timber species.",
    "G": "Ginkgo - A living fossil renowned for its fan-shaped leaves, exceptional resilience, and extracts commonly used to support cognitive function.",
    "H": "Hickory - Renowned for its exceptionally hard, shock-resistant wood prized for tool handles, furniture and smoking meats, and for producing edible, flavorful nuts.",
    "I": "Iroko - A West African hardwood tree renowned in timber and woodworking for its durable, rot-resistant wood often used as a substitute for teak.",
    "J": "Jacaranda - Renowned for its prolific, showy lavender-blue blossoms that carpet streets and gardens each spring in warm climates.",
    "K": "Kapok - Known for its lightweight, water-resistant seed fiber historically used as stuffing for pillows, mattresses, insulation, and lifejackets.",
    "L": "Linden - Valued as an ornamental and medicinal tree, renowned for its fragrant, nectar-rich flowers used in calming herbal teas and for producing high-quality honey.",
    "M": "Maple - Valued for its striking autumn foliage and as the primary source of maple syrup, making it important both ornamentally and economically.",
    "N": "Neem - Renowned for its medicinal properties and natural insecticidal compounds, making it widely used in traditional medicine and organic pest control.",
    "O": "Oak - Renowned for its strong, durable timber, long lifespan, and key ecological role supporting diverse wildlife.",
    "P": "Pine - Known for being a fast-growing conifer widely used for timber and paper production and as a dominant species in boreal and temperate forests.",
    "R": "Redwood - A towering conifer native to California, famous for being among the tallest and longest-lived trees on Earth.",
    "S": "Sequoia - Renowned for being some of the largest and oldest trees on Earth, with enormous trunks and towering heights.",
    "T": "Teak - Known for its exceptionally durable and long-lasting timber, valued in shipbuilding and outdoor furniture.",
    "U": "Ulmus - Elms are well-known in urban forestry for their vase-shaped canopies and historical use as prominent street and shade trees before Dutch elm disease devastated their populations.",
    "V": "Viburnum - A genus of shrubs and small trees prized in horticulture and landscaping for their showy, often fragrant spring flowers, attractive foliage, and colorful berries.",
    "Y": "Yew - Renowned for its strong, elastic wood historically used for English longbows and for being a long-lived, ornamental, and toxic evergreen.",
    "Z": "Zelkova - Known as an ornamental and elm substitute for its graceful vase-shaped crown, attractive bark, and resistance to Dutch elm disease."
  },
  "TV Series": {
    "A": "Archer - A critically acclaimed animated spy comedy known for its sharp, irreverent humor, genre-parody writing, and distinctive visual style.",
    "B": "Bones - A forensic procedural famous for popularizing forensic anthropology on TV through its engaging crime-solving cases and strong character dynamics.",
    "C": "Chernobyl - Known for its realistic portrayal of the Chernobyl nuclear disaster and excellent acting and production.",
    "D": "Dexter - A gripping crime drama about a forensic blood-spatter analyst who moonlights as a vigilante serial killer, known for its dark moral complexity and Michael C. Hall’s acclaimed performance.",
    "E": "Euphoria - Known for its intense and stylistically striking portrayal of adolescence, drugs, and mental health.",
    "F": "Friends - Known for its charismatic characters, witty scripts, and significant cultural impact.",
    "G": "Glee - A musical comedy-drama known for its energetic show-choir performances, hit cover songs, and its handling of teen and social issues.",
    "H": "House - Renowned for its brilliant but abrasive diagnostician Dr. Gregory House and its intricate medical-mystery cases.",
    "I": "Invincible - Known for its brutal, emotionally charged deconstruction of the superhero genre and faithful adaptation of the comic series.",
    "J": "Justified - Known for its sharp, dialogue-driven modern Western storytelling and Timothy Olyphant's charismatic lead performance.",
    "K": "Kakegurui - A visually striking anime series known for its intense high-stakes gambling, psychological drama, and bold art style.",
    "L": "Lost - Renowned for its mysterious, serialized storytelling, complex mythology, and ensemble cast that reshaped modern TV drama.",
    "M": "Mindhunter - Acclaimed for its meticulous, psychological exploration of FBI agents developing criminal profiling techniques through interviews with serial killers.",
    "N": "Narcos - A Netflix series known for its gripping, cinematic portrayal of Pablo Escobar and the rise of the Colombian drug cartels, blending real events with dramatic storytelling.",
    "O": "Ozark - A critically acclaimed crime drama known for its dark, tense storytelling, complex moral dilemmas, and standout performances.",
    "P": "Power - A gritty crime drama known for its complex characters, tense storytelling, and cultural impact on contemporary urban television.",
    "R": "Rome - Famous for its cinematic production values and detailed, gritty portrayal of ancient Rome.",
    "S": "Seinfeld - A groundbreaking \"show about nothing\" renowned for its observational humor and lasting influence on sitcom writing and American pop culture.",
    "T": "Torchwood - A Doctor Who spinoff known for its darker, mature storytelling and for expanding the Whoniverse.",
    "U": "Utopia - A British conspiracy thriller renowned for its bold visual style, unsettling tone, and devoted cult following.",
    "V": "V - A sci-fi TV series known for its allegorical portrayal of an alien invasion that explored themes of fascism, propaganda, and resistance.",
    "Y": "Yellowstone - A modern Western drama known for revitalizing the genre with intense family power struggles, a sprawling ranch setting, and a star-studded cast led by Kevin Costner.",
    "Z": "Zorro - Famous for its iconic masked hero and swashbuckling adventures that helped define early television action series."
  },
  "Vegetable": {
    "A": "Asparagus - Known for its tender spear-like shoots and distinctive flavor, it’s celebrated as a springtime delicacy and nutritious vegetable.",
    "B": "Broccoli - Known for its high nutrient content (vitamins, fiber, antioxidants) and widespread promotion as a symbol of healthy eating.",
    "C": "Carrot - Known for its high beta-carotene content, which is converted to vitamin A and supports eye health.",
    "D": "Daikon - A large white Asian radish famous for its mild, peppery flavor and versatility in salads, pickles, and cooked dishes.",
    "E": "Eggplant - Known for its glossy purple skin and meaty texture, it’s widely used in global cuisines like Mediterranean and Asian dishes.",
    "F": "Fennel - Renowned for its crunchy bulb and licorice-like flavor, widely used raw or cooked in Mediterranean cuisine.",
    "G": "Garlic - Famous for its pungent flavor used worldwide in cooking and for its traditional medicinal properties.",
    "H": "Horseradish - A pungent root vegetable widely known for its sharp, spicy flavor used as a condiment and in sauces.",
    "I": "Iceberg - Iceberg lettuce is famous for its crisp, crunchy leaves and widespread use in salads and fast-food sandwiches due to its mild flavor and long shelf life.",
    "J": "Jalapeño - A spicy pepper widely used for its heat and flavor in Mexican and global cuisine.",
    "K": "Kale - A leafy green celebrated for its exceptional nutrient density and its widespread popularity as a staple of health-food and \"superfood\" trends.",
    "L": "Lettuce - A widely cultivated leafy green famous for its crisp texture and central role in salads and sandwiches worldwide.",
    "M": "Mushroom - Renowned for its umami flavor, culinary versatility, and widespread cultivation and use as an edible ingredient.",
    "N": "Nopal - A cactus pad widely used in Mexican cuisine for its crisp texture, tangy flavor and reputed health benefits.",
    "O": "Onion - A bulb vegetable famous for its pungent flavor and wide culinary use around the world.",
    "P": "Potato - Potatoes are famous worldwide as a versatile, high-yield staple crop used in countless dishes and an important source of carbohydrates.",
    "R": "Radish - A crisp, peppery root vegetable prized for its quick growth and sharp flavor that brightens salads and garnishes.",
    "S": "Salad - A popular leafy green used for fresh salads due to its taste, crispness, and versatility.",
    "T": "Tomato - A globally popular and versatile vegetable prized in cuisines worldwide for its flavor, culinary adaptability, and nutritional value.",
    "U": "Ube - A purple yam renowned for its vibrant color and sweet flavor, widely used in Filipino desserts and sweets.",
    "V": "Vidalia - A sweet onion variety from Vidalia, Georgia, USA, renowned for its mild, sugary flavor and protected regional status.",
    "Y": "Yam - A starchy tuber widely cultivated and eaten worldwide, known for its nutritional value and versatility in cooking.",
    "Z": "Zucchini - A widely cultivated summer squash known for its versatility in cooking, mild flavor, and high yields in home gardens."
  },
  "Vehicle": {
    "A": "Apollo - NASA's manned lunar program best known for achieving the first Moon landing with Apollo 11 in 1969.",
    "B": "Batmobile - Batman’s iconic, heavily modified vehicle is famous for its advanced gadgets, armor, and distinctive design used to fight crime.",
    "C": "Concorde - The supersonic passenger airliner renowned for dramatically reducing transatlantic flight times with its distinctive delta-wing design and Mach 2 cruise speed.",
    "D": "DeLorean - Known for its iconic role as the time machine in the film Back to the Future, featuring the DMC‑12 model.",
    "E": "Eleanor - The customized 1967 Ford Mustang made famous by the film Gone in 60 Seconds for its distinctive styling and starring role in thrilling car chases.",
    "F": "Ferrari - An Italian car manufacturer known for its high-performance sports cars and long-standing success in Formula 1.",
    "G": "Gallardo - A Lamborghini supercar known for its V10 engine, striking design, and role as the brand's best-selling model that made exotic performance more accessible.",
    "H": "Hummer - A large, military-derived SUV famous for its rugged off-road capability and status-symbol presence in popular culture.",
    "I": "Isetta - The BMW Isetta is a famous microcar known for its distinctive bubble shape and front-opening door, symbolizing affordable postwar urban transportation.",
    "J": "Jeep - Renowned for its rugged off-road capability and iconic, military-inspired design.",
    "K": "KITT - The artificially intelligent, nearly indestructible car from Knight Rider, famous for its self-driving capabilities and crime-fighting role.",
    "L": "Lamborghini - Renowned for producing high-performance, exotic supercars with bold Italian design and powerful engines, making it an icon in luxury automotive performance.",
    "M": "Mustang - The Ford Mustang is an iconic American muscle car known for its performance, distinctive styling, and lasting cultural influence since its 1964 debut.",
    "N": "Nimitz - The USS Nimitz is a famous nuclear-powered aircraft carrier renowned for its enormous size, endurance, and central role in projecting U.S. naval power.",
    "O": "Orion - NASA's crewed spacecraft designed for deep-space missions, best known for its central role in the Artemis program to return humans to the Moon.",
    "P": "Porsche - Renowned for the 911 and other high-performance sports cars that combine racing heritage, engineering excellence, and iconic design.",
    "R": "Raptor - The F-22 Raptor is a fifth-generation stealth fighter celebrated for its air-superiority performance, supercruise ability, and advanced avionics.",
    "S": "Spitfire - The Supermarine Spitfire is a famed British WWII fighter aircraft, celebrated for its speed, agility, and crucial role in winning the Battle of Britain.",
    "T": "Titanic - The RMS Titanic is famous for being a luxurious ocean liner that sank on its maiden voyage in 1912, becoming an enduring symbol of maritime disaster and prompting major safety reforms.",
    "U": "Unimog - A multi-purpose truck from Mercedes, known for its exceptional off-road capabilities and versatile use in both civilian and military sectors.",
    "V": "Vespa - Iconic Italian scooter known for its stylish design, affordability, and lasting cultural impact in urban transport.",
    "Y": "Yugo - A cheap Yugoslavian car known for its low price and poor reputation for quality, popular in the 80s in the USA.",
    "Z": "Zamboni - Machines for preparing ice surfaces, known for their ability to quickly smooth and clean ice in hockey arenas."
  },
  "Video Game": {
    "A": "Amnesia - Influential indie survival-horror known for its oppressive atmosphere, sanity mechanics, and emphasis on hiding rather than fighting.",
    "B": "BioShock - Known for its deep moral and political themes, atmospheric art‑deco setting, and innovative combination of FPS with RPG elements.",
    "C": "Civilization - A landmark 4X strategy series renowned for deep empire-building, complex diplomacy and technology trees, and its addictive \"one-more-turn\" gameplay.",
    "D": "Doom - Known for defining the FPS genre through fast action, pioneering multiplayer, and extensive modding possibilities.",
    "E": "EVE - Known for its complex player-driven economic system and massive PvP conflicts in the persistent space MMO.",
    "F": "Fortnite - A battle royale game known for its building mechanics, frequent live updates, and massive cultural impact.",
    "G": "Gothic - Known for its pioneering open world and intense RPG mechanics, which strongly influenced European action RPGs.",
    "H": "Hades - Known for its smooth combat, deep storytelling, and excellent rewards for repeated play.",
    "I": "Ico - A landmark action-adventure puzzle game celebrated for its minimalist storytelling, atmospheric world, and innovative companion-based puzzles.",
    "J": "Journey - Known for its emotional, minimalist storytelling, atmospheric visuals, and innovative anonymous cooperative gameplay.",
    "K": "Kenshi - Known for its tough survival gameplay, player freedom, and emergent gameplay systems.",
    "L": "Limbo - Known for its minimalist monochrome visuals, eerie atmosphere, and inventive physics-based puzzles that helped define modern indie platformers.",
    "M": "Minecraft - Known for popularizing open-ended sandbox gameplay and block-based world-building that enabled massive user-created content, modding, and educational uses.",
    "N": "Nier - Known for its emotional and philosophical storyline, exceptional music, and experimental combination of action combat with unconventional storytelling.",
    "O": "Overwatch - A team-based hero shooter known for its diverse roster of characters, accessible objective-focused gameplay, and major influence on modern multiplayer shooter design.",
    "P": "Portal - Known for its innovative portal-based puzzles, clever physics-driven gameplay, and darkly humorous narrative that reshaped first-person puzzle games.",
    "R": "RimWorld - Known for its deep colony-simulation mechanics, emergent storytelling driven by complex AI storytellers, and extensive mod support.",
    "S": "Skyrim - Renowned as an open-world RPG for its expansive, immersive world and massive modding community that prolonged its popularity.",
    "T": "Tetris - A pioneering tile-matching puzzle game renowned for its simple yet addictive mechanics, broad cultural impact, and lasting influence on game design.",
    "U": "Undertale - An indie RPG celebrated for subverting traditional combat and morality systems by letting players spare or befriend enemies, coupled with memorable characters and a standout soundtrack.",
    "V": "Valorant - A popular competitive tactical shooter from Riot Games, known for its precise shooting, unique character abilities, and strong esports scene.",
    "Y": "Yakuza - Known for its strong stories, distinctive characters, and dynamic fights set in the atmosphere of Japanese underworld.",
    "Z": "Zelda - The Legend of Zelda series is known for defining the action-adventure genre through pioneering integration of exploration, puzzles, and epic storytelling."
  },
  "Weather": {
    "A": "Aurora - A spectacular natural light display in the polar skies caused by charged particles from the solar wind colliding with Earth’s atmosphere.",
    "B": "Blizzard - A blizzard is a severe snowstorm with strong sustained winds and very low visibility, known for causing major disruption and hazards.",
    "C": "Cyclone - A large-scale low-pressure weather system with rotating winds that can produce intense storms, heavy rain, and destructive winds.",
    "D": "Derecho - A widespread, long-lived windstorm associated with a fast-moving band of severe thunderstorms, known for producing extensive straight-line wind damage across large regions.",
    "E": "El Niño - A periodic climate phenomenon marked by unusually warm sea surface temperatures in the central and eastern Pacific that disrupts global weather patterns.",
    "F": "Fujita - A Japanese-American meteorologist best known for creating the Fujita scale to classify tornado intensity and for pioneering severe-storm research.",
    "G": "Gale - A gale is a strong wind, typically defined as 34-40 knots on the Beaufort scale, known for causing coastal damage and posing dangers to ships.",
    "H": "Hurricane - A powerful tropical cyclone known for its extremely strong winds, storm surge, and flooding that have caused some of the most destructive weather disasters, such as Hurricane Katrina.",
    "I": "Ike - A powerful 2008 hurricane known for its devastating storm surge and widespread damage along the U.S. Gulf Coast, particularly in Galveston and Houston.",
    "J": "Jetstream - A strong, narrow band of fast winds in the higher layers of the atmosphere, which controls the movement of pressure systems and significantly affects the weather.",
    "K": "Katrina - A hurricane known for its widespread flooding in New Orleans and high number of casualties.",
    "L": "Lightning - A powerful electrical discharge in storms, famous for its bright flashes and thunder and for its dramatic impacts like starting wildfires and disrupting electrical systems.",
    "M": "Monsun - A seasonal wind that brings heavy rain, which significantly affects the climate and agriculture in large areas.",
    "N": "Nor'easter - A powerful coastal storm that brings heavy snow, strong winds, and flooding to the U.S. Northeast, causing major winter disruption.",
    "O": "Ophelia - Hurricane Ophelia (2017) is known for becoming a powerful storm that tracked unusually far east, bringing destructive winds to Ireland and the UK.",
    "P": "PineappleExpress - A tropical storm known for bringing intense rainfall and flooding to the western coast of the United States due to the flow of moist air from the Hawaiian Islands.",
    "R": "Rain - The most common form of precipitation, widely known for replenishing freshwater supplies, supporting agriculture, and strongly influencing daily life and ecosystems.",
    "S": "Sandy - Hurricane Sandy is well-known for the devastating storm surge and widespread flooding it caused along the U.S. East Coast in 2012.",
    "T": "Typhoon - A powerful tropical cyclone in the western Pacific known for extremely strong winds, torrential rains, and devastating coastal impacts.",
    "U": "Ulysses - Typhoon Ulysses (international name Vamco) became infamous for its rapid intensification and catastrophic flooding across the Philippines in November 2020.",
    "V": "Vortex - A rotating column of air, famous for being the core structure of tornadoes and other intense wind phenomena.",
    "Y": "Yamase - A cold, northeasterly wind in northern Japan, known for bringing cool and humid weather in the summer, which often damages crops.",
    "Z": "Zonda - A dry, hot foehn-like wind in Argentina known for sudden temperature spikes and damage to agriculture and structures."
  },
  "Writer": {
    "A": "Austen - Renowned for her sharp social satire and enduring novels of manners, especially Pride and Prejudice, which helped shape the modern novel.",
    "B": "Borges - Argentinský spisovatel známý pro své krátké povídky plné metafyziky, labyrintů a knihovních motivů.",
    "C": "Camus - French-Algerian writer and philosopher best known for novels like The Stranger that explore absurdism and the human condition.",
    "D": "Dickens - He is renowned for his novels filled with vivid characters and social criticism of Victorian England, such as Oliver Twist and Great Expectations.",
    "E": "Eliot - T. S. Eliot was a leading modernist poet and critic best known for works like \"The Waste Land\" that reshaped 20th-century poetry.",
    "F": "Fitzgerald - An American writer known for his novel The Great Gatsby, which critically portrays the changes of the American dream.",
    "G": "Goethe - A towering German writer and thinker, best known for Faust and his profound influence on literature and philosophy.",
    "H": "Hemingway - Renowned for his terse, economical prose and influential novels such as The Old Man and the Sea, which helped shape 20th-century American fiction.",
    "I": "Ibsen - Norwegian playwright regarded as the father of modern drama for realist works like A Doll's House that challenged social norms.",
    "J": "Joyce - Irish modernist writer James Joyce is renowned for pioneering stream-of-consciousness narrative and his landmark novel Ulysses.",
    "K": "Kafka - Renowned for his surreal, existential stories such as \"The Metamorphosis\" and \"The Trial\" that probe themes of alienation, bureaucracy, and absurdity.",
    "L": "Lorca - A Spanish poet and playwright famed for his passionate, lyrical works and tragic dramas that blend folklore with surrealist imagery.",
    "M": "Molière - A 17th-century French dramatist known for his comedies and social satire, such as Tartuffe and The Misanthrope.",
    "N": "Nabokov - A Russian-American novelist celebrated for his dazzling, linguistically inventive prose and the controversial masterpiece Lolita, which probes obsession and unreliable narration.",
    "O": "OscarWilde - Irish playwright and novelist famed for his sharp wit and enduring works like The Picture of Dorian Gray and The Importance of Being Earnest.",
    "P": "Proust - French novelist best known for In Search of Lost Time, a landmark modernist work renowned for its deep exploration of memory and consciousness.",
    "R": "Rushdie - Salman Rushdie is renowned for his magical-realist novels, notably \"Midnight's Children\" and \"The Satanic Verses\", which blend history, politics, and myth.",
    "S": "Shakespeare - Widely regarded as the greatest playwright in the English language, known for his enduring plays and sonnets that profoundly shaped Western literature.",
    "T": "Tolkien - J. R. R. Tolkien is renowned for creating the richly detailed world of Middle-earth and writing The Hobbit and The Lord of the Rings, which defined modern fantasy.",
    "U": "Ursula - Ursula K. Le Guin was a celebrated speculative fiction writer known for her imaginative world-building and incisive explorations of gender, politics, and anthropology in works like The Left Hand of Darkness.",
    "V": "Voltaire - An Enlightenment French writer, philosopher, and satirist known for his work Candide and his defense of freedom of speech.",
    "Y": "Yeats - Renowned Irish poet and playwright, celebrated for his central role in the Irish Literary Revival and for iconic poems such as \"The Second Coming.\"",
    "Z": "Zola - A famous French writer and pioneer of naturalism, known for novels such as Germinal."
  }
}